{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Hamish Rodda"
            }
        ],
        "Category": "Core",
        "Description": "This plugin provides a browsable model of the currently parsed classes and other items.",
        "Description[bg]": "Тази приставка дава модел за разглеждане на вече синтактично изгладени класове и други параграфи.",
        "Description[bs]": "Ovaj dodatak omogučava pregledan model trenutno analiziranih klasa i drugih stvari.",
        "Description[ca@valencia]": "Este connector proporciona un model navegable de les classes analitzades actualment i altres elements.",
        "Description[ca]": "Aquest connector proporciona un model navegable de les classes analitzades actualment i altres elements.",
        "Description[da]": "Dette plugin tilbyder en model der kan gennemses for de fortolkede klasser og andre elementer.",
        "Description[de]": "Dieses Modul bietet eine Liste der aktuell eingelesenen Klassen und anderer Elemente.",
        "Description[el]": "Αυτό το πρόσθετο προσφέρει ένα μοντέλο περιήγησης των αναλυμένων κλάσεων και άλλων αντικειμένων.",
        "Description[en_GB]": "This plugin provides a browsable model of the currently parsed classes and other items.",
        "Description[es]": "Este complemento proporciona un modelo navegable de las clases analizadas actualmente y otros elementos.",
        "Description[et]": "See plugin pakub parajasti parsitavate klasside ja teiste elementide sirvitavat mudelit.",
        "Description[fi]": "Tämä liitännäinen tarjoaa selattavan mallin nykyisellään jäsennetyistä luokista ja muista kohteista.",
        "Description[fr]": "Ce module externe fournit un modèle navigable des classes et autres éléments dont l'analyse syntaxique est en cours.",
        "Description[gl]": "Este complemento fornece un modelo navegábel das clases e outros elementos que estean procesados.",
        "Description[hu]": "Ez a bővítmény biztosítja a jelenleg feldolgozott osztályok és egyéb elemek böngészhető modelljét.",
        "Description[it]": "Questa estensione fornisce un modello sfogliabile delle classi attualmente analizzate e altri elementi.",
        "Description[kk]": "Бұл плагині талдау астындағы клас не басқа нысандарыңын шолуға ыңғайлы үлгісін құрып береді.",
        "Description[nb]": "Dette programtillegget gir en modell som det går an å bla i, av de klassene som er tolket og ande elementer.",
        "Description[nds]": "Dit Moduul stellt en dörkiekbor Modell vun de opstunns inleesten Klassen un anner Objekten praat.",
        "Description[nl]": "Deze plugin levert een model om door te bladeren van de nu ontlede klasse's en andere items.",
        "Description[pl]": "Ta wtyczka udostępnia możliwy do przeglądania model przeanalizowanych klas i innych elementów.",
        "Description[pt]": "Este 'plugin' oferece um modelo navegável pelas classes e outros itens processados neste momento.",
        "Description[pt_BR]": "Este plugin fornece um modelo navegável das classes atualmente analisadas e outros itens.",
        "Description[ru]": "Это расширение предоставляет просматриваемую модель разобранных на текущий момент классов и других элементов.",
        "Description[sk]": "Tento plugin poskytuje prehliadateľný model aktuálne analyzovanej triedy a iných položiek.",
        "Description[sl]": "Vstavek prinaša model trenutno razčlenjenih razredov in drugih predmetov, po katerih je moč brskati.",
        "Description[sv]": "Insticksprogrammet tillhandahåller en bläddringsbar modell av klasser och andra objekt som för närvarande har tolkats.",
        "Description[tr]": "Bu eklenti ayrıştırılmış sınıflar ve diğer ögeler için göz atmaya uygun bir model sağlar.",
        "Description[ug]": "بۇ قىستۇرما نۆۋەتتە تەھىل قىلىنغان تىپ ۋە باشقا تۈرلەرنىڭ كۆرۈنۈشچان مودېلىنى تەمىنلەيدۇ",
        "Description[uk]": "За допомогою цього додатка можна створити придатну для перегляду модель класів та інших елементів, над якими ви працюєте.",
        "Description[x-test]": "xxThis plugin provides a browsable model of the currently parsed classes and other items.xx",
        "Description[zh_CN]": "此插件提供了一个当前已分析类和其它项目的可浏览化视窗模型。",
        "Description[zh_TW]": "此外掛程式提供一個可瀏覽目前已分析的類別與其他項目的模組。",
        "Icon": "code-class",
        "Id": "kdevclassbrowser",
        "License": "GPL",
        "Name": "Class Browser",
        "Name[bg]": "Браузър за класове",
        "Name[bs]": "Pregledač klasa",
        "Name[ca@valencia]": "Navegador de classes",
        "Name[ca]": "Navegador de classes",
        "Name[cs]": "Prohlížeč tříd",
        "Name[da]": "Klassebrowser",
        "Name[de]": "Klassen-Browser",
        "Name[el]": "Περιηγητής κλάσεων",
        "Name[en_GB]": "Class Browser",
        "Name[es]": "Navegador de clases",
        "Name[et]": "Klassibrauser",
        "Name[fi]": "Luokkaselain",
        "Name[fr]": "Navigateur de classes",
        "Name[gl]": "Navegador de clases",
        "Name[hu]": "Osztályböngésző",
        "Name[it]": "Browser classi",
        "Name[ja]": "クラスブラウザ",
        "Name[kk]": "Класс шолғышы",
        "Name[nb]": "Klasseleser",
        "Name[nds]": "Klassenkieker",
        "Name[nl]": "Klassebrowser",
        "Name[pl]": "Przeglądarka klas",
        "Name[pt]": "Navegador de Classes",
        "Name[pt_BR]": "Navegador de Classes",
        "Name[ru]": "Дерево классов",
        "Name[sk]": "Prehliadač tried",
        "Name[sl]": "Brskalnik po razredih",
        "Name[sv]": "Klassbläddrare",
        "Name[tr]": "Sınıf Tarayıcı",
        "Name[ug]": "تىپ كۆرگۈ",
        "Name[uk]": "Переглядач класів",
        "Name[x-test]": "xxClass Browserxx",
        "Name[zh_CN]": "类浏览器",
        "Name[zh_TW]": "類別瀏覽器",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
