{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Adam Treat",
                "Name[ka]": "ადამ ტრეატი",
                "Name[x-test]": "xxAdam Treatxx"
            }
        ],
        "Category": "Utilities",
        "Description": "This plugin displays a graphical view of all documents currently loaded and separates them by mimetype.",
        "Description[az]": "Bu qoşma, mime növü tərəfindən hal-hazırda yüklənmiş və ayrılmış bütün sənədlərin qrafik görünüşünü əks etdirir.",
        "Description[ca@valencia]": "Este connector mostra una visualització gràfica de tots els documents carregats actualment, separats pel tipus MIME.",
        "Description[ca]": "Aquest connector mostra una visualització gràfica de tots els documents carregats actualment, separats pel tipus MIME.",
        "Description[cs]": "Tento zásuvný modul zobrazuje grafický pohled všech aktuálně načtených dokumentů a odděluje je podle typu MIME.",
        "Description[de]": "Dieses Modul zeigt alle aktuell geladenen Dokumente getrennt nach ihren MIME-Typen an.",
        "Description[el]": "Το πρόσθετο αυτό εμφανίζει μια γραφική προβολή όλων των εγγράφων που φορτώνονται και τα διαχωρίζει με βάση το αναγνωριστικό τύπου.",
        "Description[eo]": "Ĉi tiu kromaĵo montras grafikan vidon de ĉiuj dokumentoj nuntempe ŝarĝitaj kaj apartigas ilin per mimetipo.",
        "Description[es]": "Este complemento muestra una vista gráfica de todos los documentos actualmente cargados y los separa por su tipo MIME.",
        "Description[et]": "See plugin näitab graafiliselt kõiki laaditud dokumente ja eraldab need MIME tüübi alusel.",
        "Description[eu]": "Plugin honek unean kargatutako dokumentu guztien ikuspen grafikoa erakusten du eta mimetype-z banatzen ditu.",
        "Description[fr]": "Ce module affiche une vue graphique de tous les documents actuellement chargés et les sépare par type MIME.",
        "Description[gl]": "Este complemento amosa unha vista gráfica de todos os documentos que están cargados e sepáraos segundo o seu tipo MIME.",
        "Description[it]": "Questa estensione mostra una vista grafica di tutti i documenti attualmente caricati e li separa per il tipo MIME.",
        "Description[ka]": "ეს დამატება აჩვენებს ამჟამად ჩატვირთული ყველა დოკუმენტის გრაფიკულ ხედს და დაყოფს მათ MIME ტიპის მიხედვით.",
        "Description[ko]": "이 플러그인은 현재 문서온 문서를 그래픽으로 표시하고 MIME 형식에 따라 구분합니다.",
        "Description[nl]": "Deze plugin toont een grafische voorstelling van alle nu geladen documenten en scheidt deze door het mimetype.",
        "Description[pl]": "Umożliwia przeglądanie otwartych dokumentów w widoku graficznym i dzieli je po typach mime.",
        "Description[pt]": "Este 'plugin' mostra uma vista gráfica sobre todos os documentos abertos de momento e separa-os pelo seu tipo MIME.",
        "Description[pt_BR]": "Este plugin mostra uma vista gráfica sobre todos os documentos carregados no momento e separa-os por tipo MIME.",
        "Description[ru]": "Это расширение выводит графическое представление всех загруженных в данный момент документов и группирует их по типу MIME",
        "Description[sk]": "Tento plugin zobrazí grafický pohľad všetkých dokumentov aktuálne načítaných a rozdelí ich podľa mimetype.",
        "Description[sl]": "Ta vstavek prikazuje vse trenutno naložene dokumente in jih ločuje glede na vrsto MIME.",
        "Description[sv]": "Insticksprogrammet visar en grafisk vy av alla dokument som för närvarande har laddats och delar upp dem enligt Mime-typ.",
        "Description[tr]": "Bu eklenti, şu anda yüklenmiş olan tüm belgeleri grafiksel bir görünümde gösterir ve MIME türlerine göre ayırır.",
        "Description[uk]": "Цей додаток відображає у графічному вигляді всі відкриті документи і впорядковує їх за типом MIME.",
        "Description[x-test]": "xxThis plugin displays a graphical view of all documents currently loaded and separates them by mimetype.xx",
        "Description[zh_CN]": "此插件显示当前已加载文档的图形视图并按照 mime 类型分类。",
        "Description[zh_TW]": "這個外掛程式顯示目前載入並依 MIME 型態分類的文件的圖形檢視。",
        "Icon": "document-preview",
        "License": "LGPL",
        "Name": "Document View",
        "Name[az]": "Sənədə baxış",
        "Name[bg]": "Изглед за документи",
        "Name[ca@valencia]": "Visor de documents",
        "Name[ca]": "Visualitzador de documents",
        "Name[cs]": "Pohled na dokumenty",
        "Name[da]": "Dokumentvisning",
        "Name[de]": "Dokumentansicht",
        "Name[el]": "Προβολή εγγράφου",
        "Name[eo]": "Dokumenta Vido",
        "Name[es]": "Vista de documento",
        "Name[et]": "Dokumendivaade",
        "Name[eu]": "Dokumentu ikuspegia",
        "Name[fi]": "Tiedostonäkymä",
        "Name[fr]": "Vue Document",
        "Name[ga]": "Amharc Cáipéise",
        "Name[gl]": "Vista do documento",
        "Name[hu]": "Dokumentumnézet",
        "Name[it]": "Vista documento",
        "Name[ka]": "დოკუმენტის ხედი",
        "Name[kk]": "Құжат көрінісі",
        "Name[ko]": "문서 보기",
        "Name[nb]": "Dokumentvisning",
        "Name[nds]": "Dokmentenansicht",
        "Name[nl]": "Documentweergave",
        "Name[pl]": "Widok dokumentu",
        "Name[pt]": "Área de Documentos",
        "Name[pt_BR]": "Visualização de documentos",
        "Name[ru]": "Панель документов",
        "Name[sk]": "Pohľad na dokumenty",
        "Name[sl]": "Prikaz dokumentov",
        "Name[sv]": "Dokumentvisning",
        "Name[tr]": "Belge Görünümü",
        "Name[ug]": "پۈتۈك كۆرۈنۈشى",
        "Name[uk]": "Перегляд документів",
        "Name[x-test]": "xxDocument Viewxx",
        "Name[zh_CN]": "文档视图",
        "Name[zh_TW]": "文件檢視",
        "Version": "0.1"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
