{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Hamish Rodda"
            }
        ],
        "Category": "Core",
        "Description": "This plugin allows running of programs with no instrumentor, ie. natively by the current host.",
        "Description[bg]": "Тaзи приставка позволява изпълнение на програмата без основния модул, т.е. локално на текущата машина.",
        "Description[bs]": "Ovaj dodatak omogučava pokretanje programa bez instrumentora, tj. koristeći mogučnosti trenutnog računara.",
        "Description[ca@valencia]": "Este connector permet executar programes sense «instrumentor», és a dir, nativament per a l'amfitrió actual.",
        "Description[ca]": "Aquest connector permet executar programes sense «instrumentor», és a dir, nativament per a l'amfitrió actual.",
        "Description[da]": "Dette plugin tillader kørsel af programmer uden instrumentor dvs. nativt på det nuværende system.",
        "Description[de]": "Dieses Modul erlaubt das Ausführen von Programmen im Kontext des Betriebssystems.",
        "Description[el]": "Αυτό το πρόσθετο επιτρέπει την εκτέλεση προγραμμάτων χωρίς οργανωτή, πχ. εγγενώς από τον τρέχων υπολογιστή.",
        "Description[en_GB]": "This plugin allows running of programs with no instrumentor, ie. natively by the current host.",
        "Description[es]": "Este complemento permite ejecutar programas sin instrumentor (es decir, de forma nativa por la máquina actual).",
        "Description[et]": "See plugin võimaldab panna programme aktiivses masinas tööle ilma instrumentaatorita, s.t loomulikult.",
        "Description[fi]": "Tämä liitännäinen mahdollistaa ohjelmien suorittamisen ilman välikappaletta, ts. natiivisti nykyisellä tietokoneella.",
        "Description[fr]": "Ce module externe permet le lancement de programmes sans instrumenteur, c'est-à-dire nativement par l'hôte actuel.",
        "Description[gl]": "Este complemento permite executar programas sen instrumentador, i.e. de xeito nativo na máquina actual.",
        "Description[hu]": "Ez a bővítmény lehetővé teszi programok futtatását instrumentor nélkül, például natívan a jelenlegi gépen.",
        "Description[it]": "Questa estensione permette l'esecuzione dei programmi senza instrumentor, vale a dire nativamente da parte dell'host attuale.",
        "Description[kk]": "Бұл плагин көмегімен бағдарламаны тікелей назардағы хостта жегуге болады.",
        "Description[nb]": "Dette programtillegget tillater kjøring av programmer uten instrumentering, dvs. lokalt på den gjeldende verten.",
        "Description[nds]": "Dit Moduul föhrt Programmen ahn Utstatter ut, d.h. bloots mit den aktuellen Reekner.",
        "Description[nl]": "Deze plugin staat het uitvoeren van programma's toe zonder hulpprogramma, dwz. van nature op de huidige host.",
        "Description[pl]": "Wtyczka ta pozwala na uruchamianie programów bez instrumentora, np. natywnie przez obecnego hosta.",
        "Description[pt]": "Este 'plugin' permite a execução dos programas não-instrumentalizados, i.e. nativamente pela máquina actual.",
        "Description[pt_BR]": "Este plugin permite executar programas sem orquestrador, ou seja, nativamente pelo computador hospedeiro.",
        "Description[ru]": "Это расширение позволяет запускать программы без инструментальной обвязки, то есть непосредственно на текущем компьютере.",
        "Description[sk]": "Tento plugin umožňuje spustenie programov bez inštrumentora, teda natívne aktuálnym hostiteľom.",
        "Description[sl]": "Vstavek omogoča zaganjanje programov, za katere v KDevelop ni posebnega grafičnega vmesnika.",
        "Description[sv]": "Insticksprogrammet tillåter att program utan instrumentering körs, dvs. direkt av nuvarande värddator.",
        "Description[tr]": "Bu eklenti, uygulamaları, kullanılan makine üzerinde, hiç bir ek araç kullanmadan doğal hali ile çalıştırmayı sağlar.",
        "Description[uk]": "За допомогою цього додатка можна запускати програми безпосередньо на поточному вузлі.",
        "Description[x-test]": "xxThis plugin allows running of programs with no instrumentor, ie. natively by the current host.xx",
        "Description[zh_CN]": "此插件允许以无操作者方式运行程序，例如，当前主机的原生方式。",
        "Description[zh_TW]": "此外掛程式允許在目前主機上執行程式。",
        "Icon": "system-run",
        "Id": "kdevexecute",
        "License": "GPL",
        "Name": "Execute Programs",
        "Name[bg]": "Изпълняване на програми",
        "Name[bs]": "Izvrši programe",
        "Name[ca@valencia]": "Executa programes",
        "Name[ca]": "Executa programes",
        "Name[cs]": "Spustit programy",
        "Name[da]": "Kør programmer",
        "Name[de]": "Programme ausführen",
        "Name[el]": "Εκτέλεση προγραμμάτων",
        "Name[en_GB]": "Execute Programs",
        "Name[es]": "Ejecutar programas",
        "Name[et]": "Programmide täitmine",
        "Name[fi]": "Suorita ohjelmia",
        "Name[fr]": "Exécuter des programmes",
        "Name[ga]": "Rith Ríomhchláir",
        "Name[gl]": "Executar programas",
        "Name[hu]": "Programok végrehajtása",
        "Name[it]": "Esegui i programmi",
        "Name[ja]": "プログラムを実行",
        "Name[kk]": "Бағдарламаларды орындау",
        "Name[nb]": "Kjør programmer",
        "Name[nds]": "Programmen utföhren",
        "Name[nl]": "Programma's uitvoeren",
        "Name[pl]": "Wykonaj programy",
        "Name[pt]": "Execução de Programas",
        "Name[pt_BR]": "Executar programa",
        "Name[ru]": "Запуск программ",
        "Name[sk]": "Spustiť programy",
        "Name[sl]": "Izvedi programe",
        "Name[sv]": "Kör program",
        "Name[tr]": "Uygulamaları Çalıştır",
        "Name[ug]": "پروگرامما ئىجرا قىلىش",
        "Name[uk]": "Виконання програм",
        "Name[x-test]": "xxExecute Programsxx",
        "Name[zh_CN]": "执行程序",
        "Name[zh_TW]": "執行程式",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Interfaces": ["org.kdevelop.IExecutePlugin"],
    "X-KDevelop-Mode": "NoGUI"
}
