{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Milian Wolff",
                "Name[x-test]": "xxMilian Wolffxx"
            }
        ],
        "Category": "Project Management",
        "Description": "Configure which files and folders inside the project folder should be included or excluded.",
        "Description[ca@valencia]": "Configura quins fitxers i carpetes dins de la carpeta del projecte s'han d'incloure o excloure.",
        "Description[ca]": "Configura quins fitxers i carpetes dins de la carpeta del projecte s'han d'incloure o excloure.",
        "Description[de]": "Legt fest, welche Dateien und Ordner innerhalb des Projektordners ein- oder ausgeschlossen werden sollen.",
        "Description[es]": "Configurar los archivos y carpetas que pertenecen a la carpeta del proyecto y que deben ser incluidos o excluidos.",
        "Description[et]": "Määramine, millised projektikataloogi failid ja kataloogid kaasata või välja jätta.",
        "Description[fi]": "Valitse, mitkä projektikansiossa olevat tiedostot ja kansiot pitäisi ottaa mukaan ja mitkä pitäisi jättää pois.",
        "Description[fr]": "Configurer quels fichiers et dossiers à l'intérieur du dossier projet doivent être inclus ou exclus.",
        "Description[gl]": "Configurar cales ficheiros e cartafoles dentro do cartafol do proxecto deben incluírse ou excluírse.",
        "Description[it]": "Configura quali file e cartelle nella cartella del progetto devono essere incluse o escluse.",
        "Description[nl]": "Stel in welke bestanden en mappen in de projectmap meegenomen of uitgesloten moeten worden.",
        "Description[pl]": "Ustaw jakie pliki i katalogi wewnątrz katalogu projektu mają być uwzględniane albo wykluczane.",
        "Description[pt]": "Configurar os ficheiros ou pastas, dentro da pasta do projecto, que deverão ser incluídos ou excluídos.",
        "Description[pt_BR]": "Configura os arquivos e pastas, dentro da pasta do projeto, que devem ser incluídos ou excluídos.",
        "Description[sk]": "Nastaviť, ktoré súbory a priečinky v priečinku projektu majú byť zahrnuté alebo vylúčené.",
        "Description[sl]": "Nastavi katere datoteke in mape znotraj mape projekta naj bodo vključene ali izključene.",
        "Description[sv]": "Anpassa vilka filer och kataloger inne i projektkatalogen som ska inkluderas eller exkluderas.",
        "Description[tr]": "Proje klasörü içerisindeki hangi dosya ve klasörlerin dahil edilip edilmeyeceğini yapılandır.",
        "Description[uk]": "За допомогою цього модуля можна визначити, які файли і теки у теці проекту має бути включено або виключено з його складу.",
        "Description[x-test]": "xxConfigure which files and folders inside the project folder should be included or excluded.xx",
        "Description[zh_CN]": "配置项目文件中哪些文件被加入或排除。",
        "Icon": "view-filter",
        "Id": "KDevProjectFilter",
        "Name": "Project Filter",
        "Name[ca@valencia]": "Filtre de projecte",
        "Name[ca]": "Filtre de projecte",
        "Name[cs]": "Filtr projektů",
        "Name[de]": "Projektfilter",
        "Name[es]": "Filtro de proyectos",
        "Name[fr]": "Filtre de projet",
        "Name[it]": "Filtro progetto",
        "Name[nb]": "Prosjektfilter",
        "Name[nl]": "Projectfilter",
        "Name[pl]": "Filtr projektu",
        "Name[pt]": "Filtro de Projectos",
        "Name[ru]": "Фильтр проекта",
        "Name[sk]": "Filter projektu",
        "Name[sv]": "Projektfilter",
        "Name[tr]": "Proje Süzgeci",
        "Name[uk]": "Фільтр проекту",
        "Name[x-test]": "xxProject Filterxx",
        "Name[zh_CN]": "项目过滤器",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Project",
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IProjectFilter"
    ],
    "X-KDevelop-LoadMode": "AlwaysOn",
    "X-KDevelop-Mode": "GUI"
}
