{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Milian Wolff",
                "Name[x-test]": "xxMilian Wolffxx"
            }
        ],
        "Category": "Utilities",
        "Description": "Run external scripts or applications to manipulate the editor contents or do other arbitrary actions.",
        "Description[ca@valencia]": "Executa scripts externs o aplicacions per a manipular el contingut de l'editor o altres accions arbitràries.",
        "Description[ca]": "Executa scripts externs o aplicacions per a manipular el contingut de l'editor o altres accions arbitràries.",
        "Description[cs]": "Spouštějte externí skripty nebo aplikace a pracujte s obsahem editoru nebo dělejte jiné libovolné akce.",
        "Description[de]": "Führen Sie externe Skripte oder Programme zum Verändern des Editorinhalts oder für beliebige andere Aktionen aus.",
        "Description[es]": "Ejecutar scripts externos o aplicaciones para manipular el contenido del editor o realizar otras acciones.",
        "Description[et]": "Välised skriptid või rakendused, mis võimaldavad muuta redaktori sisu või ette võtta mingeid muid toiminguid.",
        "Description[fi]": "Suorittaa ulkoisia skriptejä tai sovelluksia editorisisällön manipuloimiseksi tai muiden satunnaisten tehtävien tekemiseksi.",
        "Description[fr]": "Exécuter des scripts externes ou des applications pour manipuler les contenus de l'éditeur ou autres actions arbitraires.",
        "Description[gl]": "Executa scripts externos ou aplicativos para manipular os contidos do editor ou levar a cabo outras accións.",
        "Description[it]": "Avvia script o applicazioni esterne per manipolare il contenuto dell'editor o per eseguire altre azioni.",
        "Description[nl]": "Externe scripts of programma's uitvoeren om de inhoud van de bewerker te manipuleren of andere acties uit te voeren.",
        "Description[pl]": "Uruchamiaj zewnętrzne skrypty lub programy, aby manipulować zawartością edytora lub innymi dowolnymi działaniami.",
        "Description[pt]": "Executa programas ou aplicações externas para manipular o conteúdo do editor ou para efectuar outras acções arbitrárias.",
        "Description[pt_BR]": "Execute scripts externos ou aplicativos para manipular os conteúdos do editor ou para fazer outras ações ordinárias.",
        "Description[sk]": "Spustí externé skripty alebo aplikácie na manipuláciu s obsahom editora alebo robí iné ľubovoľné akcie.",
        "Description[sl]": "Zaganjajte zunanje skripte ali programe, ki upravljajo z vsebino urejevalnika ali pa opravljajo druga poljubna dejanja.",
        "Description[sv]": "Kör externa skript eller program för att behandla editorns innehåll eller utför andra godtyckliga åtgärder.",
        "Description[tr]": "Düzenleyici içeriğini değiştirmek veya diğer keyfi eylemler için dış betikler veya uygulamalar çalıştır.",
        "Description[uk]": "Запускає зовнішні скрипти або програми для обробки текстових даних редактора або виконання інших потрібних дій.",
        "Description[x-test]": "xxRun external scripts or applications to manipulate the editor contents or do other arbitrary actions.xx",
        "Description[zh_CN]": "运行外部脚本或应用程序来处理编辑器内容或者执行其它任意动作。",
        "Icon": "system-run",
        "Id": "kdevexternalscript",
        "License": "GPL",
        "Name": "External Scripts",
        "Name[ca@valencia]": "Scripts externs",
        "Name[ca]": "Scripts externs",
        "Name[cs]": "Externí skripty",
        "Name[de]": "Externe Skripte",
        "Name[es]": "Scripts externos",
        "Name[et]": "Välised skriptid",
        "Name[fi]": "Ulkoiset skriptit",
        "Name[fr]": "Scripts externes",
        "Name[gl]": "Scripts externos",
        "Name[it]": "Script esterni",
        "Name[nb]": "Eksterne skripter",
        "Name[nl]": "Externe scripts",
        "Name[pl]": "Zewnętrzne skrypty",
        "Name[pt]": "Programas Externos",
        "Name[pt_BR]": "Scripts externos",
        "Name[ru]": "Внешние сценарии",
        "Name[sk]": "Externé skripty",
        "Name[sl]": "Zunanji skripti",
        "Name[sv]": "Externa skript",
        "Name[tr]": "Dış Betikler",
        "Name[uk]": "Зовнішні скрипти",
        "Name[x-test]": "xxExternal Scriptsxx",
        "Name[zh_CN]": "外部脚本",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-IRequired": [
        "org.kdevelop.IOutputView"
    ],
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IPlugin"
    ],
    "X-KDevelop-Mode": "GUI"
}
