{
    "KPlugin": {
        "Authors": [
            {
                "Name": "Andreas Pakulat"
            }
        ],
        "Category": "Core",
        "Description": "This plugin allows to open files with associated external applications.",
        "Description[bg]": "Тази приставка позволява отваряне на файлове със съответни външни програми.",
        "Description[bs]": "Ovaj dodatak dopušta otvaranje datoteka sa povezanim eksternim aplikacijama.",
        "Description[ca@valencia]": "Este connector permet obrir fitxers amb les aplicacions externes associades.",
        "Description[ca]": "Aquest connector permet obrir fitxers amb les aplicacions externes associades.",
        "Description[da]": "Dette plugin tillader at åbne filer med associerede eksterne applikationer.",
        "Description[de]": "Mit diesem Modul können Dateien mit ihnen zugewiesenen externen Anwendungen gestartet werden.",
        "Description[el]": "Αυτό το πρόσθετο επιτρέπει το άνοιγμα αρχείων με σχετικές εξωτερικές εφαρμογές",
        "Description[en_GB]": "This plugin allows to open files with associated external applications.",
        "Description[es]": "Este complemento permite abrir archivos con aplicaciones externas asociadas.",
        "Description[et]": "See plugin võimaldab avada väliste rakendustega seostatud faile.",
        "Description[fi]": "Tämä liitännäinen mahdollistaa ulkoisiin sovelluksiin liitettyjen tiedostojen avaamisen.",
        "Description[fr]": "Ce module externe permet d'ouvrir des fichiers avec des applications externes associées.",
        "Description[gl]": "Este complemento permite abrir ficheiros cos programas externos asociados.",
        "Description[hu]": "Ez a bővítmény lehetővé teszi fájlok megnyitását a kapcsolódó külső alkalmazásokkal.",
        "Description[it]": "Questa estensione permette di aprire i file con le relative applicazioni esterne.",
        "Description[kk]": "Бұл плагині файлдарды ашуға тиісті сыртқы қолданбаларды жұмсайды.",
        "Description[nb]": "Dette programtillegget kan åpne filer med tilknyttede eksterne programmer.",
        "Description[nds]": "Mit dit Moduul laat sik Dateien mit towiest extern Programmen opmaken.",
        "Description[nl]": "Deze plugin biedt het openen van bestanden met geassocieerde externe toepassingen.",
        "Description[pl]": "Ta wtyczka pozwala na otwieranie plików, z którymi są powiązane zewnętrzne programy.",
        "Description[pt]": "Este 'plugin' permite abrir os ficheiros com as aplicações externas associadas.",
        "Description[pt_BR]": "Este plugin permite abrir os arquivos com os aplicativos externos associados.",
        "Description[ru]": "Это расширение позволяет открывать файлы в связанном внешнем приложении.",
        "Description[sk]": "Tento plugin umožňuje otvoriť súbory s asociovanými externými aplikáciami.",
        "Description[sl]": "Vstavek omogoča odpiranje datotek v povezanih zunanjih programih.",
        "Description[sv]": "Insticksprogrammet tillåter att öppna filer med tillhörande externa program.",
        "Description[tr]": "Bu eklenti dosyaları ilişkilendirilmiş dış uygulamalar ile açmayı sağlar.",
        "Description[uk]": "За допомогою цього додатка ви зможете відкривати файли у пов’язаній з ними зовнішній програмі.",
        "Description[x-test]": "xxThis plugin allows to open files with associated external applications.xx",
        "Description[zh_CN]": "此插件允许使用关联的外部应用程序打开文件。",
        "Description[zh_TW]": "此外掛程式讓您可以用外部應用程式開啟檔案。",
        "Icon": "document-open",
        "Id": "kdevopenwith",
        "License": "GPL",
        "Name": "Open With",
        "Name[bg]": "Отваряне с",
        "Name[bs]": "Otvori pomoću",
        "Name[ca@valencia]": "Obri amb",
        "Name[ca]": "Obre amb",
        "Name[cs]": "Otevřít pomocí",
        "Name[da]": "Åbn med",
        "Name[de]": "Öffnen mit",
        "Name[el]": "Άνοιγμα με",
        "Name[en_GB]": "Open With",
        "Name[es]": "Abrir con",
        "Name[et]": "Avamine rakendusega",
        "Name[fi]": "Avaa ohjelmalla",
        "Name[fr]": "Ouvrir avec",
        "Name[gl]": "Abrir con",
        "Name[hu]": "Megnyitás ezzel",
        "Name[it]": "Apri con",
        "Name[ja]": "アプリケーションで開く",
        "Name[kk]": "Мынамен ашу",
        "Name[mr]": "यामध्ये उघडा",
        "Name[nb]": "Åpne med",
        "Name[nds]": "Opmaken mit",
        "Name[nl]": "Openen met",
        "Name[pl]": "Otwórz za pomocą",
        "Name[pt]": "Abrir Com",
        "Name[pt_BR]": "Abrir com",
        "Name[ru]": "Открыть с помощью",
        "Name[sk]": "Otvoriť s",
        "Name[sl]": "Odpri z",
        "Name[sv]": "Öppna med",
        "Name[tr]": "Birlikte Aç",
        "Name[ug]": "بۇنىڭدا ئېچىش",
        "Name[uk]": "Відкриття у зовнішніх програмах",
        "Name[x-test]": "xxOpen Withxx",
        "Name[zh_CN]": "打开方式",
        "Name[zh_TW]": "開啟方式",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Interfaces": ["org.kdevelop.IOpenWith"],
    "X-KDevelop-Mode": "GUI",
}
