{
    "KPlugin": {
        "Category": "Utilities",
        "Description": "Allows switching between buddy documents like implementation and header file.",
        "Description[az]": "Tətbiqetmə və başlıq faylları kimi əlaqələnmiş sənədlər arasında keçid etməyə imkan verir. ",
        "Description[ca@valencia]": "Permet canviar entre documents associats com fitxers d'implementacions i de capçaleres.",
        "Description[ca]": "Permet commutar entre documents associats com fitxers d'implementacions i de capçaleres.",
        "Description[de]": "Ermöglicht das Umschalten zwischen verwandten Dokumenten wie Implementations- und Header-Dateien.",
        "Description[el]": "Επιτρέπει την εναλλαγή ανάμεσα σε συμπληρωματικά έγγραφα όπως αρχεία implementation και header",
        "Description[en_GB]": "Allows switching between buddy documents like implementation and header file.",
        "Description[eo]": "Ebligas ŝanĝi inter kamaradaj dokumentoj kiel efektivigo kaj kapdosiero.",
        "Description[es]": "Permite cambiar entre documentos asociados, como la implementación y el archivo de cabecera.",
        "Description[et]": "Võimaldab lülituda sõltlasdokumentide, näiteks teostus- ja päisefaili vahel.",
        "Description[eu]": "Inplementazioa eta goiburu-fitxategia moduko dokumentu-lagunen artean trukatzen uzten du.",
        "Description[fi]": "Mahdollistaa vaihtamisen yhteen kuuluvien tiedostojen kuten toteutus- ja otsaketiedoston välillä.",
        "Description[fr]": "Permet de basculer entre des documents amis comme l'implémentation et le fichier d'en-tête.",
        "Description[gl]": "Permite trocar entre documentos tipo buddy como implementación e ficheiro de cabeceira.",
        "Description[it]": "Consente il passaggio tra i documenti associati come implementazioni e file header.",
        "Description[ka]": "საშუალებას გაძლევთ, გადართოთ ურთიერთდამოკიდებულ დოკუმენტებს (კოდის) და თავსართის (.h) ფაილებს შორის.",
        "Description[ko]": "구현과 헤더 파일 등 짝을 이루는 문서를 전환합니다.",
        "Description[nl]": "Biedt omschakelen tussen buddy-documenten zoals implementatie en header-bestand.",
        "Description[pl]": "Przełącza pomiędzy stowarzyszonymi dokumentami takimi jak pliki implementacji i nagłówków.",
        "Description[pt]": "Permite a alternância entre os documentos associados, como o ficheiro de implementação ou o de inclusão.",
        "Description[pt_BR]": "Permite a mudança de documentos associados, como os arquivos de implementação e de inclusão.",
        "Description[ru]": "Позволяет переключаться между связанными документами, например файлом реализации и заголовочным файлом",
        "Description[sk]": "Umožňuje prepínanie medzi dokumentmi priateľov ako súbor implementácie a hlavičky.",
        "Description[sl]": "Omogoča preklapljanje med prijateljskimi dokumenti kot na primer izvedbo in datoteko glave.",
        "Description[sv]": "Tillåter byte mellan samhörande dokument som implementerings- och deklarationsfiler.",
        "Description[tr]": "Uygulama ve başlık dosyası gibi ilişkili belgeler arasında geçişe izin verir.",
        "Description[uk]": "Надає змогу перемикатися на споріднені документи, зокрема файли з реалізацією та файли заголовків.",
        "Description[x-test]": "xxAllows switching between buddy documents like implementation and header file.xx",
        "Description[zh_CN]": "允许在伙伴文件中切换，如实现与头文件",
        "Description[zh_TW]": "允許在相關文件，如實作與標頭檔間切換。",
        "Icon": "document-multiple",
        "Name": "Switch to Buddy",
        "Name[az]": "Əlaqəli olana keçin",
        "Name[bs]": "Pređi na prijatelja",
        "Name[ca@valencia]": "Canvia a associat",
        "Name[ca]": "Commuta a associat",
        "Name[da]": "Skift til vennefil",
        "Name[de]": "Zu verwandtem Element wechseln",
        "Name[el]": "Εναλλαγή στο συμπληρωματικό",
        "Name[en_GB]": "Switch to Buddy",
        "Name[eo]": "Ŝanĝi al Buddy",
        "Name[es]": "Cambiar al asociado",
        "Name[et]": "Lülitumine sõltlasele",
        "Name[eu]": "Aldatu adiskidera",
        "Name[fi]": "Vaihda Buddyyn",
        "Name[fr]": "Passage à Buddy",
        "Name[gl]": "Pasar a Buddy",
        "Name[hu]": "Váltás az ismerősre",
        "Name[it]": "Passa al file associato",
        "Name[ka]": "Buddy-ზე გადართვა",
        "Name[kk]": "Тиістіге ауысу",
        "Name[ko]": "짝으로 전환",
        "Name[nb]": "Bytt til kamerat",
        "Name[nl]": "Naar Buddy omschakelen",
        "Name[pl]": "Przejdź do stowarzyszonego",
        "Name[pt]": "Mudar para o Ficheiro Associado",
        "Name[pt_BR]": "Mudar para o arquivo associado",
        "Name[ru]": "Переход к связанному",
        "Name[sk]": "Prepnúť na Buddy",
        "Name[sl]": "Preklopi na prijatelja",
        "Name[sv]": "Byt till samhörande",
        "Name[tr]": "Dosta Geçiş Yap",
        "Name[uk]": "Перемикання на споріднений",
        "Name[x-test]": "xxSwitch to Buddyxx",
        "Name[zh_CN]": "切换至伙伴文件",
        "Name[zh_TW]": "切換到相關文件"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
