{
    "KPlugin": {
        "Category": "Utilities",
        "Description": "Allows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.",
        "Description[ca@valencia]": "Permet la cerca ràpida de múltiples fitxers usant patrons o expressions regulars. I també permet substitucions.",
        "Description[ca]": "Permet la cerca ràpida de múltiples fitxers usant patrons o expressions regulars. I també permet substitucions.",
        "Description[cs]": "Umožní rychlé vyhledávání více souborů za použití řetězců nebo regulárních výrazů. Umožní také jejich nahrazování.",
        "Description[de]": "Ermöglicht es, Dateien mit Hilfe von Mustern und regulären Ausdrücken zu durchsuchen bzw. Ersetzungen vorzunehmen.",
        "Description[es]": "Permite la búsqueda rápida en múltiples archivos usando patrones o expresiones regulares. También permite realizar sustituciones.",
        "Description[et]": "Lubab mustreid või regulaaravaldisi kasutades kiiresti paljudes failides teksti otsida, samuti asendada.",
        "Description[fr]": "Permet de rechercher rapidement dans plusieurs fichiers en utilisant des motifs ou des expressions rationnelles. Et permet de le remplacer aussi.",
        "Description[gl]": "Permite facer unha busca rápida en varios ficheiros empregando padróns ou expresións regulares, e tamén realizar substitucións.",
        "Description[it]": "Consente la ricerca veloce di file multipli usando espressioni regolari o modelli. E consente anche di sostituirli.",
        "Description[nl]": "Staat toe snel te zoeken naar meerdere bestanden met gebruik van patronen of reguliere expressies. Staat ook vervanging toe.",
        "Description[pl]": "Pozwala na szybkie znajdowanie wielu plików wykorzystując wzorce lub regularne wyrażenia. Pozwala także na ich zastępowanie.",
        "Description[pt]": "Permite a pesquisa rápida em vários ficheiros, usando padrões ou expressões regulares. Permite também a sua substituição.",
        "Description[pt_BR]": "Permite pesquisar rapidamente em vários arquivos, usando padrões ou expressões regulares e também realizar substituições.",
        "Description[sk]": "Umožní rýchle hľadanie viacerých súborov pomocou vzorov alebo regulárnych výrazov a umožní ich nahradiť.",
        "Description[sl]": "Omogoča hitro iskanje po več datotekah z uporabo vzorcev ali regularnih izrazov. Omogoča tudi zamenjave.",
        "Description[sv]": "Tillåter snabb sökning i flera filer med mönster eller reguljära uttryck, och tillåter dessutom ersättning.",
        "Description[tr]": "Kalıplar veya düzenli ifadeler kullanarak birden çok dosyada hızlı aramaya izin verir. Yer değiştirmeye de izin verir.",
        "Description[uk]": "Надає можливості швидкого пошуку та заміни у декількох файлів на основі шаблонів або формальних виразів.",
        "Description[x-test]": "xxAllows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.xx",
        "Description[zh_CN]": "可以用模式或正则表达式快速搜索多个文件，还可以替换。",
        "Icon": "kfind",
        "Id": "kdevgrepview",
        "Name": "Find/Replace In Files",
        "Name[ca@valencia]": "Cerca i substitució en fitxers",
        "Name[ca]": "Cerca i substitució en fitxers",
        "Name[cs]": "Hledat-nahradit v souborech",
        "Name[de]": "In Dateien suchen/ersetzen",
        "Name[es]": "Buscar/sustituir en archivos",
        "Name[et]": "Failides otsimine ja asendamine",
        "Name[fr]": "Chercher / Remplacer dans les fichiers",
        "Name[gl]": "Buscar/Substituír nos ficheiros",
        "Name[it]": "Cerca/Sostituisci nei file",
        "Name[nb]": "Finn/erstatt i filer",
        "Name[nl]": "Zoeken/vervangen in bestanden",
        "Name[pl]": "Znajdź/zastąp w plikach",
        "Name[pt]": "Procurar/Substituir nos Ficheiros",
        "Name[pt_BR]": "Procurar/substituir nos arquivos",
        "Name[ru]": "Поиск/замена в файлах",
        "Name[sk]": "Hľadať/nahradiť v súboroch",
        "Name[sl]": "Najdi/zamenjaj v datotekah",
        "Name[sv]": "Sök eller ersätt i filer",
        "Name[tr]": "Bu Dosyalarda Bul ve Değiştir",
        "Name[uk]": "Пошук або заміна у файлах",
        "Name[x-test]": "xxFind/Replace In Filesxx",
        "Name[zh_CN]": "在文件中查找/替换",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
