{
    "KPlugin": {
        "Category": "Utilities",
        "Description": "Allows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.",
        "Description[ar]": "تسمح بالبحث السريع في ملفّات متعدّدة باستخدام أنماط أو تعابير نمطيّة. وتسمح بالاستبدال أيضًا.",
        "Description[az]": "Şablonlar və müntəzəm ifadələrdən istifadə edərək cəld axtarışa imkan yaradır. Və onu əvəzləməyə də icazə verir.",
        "Description[ca@valencia]": "Permet la busca ràpida de múltiples fitxers utilitzant patrons o expressions regulars. I també permet substitucions.",
        "Description[ca]": "Permet la cerca ràpida de múltiples fitxers usant patrons o expressions regulars. I també permet substitucions.",
        "Description[cs]": "Umožní rychlé vyhledávání více souborů za použití řetězců nebo regulárních výrazů. Umožní také jejich nahrazování.",
        "Description[de]": "Ermöglicht es, Dateien mit Hilfe von Mustern und regulären Ausdrücken zu durchsuchen bzw. Ersetzungen vorzunehmen.",
        "Description[el]": "Επιτρέπει γρήγορη αναζήτηση πολλών αρχείων με χρήση προτύπων ή κανονικών εκφράσεων. Επιτρέπει και την αντικατάστασή τους επίσης.",
        "Description[en_GB]": "Allows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.",
        "Description[eo]": "Ebligas rapidan serĉadon de pluraj dosieroj uzante ŝablonojn aŭ regulajn esprimojn. Kaj ankaŭ permesu anstataŭigi ĝin.",
        "Description[es]": "Permite la búsqueda rápida en múltiples archivos usando patrones o expresiones regulares. También permite realizar sustituciones.",
        "Description[et]": "Lubab mustreid või regulaaravaldisi kasutades kiiresti paljudes failides teksti otsida, samuti asendada.",
        "Description[eu]": "Ereduak edo adierazpen erregularrak erabiliz hainbat fitxategien bilaketa azkarra ahalbidetzen du. Ordezketa ere baimentzen du.",
        "Description[fi]": "Mahdollistaa nopean useiden tiedostojen haun mallien tai säännöllisten lausekkeiden avulla. Sallii myös korvauksen.",
        "Description[fr]": "Permet de rechercher rapidement dans plusieurs fichiers en utilisant des motifs ou des expressions rationnelles. Et permet de le remplacer aussi.",
        "Description[gl]": "Permite facer unha busca rápida en varios ficheiros usando padróns ou expresións regulares, e tamén realizar substitucións.",
        "Description[it]": "Consente la ricerca veloce di file multipli usando espressioni regolari o modelli. E consente anche di sostituirli.",
        "Description[ka]": "საშუალებას გაძლევთ, სწრაფად მოძებნოთ ბევრ ფაილში ნიმუშების ან რეგულარული გამოსახულებების გამოყენებით. ასევე საშუალება აქვს, ჩაანაცვლოს ეს ტექსტი.",
        "Description[ko]": "여러 파일에서 패턴이나 정규 표현식을 사용하여 빠르게 찾거나 바꿉니다.",
        "Description[nl]": "Staat toe snel te zoeken naar meerdere bestanden met gebruik van patronen of reguliere expressies. Staat ook vervanging toe.",
        "Description[pl]": "Szybko znajduje wiele plików wykorzystując wzorce lub regularne wyrażenia. Umożliwia także ich zastępowanie.",
        "Description[pt]": "Permite a pesquisa rápida em vários ficheiros, usando padrões ou expressões regulares. Permite também a sua substituição.",
        "Description[pt_BR]": "Permite pesquisar rapidamente em vários arquivos, usando padrões ou expressões regulares e também realizar substituições.",
        "Description[ru]": "Позволяет быстро искать (и заменять) текст по множеству файлов, применяя шаблоны поиска или регулярные выражения",
        "Description[sa]": "प्रतिमानस्य अथवा नियमितव्यञ्जनस्य उपयोगेन बहुविधसञ्चिकानां शीघ्रं अन्वेषणं भवति । तथा तस्य स्थाने अपि अनुमन्यताम्।",
        "Description[sk]": "Umožní rýchle hľadanie viacerých súborov pomocou vzorov alebo regulárnych výrazov a umožní ich nahradiť.",
        "Description[sl]": "Omogoča hitro iskanje po več datotekah z uporabo vzorcev ali regularnih izrazov. Omogoča tudi zamenjave.",
        "Description[sv]": "Tillåter snabb sökning i flera filer med mönster eller reguljära uttryck, och tillåter dessutom ersättning.",
        "Description[tr]": "Dizgiler veya düzenli ifadeler kullanarak birden çok dosyada tez aramaya izin verir. Başka ögelerle değiştirme de olanaklıdır.",
        "Description[uk]": "Надає можливості швидкого пошуку та заміни у декількох файлів на основі шаблонів або формальних виразів.",
        "Description[zh_CN]": "可以用模式或正则表达式快速搜索多个文件，还可以替换。",
        "Description[zh_TW]": "允許使用樣式或正規表示式來快速搜尋與取代多個檔案。",
        "Icon": "kfind",
        "Name": "Find/Replace In Files",
        "Name[ar]": "اعثر واستبدل في الملفّات",
        "Name[az]": "Fayllarda tapın/əvəzləyin",
        "Name[bg]": "Търсене и заместване във файлове",
        "Name[bs]": "Nađi/zamijeni u datotekama",
        "Name[ca@valencia]": "Busca i substitució en fitxers",
        "Name[ca]": "Cerca i substitució en fitxers",
        "Name[cs]": "Hledat-nahradit v souborech",
        "Name[da]": "Find/erstat i filer",
        "Name[de]": "In Dateien suchen/ersetzen",
        "Name[el]": "Αναζήτηση/Αντικατάσταση σε αρχεία",
        "Name[en_GB]": "Find/Replace In Files",
        "Name[eo]": "Trovi/Anstataŭigi En Dosieroj",
        "Name[es]": "Buscar/sustituir en archivos",
        "Name[et]": "Failides otsimine ja asendamine",
        "Name[eu]": "Aurkitu/Ordeztu fitxategietan",
        "Name[fi]": "Etsi ja korvaa tiedostoista",
        "Name[fr]": "Chercher / Remplacer dans les fichiers",
        "Name[gl]": "Atopar e substituír en ficheiros",
        "Name[hu]": "Keresés/csere fájlokban",
        "Name[it]": "Cerca/Sostituisci nei file",
        "Name[ka]": "ფაილებში ძებნა/ჩანაცვლება",
        "Name[kk]": "Файлдарда іздеу/ауыстыру",
        "Name[ko]": "파일에서 찾거나 바꾸기",
        "Name[nb]": "Finn/erstatt i filer",
        "Name[nds]": "Söken un Utwesseln in Dateien",
        "Name[nl]": "Zoeken/vervangen in bestanden",
        "Name[pl]": "Znajdź/zastąp w plikach",
        "Name[pt]": "Procurar/Substituir nos Ficheiros",
        "Name[pt_BR]": "Procurar/substituir nos arquivos",
        "Name[ru]": "Поиск/замена в файлах",
        "Name[sa]": "Find/Replace In Files इति",
        "Name[sk]": "Hľadať/nahradiť v súboroch",
        "Name[sl]": "Najdi/zamenjaj v datotekah",
        "Name[sv]": "Sök eller ersätt i filer",
        "Name[tr]": "Dosyalarda Bul ve Değiştir",
        "Name[ug]": "ھۆججەت ئىچىدىن ئىزدەش/ئالماشتۇرۇش",
        "Name[uk]": "Пошук або заміна у файлах",
        "Name[zh_CN]": "在文件中查找/替换",
        "Name[zh_TW]": "在檔案中尋找/取代"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
