{
    "KPlugin": {
        "Authors": [
            {
                "Name": "David Nolden",
                "Name[x-test]": "xxDavid Noldenxx"
            }
        ],
        "Category": "Core",
        "Description": "This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.",
        "Description[ca@valencia]": "Aquest connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[ca]": "Aquest connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[cs]": "Tento zásuvný modul ukazuje v bočním pohledu informace o současném jazykovém kontextu a zvýrazňuje důležité deklarace a použití.",
        "Description[de]": "Dieses Modul zeigt Informationen über den aktuellen Sprachkontext an und hebt die wichtigen Deklarationen und Vorkommen hervor.",
        "Description[es]": "Este complemento muestra información de contexto sobre el lenguaje actual en una vista lateral, resaltando declaraciones relevantes y sus usos.",
        "Description[et]": "See plugin pakub külgvaates teavet aktiivse keele konteksti kohta ning tõstab esile asjakohased deklaratsioonid ja kasutused.",
        "Description[fr]": "Ce module affiche des informations à propos du contexte du langage courant dans une vue latérale, et met en évidence les déclarations et utilisations reliées.",
        "Description[gl]": "Este complemento mostra información sobre o contexto da linguaxe actual nunha vista lateral, e realza as declaracións e utilizacións relevantes.",
        "Description[it]": "Questa estensione mostra le informazioni sul contesto del linguaggio corrente in una vista laterale, mettendo in evidenza le dichiarazioni e gli usi.",
        "Description[nl]": "Deze plugin toont informatie over de huidige taalcontext in een zijvak en accentueert relevante declaraties en gebruik.",
        "Description[pl]": "Ta wtyczka pokazuje informacje dotyczące kontekstu bieżącego języka w widoku bocznym, podświetla deklaracja i ich użycia.",
        "Description[pt]": "Este 'plugin' mostra informações sobre o contexto da linguagem actual numa vista lateral, assim como realça as declarações e utilizações relevantes.",
        "Description[pt_BR]": "Este plugin mostra informações sobre a linguagem utilizada no momento, numa visão lateral, e destaca declarações relevantes e seus usos.",
        "Description[sk]": "Tento plugin zobrazuje informácie o aktuálnom jazykovom kontexte v božnom pohľade, a zvýrazní relevantné deklarácie a použitia.",
        "Description[sl]": "Vstavek prikazuje podatke o trenutnem kontekstu jezika in poudari pomembne deklaracije in uporabe.",
        "Description[sv]": "Insticksprogrammet visar information om nuvarande språksammanhang i en sidovy, och markerar relevanta deklarationer och användningar.",
        "Description[tr]": "Bu eklenti yan görünümde mevcut dil bağlamıyla ilgili bilgi gösterir, ve ilgili tanımlamaları ve kullanımları vurgular.",
        "Description[uk]": "За допомогою цього додатка можна переглянути у перегляді на бічній панелі відомості про поточний контекст мови, а також підсвітити пов’язані оголошення і випадки використання.",
        "Description[x-test]": "xxThis plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.xx",
        "Description[zh_CN]": "此插件在侧边视图中显示关于当前语言上下文的信息，并加亮突出相关的声明和调用。",
        "Icon": "code-context",
        "Id": "kdevcontextbrowser",
        "License": "GPL",
        "Name": "Code Browser",
        "Name[ca@valencia]": "Navegador de codi",
        "Name[ca]": "Navegador de codi",
        "Name[cs]": "Prohlížeč kódu",
        "Name[de]": "Quelltext-Browser",
        "Name[es]": "Navegador de código",
        "Name[et]": "Koodibrauser",
        "Name[fr]": "Navigateur de code",
        "Name[gl]": "Navegador do código",
        "Name[it]": "Navigatore del codice",
        "Name[nb]": "Kodeleser",
        "Name[nl]": "Broncode-browser",
        "Name[pl]": "Przeglądarka kodu",
        "Name[pt]": "Navegador do Código",
        "Name[pt_BR]": "Navegador de código",
        "Name[ru]": "Навигация по коду",
        "Name[sk]": "Prehliadač kódu",
        "Name[sl]": "Brskalnik po kodi",
        "Name[sv]": "Kodbläddrare",
        "Name[tr]": "Kod Tarayıcı",
        "Name[uk]": "Переглядач коду",
        "Name[x-test]": "xxCode Browserxx",
        "Name[zh_CN]": "代码浏览器",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-IRequired": [
        "org.kdevelop.IQuickOpen"
    ],
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IContextBrowser"
    ],
    "X-KDevelop-Mode": "GUI"
}
