{
    "KPlugin": {
        "Authors": [
            {
                "Name": "David Nolden",
                "Name[ar]": "ديفيد نولدن",
                "Name[az]": "David Nolden",
                "Name[ca@valencia]": "David Nolden",
                "Name[ca]": "David Nolden",
                "Name[cs]": "David Nolden",
                "Name[de]": "David Nolden",
                "Name[el]": "David Nolden",
                "Name[en_GB]": "David Nolden",
                "Name[eo]": "David Nolden",
                "Name[es]": "David Nolden",
                "Name[et]": "David Nolden",
                "Name[eu]": "David Nolden",
                "Name[fi]": "David Nolden",
                "Name[fr]": "David Nolden",
                "Name[gl]": "David Nolden",
                "Name[it]": "David Nolden",
                "Name[ka]": "დევიდ ნოლდენი",
                "Name[ko]": "David Nolden",
                "Name[nl]": "David Nolden",
                "Name[nn]": "David Nolden",
                "Name[pl]": "David Nolden",
                "Name[pt]": "David Nolden",
                "Name[pt_BR]": "David Nolden",
                "Name[ru]": "David Nolden",
                "Name[sa]": "डेविड् नोल्डेन्",
                "Name[sk]": "David Nolden",
                "Name[sl]": "David Nolden",
                "Name[sv]": "David Nolden",
                "Name[tr]": "David Nolden",
                "Name[uk]": "David Nolden",
                "Name[zh_CN]": "David Nolden",
                "Name[zh_TW]": "David Nolden"
            }
        ],
        "Category": "Core",
        "Description": "This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.",
        "Description[ar]": "تعرض هذه الملحقة معلومات عن سياق اللغة الحالي في عرض جانبي، وتسلّط الضوء على الإعلانات والاستخدامات ذات الصلة.",
        "Description[az]": "Bu qoşma panelin yan tərəfindəki cari dil məzmunu haqqında məlumatları göstərir və müvafiq bildiri.ləri və istifadə üsullarını vurğulayır.",
        "Description[ca@valencia]": "Este connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[ca]": "Aquest connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[cs]": "Tento zásuvný modul ukazuje v bočním pohledu informace o současném jazykovém kontextu a zvýrazňuje důležité deklarace a použití.",
        "Description[de]": "Dieses Modul zeigt Informationen über den aktuellen Sprachkontext an und hebt die relevanten Deklarationen und Vorkommen hervor.",
        "Description[el]": "Αυτό το πρόσθετο εμφανίζει πληροφορίες σχετικά με την τρέχουσα γλώσσα σε μια πλευρική προβολή, και τονίζει τις σχετικές δηλώσεις και χρήσεις.",
        "Description[en_GB]": "This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.",
        "Description[eo]": "Ĉi tiu kromaĵo montras informojn pri la nuna lingvokunteksto en flanka vido, kaj elstarigas koncernajn deklarojn kaj uzojn.",
        "Description[es]": "Este complemento muestra información de contexto sobre el lenguaje actual en una vista lateral, resaltando declaraciones relevantes y sus usos.",
        "Description[et]": "See plugin pakub külgvaates teavet aktiivse keele konteksti kohta ning tõstab esile asjakohased deklaratsioonid ja kasutused.",
        "Description[eu]": "Plugin honek aldeko ikuspegi batean uneko lengoaiaren testuinguruaren informazioa erakusten du, eta deklarazio eta erabilera garrantzitsuak nabarmentzen ditu.",
        "Description[fi]": "Tämä liitännäinen näyttää sivunäkymässä tietoa nykyisestä kielikontekstista ja korostaa asiaan liittyvät esittelyt ja käytöt.",
        "Description[fr]": "Ce module affiche des informations à propos du contexte du langage courant dans une vue latérale, et met en évidence les déclarations et utilisations reliées.",
        "Description[gl]": "Este complemento amosa información sobre o contexto da linguaxe actual nunha vista lateral, e realza as declaracións e utilizacións relevantes.",
        "Description[it]": "Questa estensione mostra le informazioni sul contesto del linguaggio corrente in una vista laterale, mettendo in evidenza le dichiarazioni e gli usi.",
        "Description[ka]": "ეს დამატება აჩვენებს ინფორმაციას მიმდინარე ენის კონტექსტის შესახებ გვერდით ხედში და გამოკვეთს შესაბამის აღწერებსა და გამოყენებებს.",
        "Description[ko]": "이 플러그인은 현재 언어 문맥을 사이드바에 표시하며 선언과 사용을 강조합니다.",
        "Description[nl]": "Deze plugin toont informatie over de huidige taalcontext in een zijvak en accentueert relevante declaraties en gebruik.",
        "Description[pl]": "Pokazuje dane dotyczące kontekstu bieżącego języka w widoku bocznym, podświetla deklaracje i ich użycia.",
        "Description[pt]": "Este 'plugin' mostra informações sobre o contexto da linguagem actual numa vista lateral, assim como realça as declarações e utilizações relevantes.",
        "Description[pt_BR]": "Este plugin mostra informações sobre a linguagem utilizada no momento, numa visão lateral, e destaca declarações relevantes e seus usos.",
        "Description[ru]": "Это расширение показывает информацию о контексте текущего языка в боковой панели и высвечивает связанные объявления и вхождения",
        "Description[sa]": "इदं प्लगिन् वर्तमानभाषासन्दर्भस्य विषये सूचनां पार्श्वदृश्ये दर्शयति, प्रासंगिकघोषणानि उपयोगानि च प्रकाशयति ।",
        "Description[sk]": "Tento plugin zobrazuje informácie o aktuálnom jazykovom kontexte v božnom pohľade, a zvýrazní relevantné deklarácie a použitia.",
        "Description[sl]": "Vstavek prikazuje podatke o trenutnem kontekstu jezika in poudari pomembne deklaracije in uporabe.",
        "Description[sv]": "Insticksprogrammet visar information om nuvarande språksammanhang i en sidovy, och markerar relevanta deklarationer och användningar.",
        "Description[tr]": "Bu eklenti yan görünümde geçerli dil bağlamıyla ilgili bilgi gösterir ve ilgili tanımlamaları ve kullanımları vurgular.",
        "Description[uk]": "За допомогою цього додатка можна переглянути у перегляді на бічній панелі відомості про поточний контекст мови, а також підсвітити пов’язані оголошення і випадки використання.",
        "Description[zh_CN]": "此插件在侧边视图中显示关于当前语言上下文的信息，并高亮显示相关的声明和调用。",
        "Description[zh_TW]": "此外掛程式顯示關於目前語言的資訊，並將相關的宣告與使用突顯出來。",
        "Icon": "code-context",
        "License": "GPL",
        "Name": "Code Browser",
        "Name[ar]": "متصّفح الشِّفرة",
        "Name[az]": "Kod üzrə hərəkət",
        "Name[bg]": "Браузър за низове",
        "Name[bs]": "Pregledač koda",
        "Name[ca@valencia]": "Navegador de codi",
        "Name[ca]": "Navegador de codi",
        "Name[cs]": "Prohlížeč kódu",
        "Name[da]": "Kodebrowser",
        "Name[de]": "Quelltext-Browser",
        "Name[el]": "Περιηγητής κώδικα",
        "Name[en_GB]": "Code Browser",
        "Name[eo]": "Koda Foliumilo",
        "Name[es]": "Navegador de código",
        "Name[et]": "Koodibrauser",
        "Name[eu]": "Kode arakatzailea",
        "Name[fi]": "Koodiselain",
        "Name[fr]": "Navigateur de code",
        "Name[gl]": "Navegador do código",
        "Name[he]": "דפדפן קוד",
        "Name[hu]": "Kódböngésző",
        "Name[it]": "Navigatore del codice",
        "Name[ka]": "კოდის ბრაუზერი",
        "Name[kk]": "Код шолғышы",
        "Name[ko]": "코드 탐색기",
        "Name[nb]": "Kodeleser",
        "Name[nds]": "Kodekieker",
        "Name[nl]": "Broncode-browser",
        "Name[pa]": "ਕੋਡ ਬਰਾਊਜ਼ਰ",
        "Name[pl]": "Przeglądarka kodu",
        "Name[pt]": "Navegador do Código",
        "Name[pt_BR]": "Navegador de código",
        "Name[ru]": "Навигация по коду",
        "Name[sa]": "कोड ब्राउज़र",
        "Name[sk]": "Prehliadač kódu",
        "Name[sl]": "Brskalnik po kodi",
        "Name[sv]": "Kodbläddrare",
        "Name[tr]": "Kod Tarayıcısı",
        "Name[ug]": "كود كۆرگۈ",
        "Name[uk]": "Переглядач коду",
        "Name[zh_CN]": "代码浏览器",
        "Name[zh_TW]": "源碼瀏覽器"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-IRequired": [
        "org.kdevelop.IQuickOpen"
    ],
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IContextBrowser"
    ],
    "X-KDevelop-Mode": "GUI"
}
