{
    "KPlugin": {
        "Authors": [
            {
                "Name": "David Nolden"
            }
        ],
        "Category": "Core",
        "Description": "This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.",
        "Description[bg]": "Този приставка показва информация за текущата езикова настройка погледната отвън и маркира съответните декларации и употреби.",
        "Description[bs]": "Ovaj dodatak pokazuje informacije o trenutnom jezičkom kontekstu sa strane,  i ističe relevantne deklaracije i upotrebe.",
        "Description[ca@valencia]": "Este connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[ca]": "Aquest connector mostra informació quant al context del llenguatge actual en una vista lateral i ressalta les declaracions i els usos apropiats.",
        "Description[da]": "Dette plugin viser information om den sprogkontekst i et sidepanel og fremhæver relevante erklæringer og brug.",
        "Description[de]": "Dieses Modul zeigt Informationen über den aktuellen Sprachkontext an und hebt die wichtigen Deklarationen und Vorkommen hervor.",
        "Description[el]": "Αυτό το πρόσθετο εμφανίζει πληροφορίες σχετικά με την τρέχουσα γλώσσα σε μια πλευρική προβολή, και τονίζει τις σχετικές δηλώσεις και χρήσεις.",
        "Description[en_GB]": "This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.",
        "Description[es]": "Este complemento muestra información sobre el contexto del lenguaje actual en una vista lateral, resaltando declaraciones y usos pertinentes.",
        "Description[et]": "See plugin pakub külgvaates teavet aktiivse keele konteksti kohta ning tõstab esile asjakohased deklaratsioonid ja kasutused.",
        "Description[fi]": "Tämä liitännäinen näyttää tietoja nykyisestä kielikontekstista sivunäkymässä ja korostaa olennaisia esittelyjä ja käyttöjä.",
        "Description[fr]": "Ce module externe affiche des informations sur le contexte du langage actuel dans une vue latérale, et met en surbrillance les déclarations et utilisations pertinentes.",
        "Description[gl]": "Este complemento mostra información acerca do contexto da linguaxe actual nunha vista lateral, e realza as declaracións e utilizacións relevantes.",
        "Description[hu]": "Ez a bővítmény a jelenlegi nyelvi környezetről jelenít meg információkat egy oldalnézetben és kiemeli a lényeges deklarációkat és használatokat.",
        "Description[it]": "Questa estensione mostra le informazioni sul contesto del linguaggio corrente in una vista laterale, mettendo in evidenza le dichiarazioni e gli usi.",
        "Description[kk]": "Бұл плагині, бүйірдегі көріністе, қолданыстағы тілінің контексті туралы мәліметті келтіреді және тиісті мәлімдемелер мен қолдануларын бояп белгілейді.",
        "Description[nb]": "Dette programtillegget viser informasjon om gjeldende språkkontekst i et sidevindu, og fremhever relevante deklarasjoner og bruk.",
        "Description[nds]": "Dit Moduul wiest binnen en Sietpaneel Informatschonen över den aktuellen Spraakkontext un heevt wichtig Deklaratschonen un Bruken rut.",
        "Description[nl]": "Deze plugin toont informatie over de huidige taalcontext in een zijvak en accentueert relevante declaraties en gebruik.",
        "Description[pl]": "Ta wtyczka pokazuje informacje dotyczące kontekstu bieżącego języka w widoku bocznym, podświetla deklaracja i ich użycia.",
        "Description[pt]": "Este 'plugin' mostra informações sobre o contexto actual da linguagem numa visão lateral, realçando as declarações e utilizações relevantes.",
        "Description[pt_BR]": "Este plugin mostra informações sobre a linguagem utilizada no momento, numa visão lateral, e destaca declarações relevantes e seus usos.",
        "Description[ru]": "Это расширение показывает информацию о контексте текущего языка в боковой панели и высвечивает связанные объявления и вхождения.",
        "Description[sk]": "Tento plugin zobrazuje informácie o aktuálnom jazykovom kontexte v božnom pohľade, a zvýrazní relevantné deklarácie a použitia.",
        "Description[sl]": "Vstavek prikazuje podatke o trenutnem kontekstu jezika in poudari pomembne deklaracije in uporabe.",
        "Description[sv]": "Insticksprogrammet visar information om nuvarande språksammanhang i en sidovy, och markerar relevanta deklarationer och användningar.",
        "Description[tr]": "Bu eklenti, yan görünüm içerisinde geçerli dil bağlamında bilgiler gösterir ve uygun bildirimleri ve kullanımları vurgular.",
        "Description[uk]": "За допомогою цього додатка можна переглянути у перегляді на бічній панелі відомості про поточний контекст мови, а також підсвітити пов’язані оголошення і випадки використання.",
        "Description[x-test]": "xxThis plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.xx",
        "Description[zh_CN]": "此插件在侧边视图中显示关于当前语言上下文的信息，并加亮突出相关的声明和调用。",
        "Description[zh_TW]": "此外掛程式顯示關於目前語言的資訊，並將相關的宣告與使用突顯出來。",
        "Icon": "code-context",
        "Id": "kdevcontextbrowser",
        "License": "GPL",
        "Name": "Code Browser",
        "Name[bg]": "Браузър за низове",
        "Name[bs]": "Pregledač koda",
        "Name[ca@valencia]": "Navegador de codi",
        "Name[ca]": "Navegador de codi",
        "Name[cs]": "Prohlížeč kódu",
        "Name[da]": "Kodebrowser",
        "Name[de]": "Quelltext-Browser",
        "Name[el]": "Περιηγητής κώδικα",
        "Name[en_GB]": "Code Browser",
        "Name[es]": "Navegador de código",
        "Name[et]": "Koodibrauser",
        "Name[fi]": "Lähdekoodiselain",
        "Name[fr]": "Navigateur de code",
        "Name[gl]": "Navegador do código",
        "Name[hu]": "Kódböngésző",
        "Name[it]": "Browser del codice",
        "Name[ja]": "コードブラウザ",
        "Name[kk]": "Код шолғышы",
        "Name[nb]": "Kodeleser",
        "Name[nds]": "Kodekieker",
        "Name[nl]": "Broncode-browser",
        "Name[pa]": "ਕੋਡ ਬਰਾਊਜ਼ਰ",
        "Name[pl]": "Przeglądarka kodu",
        "Name[pt]": "Navegador do Código",
        "Name[pt_BR]": "Navegador de código",
        "Name[ru]": "Навигация по коду",
        "Name[sk]": "Prehliadač kódu",
        "Name[sl]": "Brskalnik po kodi",
        "Name[sv]": "Kodbläddrare",
        "Name[tr]": "Kod Tarayıcı",
        "Name[ug]": "كود كۆرگۈ",
        "Name[uk]": "Переглядач коду",
        "Name[x-test]": "xxCode Browserxx",
        "Name[zh_CN]": "代码浏览器",
        "Name[zh_TW]": "源碼瀏覽器",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-IRequired": ["org.kdevelop.IQuickOpen"],
    "X-KDevelop-Interfaces": ["org.kdevelop.IContextBrowser"],
    "X-KDevelop-Mode": "GUI"
}
