Repository: KDE/kdevelop
Catalog: po/*/kdevastyle.po
Languages: ar

source: <b>Artistic Style</b> is a source code indenter, formatter, and beautifier for the C, C++, C# and Java programming languages.<p style='margin-top:0;white-space:pre'>Home Page: <a href="http://astyle.sourceforge.net/">http://astyle.sourceforge.net</a></p>
ar: <b>النمط الفني (Artistic Style)</b> هي أداة مسافة بادئة، ومُنسّقة، ومُجمّلة للشيفرة المصدرية للغات البرمجة C و C++ و C# و Java.<p style='margin-top:0;white-space:pre'>الصفحة الرئيسية: <a href="http://astyle.sourceforge.net/">http://astyle.sourceforge.net</a></p>

# @title:tab
source: Indentation
ar: المسافة البادئة

# @item:inlistbox Indentation type
source: Tabs
ar: محارف جدولة

# @item:inlistbox Indentation type
source: Force tabs
ar: فرض محارف الجدولة

# @item:inlistbox Indentation type
source: Spaces
ar: مسافات

# @info:tooltip
source: Number of spaces that will be converted to a tab. The number of spaces per tab is controlled by the editor.
ar: عدد المسافات التي تتحول إلى لسان. يتحكَّم المحرر في عدد المسافات لكل لسان.

# @info:tooltip
source: Convert tabs to spaces.
ar: حوّل محارف الجدولة إلى مسافات.

# @option:check
source: Con&vert tabs into spaces
ar: حوّل محارف الجدولة إلى مسافات

# @info:tooltip
source: Fill empty lines with the white space of their previous lines.
ar: املأ الأسطر الفارغة بالمسافة البيضاء من أسطرها السابقة.

# @option:check
source: Fill empt&y lines
ar: املأ الأسط&ر الفارغة

# @label:listbox
source: Indent:
ar: المسافة البادئة:

# @item:inlistbox
source: Blocks
ar: كتل

# @item:inlistbox
source: Brackets
ar: قوسان معقوفان

# @item:inlistbox
source: Cases
ar: حالات

# @item:inlistbox
source: Class
ar: صنف

# @item:inlistbox
source: Labels
ar: لصائق

# @item:inlistbox
source: Namespaces
ar: مجالات اسمية

# @item:inlistbox
source: Preprocessor directives
ar: موجّهات المُعالِج المُسبق

# @item:inlistbox
source: Switches
ar: مفاتيح تبديل

# @info:tooltip
source: Indent a maximal # spaces in a continuous statement, relative to the previous line.
ar: ضع مسافة بادئة قصوى # مسافات في عبارة متواصلة، بالنسبة إلى السطر السابق.

# @info:tooltip
source: Indent a minimal # spaces in a continuous conditional belonging to a conditional header.
ar: ضع مسافة بادئة صغرى # مسافات في شرط متواصل ينتمي إلى ترويسة شرطية.

# @label:spinbox
source: Minimum in conditional:
ar: الأدنى في الشرط:

# @item
source: Twice current
ar: ضعف الحالي

# @label:spinbox
source: Maximum in statement:
ar: الأقصى في العبارة:

# @info:tooltip
source: Number of indents
ar: عدد المسافات البادئة

# @info:tooltip
source: Indent, instead of align, continuation lines following lines that contain an opening paren '(' or an assignment '='.
ar: ضع مسافة بادئة، بدلاً من محاذاة، لأسطر المتابعة التي تلي أسطرًا تحتوي على قوس فتح '(' أو إسناد '='.

# @option:check
source: Continuation lines:
ar: أسطر المتابعة:

# @title:tab
source: Other
ar: أخرى

# @title:group
source: Brackets
ar: قوسان معقوفان

# @label:listbox
source: Type:
ar: النوع:

# @info:tooltip
source: Break brackets before closing headers (e.g. 'else', 'catch', ...) from their immediately preceding closing brackets.
ar: اكسر القوسين المعقوفين قبل إغلاق الترويسات (مثل 'else'، 'catch'، ...) من قوسيهما المعقوفين المُغلِقين السابقين لهما مباشرة.

# @option:check
source: Brea&k closing headers
ar: اكسر ترويسات الإغلاق

# @item:inlistbox brackets style
source: No change
ar: لا تغير

# @item:inlistbox brackets style
source: Attach
ar: أرفِق

# @item:inlistbox brackets style
source: Break
ar: اكسر

# @item:inlistbox brackets style
source: Linux
ar: لينُكس

# @item:inlistbox brackets style
source: Run-In
ar: الركض

# @info:tooltip
source: Add braces to unbraced one-line conditional statements (e.g. 'if', 'for', 'while')
ar: أضف الأقواس إلى العبارات الشرطية غير المُقوَّسة ذات السطر الواحد (مثل 'if'، 'for'، 'while')

# @option:check add braces to unbraced one-line conditional statements
source: Add b&races
ar: أضف أق&واس

# @title:group
source: Blocks
ar: كتل

# @info:tooltip
source: Insert empty lines around unrelated blocks, labels, classes,... Known problems: 1. If a statement is NOT part of a block, the following statements are all double spaced. Statements enclosed in a block are formatted correctly. 2. Comments are broken from the block.
ar: أدرج أسطرًا فارغة حول الكتل غير المرتبطة، واللصائق، والأصناف، ... المشكلات المعروفة: 1. إن كانت عبارة ما ليست جزءًا من كتلة، تصبح جميع العبارات التالية مُباعدة مزدوجة. تُنسَّق العبارات المُضمَّنة في كتلة صحيحًا. 2. تنفصل التعليقات عن الكتلة.

# @option:check break unrelated blocks by a newline
source: &Break blocks
ar: اكسر الك&تل

# @info:tooltip
source: Like --break-blocks, except also insert empty lines around closing headers (e.g. 'else', 'catch', ...). Known problems: 1. If a statement is NOT part of a block, the following statements are all double spaced. Statements enclosed in a block are formatted correctly. 2. Comments are broken from the block.
ar: مثل --break-blocks، باستثناء أنه يُدرج أسطرًا فارغة كذلك حول ترويسات الإغلاق (مثل 'else'، 'catch'، ...). المشكلات المعروفة: 1. إن كانت عبارة ما ليست جزءًا من كتلة، تصبح جميع العبارات التالية مُباعدة مزدوجة. تُنسَّق العبارات المُضمَّنة في كتلة صحيحًا. 2. تنفصل التعليقات عن الكتلة.

# @option:check break all blocks with a newline
source: Break all bl&ocks
ar: اكسر كل الكتل

# @info:tooltip
source: Break 'else if()' statements into two different lines.
ar: اكسر عبارات 'else if()' إلى سطرين مختلفين.

# @option:check break else if() into separate lines
source: Break i&f-else
ar: اكسر if-else

# @title:group
source: Padding
ar: الحشوة

# @item:inlistbox parenthesis padding
source: No change
ar: لا تغير

# @item:inlistbox parenthesis padding
source: Unpad
ar: إلغاء الحشو

# @item:inlistbox parenthesis padding
source: Inside only
ar: الداخل فقط

# @item:inlistbox parenthesis padding
source: Outside only
ar: الخارج فقط

# @item:inlistbox parenthesis padding
source: Inside and outside
ar: الداخل والخارج

# @info:tooltip
source: Insert space padding around operators. Once padded, operators stay padded. There is no unpad operator option.
ar: أدرج مسافة حشو حول العوامل. تبقى العوامل محشوة بعد حشوها. لا يوجد خيار لإلغاء حشو العوامل.

# @option:check
source: &Add spaces around operators
ar: أضف &مسافات حول العوامل

# @label:listbox
source: Pad parenthesis:
ar: حشو القوسين:

# @info:tooltip
source: Insert space padding after parenthesis headers (e.g. 'if', 'for', 'while', ...)
ar: أدرج مسافة حشو بعد ترويسات الأقواس (مثل 'if'، 'for'، 'while'، ...)

# @option:check
source: Add spaces after parenthesis &headers
ar: أضف مسافات بعد ترويسات الأقواس

# @title:group
source: One Liners
ar: أسطر مفردة

# @info:tooltip
source: Do not break lines containing multiple statements into multiple single-statement lines.
ar: لا تكسر الأسطر التي تحتوي على عبارات متعددة إلى أسطر مفردة متعددة.

# @option:check
source: &Keep one-line statements
ar: ا&حفظ العبارات أحادية السطر

# @info:tooltip
source: Do not break blocks residing completely on one line.
ar: لا تكسر الكتل المقيمة بالكامل في سطر واحد.

# @option:check
source: Keep o&ne-line blocks
ar: احفظ الكتل أحادية السط&ر

# @title:group
source: Other
ar: أخرى

# @label:listbox
source: Pointer Alignment:
ar: محاذاة المؤشر:

# @item:inlistbox pointer alignment
source: No change
ar: لا تغير

# @item:inlistbox pointer alignment
source: Name
ar: اسم

# @item:inlistbox pointer alignment
source: Middle
ar: منتصف

# @item:inlistbox pointer alignment
source: Type
ar: نوع
