Repository: KDE/kdevelop
Catalog: po/*/kdevplatform.po
Languages: ar

# @info:whatsthis
source: Steps into the next assembly instruction.
ar: يدخل إلى تعليمة التجميع التالية.

# @action
source: Step O&ut
ar: ا&خرج

# @info:tooltip
source: Step out of the current function
ar: اخرج من الدالة الحالية

# @action
source: Toggle Breakpoint
ar: بدّل نقطة التوقف

# @info:tooltip
source: Toggle breakpoint
ar: بدّل نقطة التوقف

# @info:whatsthis
source: Toggles the breakpoint at the current line in editor.
ar: يبدّل نقطة التوقف في السطر الحالي في المحرر.

# @action
source: Show Current Line
ar: أظهر السطر الحالي

# @info:tooltip
source: Show the current execution position
ar: أظهر موضع التنفيذ الحالي

# @info:whatsthis
source: Jumps to the execution line in the editor.
ar: يقفز إلى سطر التنفيذ في المحرر.

# @action:button
source: Abort Current Session
ar: عن الجلسة الحاليّة

# @action
source: Debug Launch
ar: بدء تصحيح الأخطاء

# @info:tooltip
source: Debug current launch
ar: صحّح أخطاء عملية البدء الحالية

# @info:whatsthis
source: Executes the target or the program specified in currently active launch configuration inside a Debugger.
ar: ينفّذ الهدف أو البرنامج المحدد في تشكيلة البدء النشطة حاليًا داخل مصحح أخطاء.

# @action
source: &Continue
ar: &تابع

# @info:tooltip
source: Continue application execution
ar: تابع تنفيذ التطبيق

# @info:whatsthis
source: Continues the execution of your application in the debugger. This only takes effect when the application has been halted by the debugger (i.e. a breakpoint has been activated or the interrupt was pressed).
ar: يتابع تنفيذ تطبيقك في مصحح الأخطاء. هذا لا يسري إلا عندما يكون التطبيق قد أوقفه مصحح الأخطاء (أي نُشِّطت نقطة توقف أو ضُغِط على المقاطعة).

source: Debugger Toolbar
ar: شريط أدوات مصحح الأخطاء

# @action
source: Show Documentation
ar: أظهر التوثيق

# @title:window
source: Documentation
ar: التّوثيق

source: Untitled
ar: غير معنون

# @title:window
source: Open File
ar: افتح الملف

source: *|Text File
ar: *|ملف نصي

source: KDevelop could not find the editor for file '%1' of type %2. Do you want to open it as plain text?
ar: لم يمكن لـ KDevelop مطورك العثور على محرر للملف ”%1“ من النوع %2. هل تريد فتحه كنص بسيط؟

# @title:window
source: Could Not Find Editor
ar: لم يمكن العثور على محرر

# @action:button
source: Open as Plain Text
ar: افتح كنص بسيط

# @action:button
source: Do Not Open
ar: لا تفتح

# @action
source: &Open...
ar: ا&فتح...

# @info:tooltip
source: Open file
ar: افتح ملفًا

# @info:whatsthis
source: Opens a file for editing.
ar: يفتح ملفًا للتحرير.

# @info:whatsthis
source: This lists files which you have opened recently, and allows you to easily open them again.
ar: يسرد هذا الملفّات التي فتحتها حديثًا، ويسمح لك بفتحها مجدّدًا بسهولة.

# @action
source: Save Al&l
ar: احفظ ال&كلّ

# @info:tooltip
source: Save all open documents
ar: احفظ كل المستندات المفتوحة

# @info:whatsthis
source: Save all open documents, prompting for additional information when necessary.
ar: احفظ كل المستندات المفتوحة، مطالِبًا بمعلومات إضافية عند الضرورة.

# @action
source: Reload All
ar: أعد تحميل الكلّ

# @info:tooltip
source: Revert all open documents
ar: ارجع عن كل المستندات المفتوحة

# @info:whatsthis
source: Revert all open documents, returning to the previously saved state.
ar: ارجع عن كل المستندات المفتوحة، عائدًا إلى الحالة المحفوظة سابقًا.

# @action
source: &Close
ar: أ&غلق

# @info:tooltip
source: Close file
ar: أ&غلق الملف

# @info:whatsthis
source: Closes current file.
ar: يغلق الملف الحالي.

# @action
source: Clos&e All
ar: أ&غلق الكلّ

# @info:tooltip
source: Close all open documents
ar: أغلق كلّ المستندات المفتوحة.

# @info:whatsthis
source: Close all open documents, prompting for additional information when necessary.
ar: أغلق كل المستندات المفتوحة، مطالِبًا بمعلومات إضافية عند الضرورة.

# @action
source: Close All Ot&hers
ar: أغلق الب&قيّة

# @info:tooltip
source: Close all other documents
ar: أغلق كل المستندات الأخرى

# @info:whatsthis
source: Close all open documents, with the exception of the currently active document.
ar: أغلق كل المستندات المفتوحة، باستثناء المستند النشط حاليًا.

# @action
source: Show Annotate on Current Document
ar: أظهر الشرح على المستند الحالي

# @action
source: Annotate
ar: اشرح

source: Could not annotate the document because it is not part of a version-controlled project.
ar: لم يمكن شرح المستند لأنه ليس جزءًا من مشروع متحكم بإصداره.

# @title:tab
source: Editor
ar: المحرّر

source: Configure Text Editor
ar: اضبط محرر النصوص

# @info:tooltip
source: Configure environment variables
ar: اضبط متغيرات البيئة

source: The following languages are supported much better by dedicated KDevelop plugins, and so are disabled in the %1 plugin to prevent conflicts: <var>%2</var>. In order to compare the levels of support or work around severe bugs, disable the dedicated KDevelop plugin(s) and set the environment variable <var>%3</var> (<span style='color:%4'>%5</span>).
ar: تُدعَم اللغات التالية بشكل أفضل بكثير من قبل ملحقات KDevelop مطورك المخصصة، ولذلك عُطِّلت في الملحق %1 لمنع التضاربات: <var>%2</var>. لمقارنة مستويات الدعم أو تجاوز الأخطاء الجسيمة، عطّل ملحق (ملحقات) KDevelop مطورك المخصص واضبط متغير البيئة <var>%3</var> (<span style='color:%4'>%5</span>).

# a certain environment variable is ...
source: currently set
ar: مضبوط حاليًا

# a certain environment variable is ...
source: currently unset
ar: غير مضبوط حاليًا

# @title:window
source: Messages
ar: الرسائل

# @title:window
source: Launch Configurations
ar: ضبطات الإطلاق

# @info:tooltip
source: Add a new launch configuration.
ar: أَضف ضبط إطلاق جديدًا.

# @info:tooltip
source: Delete selected launch configuration.
ar: اِحذف ضبط الإطلاق المُختار.

source: No launch configurations available. (Is any of the Execute plugins loaded?)
ar: لا تتوفر ضبطات إطلاق. (هل حُمِّلَ أي من ملاحق التنفيذ؟)

# @action:inmenu
source: Rename Configuration
ar: أَعِد تسمية الضبط

# @action:inmenu
source: Delete Configuration
ar: اِحذف الضبط

source: Selected Launch Configuration has unsaved changes. Do you want to save it?
ar: يحتوي ضبط الإطلاق المُختار تغييرات غير محفوظة. هل تريد حفظها؟

# @title:window
source: Unsaved Changes
ar: تغييرات غير محفوظة

# %1 is a launcher name
source: No configuration is needed for '%1'
ar: لا يلزم ضبط لـ '%1'

source: <i>Select a configuration to edit from the left,<br>or click the "Add" button to add a new one.</i>
ar: <i>اِختر ضبطًا للتحرير من اليسار،<br>أو اِنقر زر "أَضف" لإضافة ضبط جديد.</i>

source: Editing %2: <b>%1</b>
ar: التّحرير %2: <b>%1</b>

# @title:column Name of the Launch Configurations
source: Name
ar: الاسم

source: Type
ar: النّوع

# @action:button
source: Add
ar: أضف

# @action:button
source: Remove
ar: أزل

# @label:listbox
source: Debugger:
ar: المنقّح:

# @title:window
source: Loaded Plugins
ar: الملاحق المحملة

source: <html><font size="4">Plugins loaded for <b>%1</b></font></html>
ar: <html><font size="4">الملاحق المحملة لـ <b>%1</b></font></html>

source: (read only)
ar: (للقراءة فقط)

# @info:tooltip %1 = application name
source: Configure %1
ar: اضبط %1

# @info:whatsthis
source: Lets you customize %1.
ar: يَسمح لك بتخصيص %1.

# @action
source: Configure Notifications...
ar: اضبط الإشعارات...

# @info:tooltip
source: Configure notifications
ar: اضبط الإشعارات

# @info:whatsthis
source: Shows a dialog that lets you configure notifications.
ar: يَعرِض حوارًا يَسمح لك بـ اضبط الإشعارات.

# @action
source: Loaded Plugins
ar: الملاحق المحملة

# @info:tooltip
source: Show a list of all loaded plugins
ar: اِعرِض قائمة بكل الملاحق المحملة

# @info:whatsthis
source: Shows a dialog with information about all loaded plugins.
ar: يَعرِض حوارًا يحتوي معلومات عن كل الملاحق المحملة.

# @action
source: &Next Window
ar: النافذة ال&تالية

# @info:tooltip
source: Next window
ar: النافذة التالية

# @info:whatsthis
source: Switches to the next window.
ar: يُبدّل إلى النافذة التالية.

# @action
source: &Previous Window
ar: &النافذة السابقة

# @info:tooltip
source: Previous window
ar: النافذة السابقة

# @info:whatsthis
source: Switches to the previous window.
ar: يُبدّل إلى النافذة السابقة.

# @action
source: Jump to Next Outputmark
ar: اِقفِز إلى علامة الإخراج التالية

# @action
source: Jump to Previous Outputmark
ar: اِقفِز إلى علامة الإخراج السابقة

# @action
source: Split View &Top/Bottom
ar: افصل العرض أ&على/أسفل

# @info:tooltip
source: Split horizontal
ar: اقسم أفقياً

# @info:whatsthis
source: Splits the current view horizontally.
ar: يَقسِم العرض الحالي أفقيًا.

# @action
source: Split View &Left/Right
ar: افصل العرض إلى &يمين/يسار

# @info:tooltip
source: Split vertical
ar: اقسم رأسيًّا

# @info:whatsthis
source: Splits the current view vertically.
ar: يَقسِم العرض الحالي عموديًا.

# @action
source: &Next Split View
ar: ال&منظور المقسوم التّالي

# @info:tooltip
source: Next split view
ar: المنظور المقسوم التّالي

# @info:whatsthis
source: Switches to the next split view.
ar: يُبدّل إلى العرض المُقسَّم التالي.

# @action
source: &Previous Split View
ar: المنظور المقسوم ال&سّابق

# @info:tooltip
source: Previous split view
ar: المنظور المقسوم السّابق

# @info:whatsthis
source: Switches to the previous split view.
ar: يُبدّل إلى العرض المُقسَّم السابق.

# @action new file
source: &New
ar: &جديد

# @action Shorter Text for 'New File' shown in the toolbar
source: New
ar: جديد

# @info:tooltip
source: New file
ar: ملفّ جديد

# @info:whatsthis
source: Creates an empty file.
ar: يُنشئ ملفًا فارغًا.

# @action
source: &Add Tool View...
ar: أَضف عرض أداة...

# @info:tooltip
source: Add tool view
ar: أَضف عرض أداة

# @info:whatsthis
source: Adds a new tool view to this window.
ar: يُضيف عرض أداة جديدًا إلى هذه النافذة.

source: &Window Color Scheme
ar: &مخطّط ألوان النافذة

# @action:inmenu
source: Split View Top/Bottom
ar: افصل العرض فوق/تحت

# @action:inmenu
source: Split View Left/Right
ar: افصل العرض يمين/يسار

# @action:inmenu
source: New File
ar: ملفّ جديد

# @action:inmenu
source: Reload
ar: أعد التحميل

# @action:inmenu
source: Reload All
ar: أعد تحميل الكلّ

# @action:inmenu
source: Add Tool View
ar: أَضف عرض أداة

# @action:inmenu
source: Lock the Panel from Hiding
ar: اِقفل اللوحة ضد الإخفاء

# @item:inlistbox
source: All Project Files
ar: كل ملفات المشروع

# @title:tab
source: Select Source
ar: حدّد المصدر

source: Select a build system setup file, existing KDevelop project, or any folder to open as a project
ar: اِختر ملف إعداد نظام بناء، أو مشروع KDevelop مطورك موجود، أو أي مجلد لفتحه كمشروع

# @title:window
source: Open Project
ar: افتح مشروعًا

# @title:tab
source: Project Information
ar: معلومات المشروع

source: Open "%1" as project
ar: اِفتح "%1" كمشروع

source: Selected URL is invalid
ar: عنوان URL المُختار غير صالح

# @item:inlistbox
source: Open existing file "%1"
ar: اِفتح الملف الموجود "%1"

# @info:whatsthis
source: Use this command to show or hide the view's statusbar.
ar: استخدم هذا الأمر لإظهار أو إخفاء شريط حالة العرض.

source: The document "%1" has unsaved changes. Would you like to save them?
ar: الوثيقة "%1" تحتوي تغييرات غير محفوظة. هل تود حفظها؟

# @title:window
source: Close Document
ar: أغلق المستند

source: The document "%1" has unsaved changes and was modified by an external process. Do you want to overwrite the external changes?
ar: الوثيقة "%1" تحتوي تغييرات غير محفوظة وجرى تعديلها بعملية خارجية. هل تريد الكتابة فوق التغييرات الخارجية؟

# @action:button
source: Overwrite External Changes
ar: اِكتُب فوق التغييرات الخارجية

source: Plugin
ar: الملحقة

source: DuchainBuilder
ar: باني سلسلة الاستخدام

source: Todo
ar: مهمّة

# @item problem severity
source: Hint
ar: تلميح

# @item problem severity
source: Warning
ar: تحذير

# @item problem severity
source: Error
ar: خطأ

# @info:tooltip
source: Re-parse all watched documents
ar: أَعِد تحليل كل الوثائق المُراقَبة

# @title:column source of problem
source: Source
ar: المصدر

# @title:column problem description
source: Problem
ar: المشكلة

# @title:column file where problem was found
source: File
ar: ملف

# @title:column line number with problem
source: Line
ar: السّطر

# @title:column column number with problem
source: Column
ar: العمود

# @info:tooltip
source: Cancel this operation
ar: ألغِ العمليّة

# @info
source: Aborting...
ar: يجهض...

# @info:tooltip
source: Open detailed progress dialog
ar: افتح حواريّ تقدّم مفصّل

# @info:tooltip
source: Hide detailed progress window
ar: أخفِ نافذة التّقدّم المفصّلة

# @info:tooltip
source: Show detailed progress window
ar: أظهر نافذة تقدّم مفصّلة

source: Loading Project %1
ar: يحمّل المشروع %1

# %1: Project name
source: Loading %1
ar: يحمل %1

source: Unable to load the project file %1.<br>The project has been removed from the session.
ar: غير قادر على تحميل ملف المشروع %1.<br>أُزيل المشروع من الجلسة.

source: Unable to create hidden dir (%1) for developer file
ar: غير قادر على إنشاء مجلد مخفي (%1) لملف المطور

source: Unable to get project file: %1
ar: غير قادر على الحصول على ملف المشروع: %1

source: Could not load %1, a project with the same name '%2' is already open.
ar: لا أقدر على تحميل %1، فمشروع بالاسم نفسه '%2' مفتوح بالفعل.

source: Could not load project management plugin <b>%1</b>.<br>Check that the required programs are installed, or see console output for more information.
ar: لا أقدر على تحميل ملحق إدارة المشروع <b>%1</b>.<br> اِفحص ما إن برامج ضرورية مُثبَّتة، أو اِطّلع على خرج الطرفية لمزيد من المعلومات.

source: The project importing plugin (%1) does not support the IProjectFileManager interface.
ar: ملحق استيراد المشروع (%1) لا يدعم واجهة IProjectFileManager.

source: Could not open project.
ar: تعذّر فتح المشروع.

source: Could not store developer specific project configuration. Attention: The project settings you changed will be lost.
ar: لا أقدر على تخزين ضبط مشروع خاص بالمطور. انتباه: إعدادات المشروع التي غيرتها ستضيع.

# @title:window
source: Configure Project %1
ar: اضبط المشروع %1

source: Invalid Location: %1
ar: المكان غير صالح: %1

source: Already opening %1, not opening again
ar: يُفتح %1 بالفعل، لا تَفتحه مرة أخرى

# @action:button
source: Override
ar: استبدال

# @info:tooltip
source: Continue to open the project and use the just provided project configuration
ar: اِستمر في فتح المشروع واِستخدِم ضبط المشروع المُقدَّم الآن فحسب

# @action:button
source: Open Existing File
ar: اِفتح الملف الموجود

# @info:tooltip
source: Continue to open the project but use the existing project configuration
ar: اِستمر في فتح المشروع ولكن اِستخدِم ضبط المشروع الموجود

# @info:tooltip
source: Cancel and do not open the project
ar: أَلغِ ولا تَفتح المشروع

source: There already exists a project configuration file at %1. Do you want to override it or open the existing file?
ar: يوجد بالفعل ملف ضبط مشروع في %1. هل تريد الكتابة فوقه أم فتح الملف الموجود؟

# @title:window
source: Override Existing Project Configuration
ar: اِكتُب فوق ضبط المشروع الموجود

source: Unable to create configuration file %1
ar: غير قادر على إنشاء ملف الضبط %1

source: Reopen the current project?
ar: أَعِد فتح المشروع الحالي؟

# @action:button
source: Reopen
ar: أعد فتح

# @action
source: Open / Import Project...
ar: اِفتح / اِستورد مشروعًا...

# @info:tooltip
source: Open or import project
ar: اِفتح أو اِستورد مشروعًا

# @info:whatsthis
source: Open an existing KDevelop project or import an existing Project into KDevelop. This entry allows one to select a KDevelop project file or an existing directory to open it in KDevelop. When opening an existing directory that does not yet have a KDevelop project file, the file will be created.
ar: اِفتح مشروع KDevelop مطورك موجود أو اِستورد مشروعًا موجودًا إلى KDevelop مطوّرك. يتيح هذا الإدخال اختيار ملف مشروع KDevelop مطورك أو مجلد موجود لفتحه في KDevelop مطورك. عند فتح مجلد موجود ليس فيه ملف مشروع KDevelop مطورك بعد، يُنشأ الملف.

# @action
source: Fetch Project...
ar: اجلب مشروعًا...

# @info:tooltip
source: Fetch project
ar: اجلب مشروعًا

# @info:whatsthis
source: Guides the user through the project fetch and then imports it into KDevelop.
ar: دليل المستخدِم خلال جلب المشروع ثم اِستورده إلى KDevelop مطوّرك.

# @action
source: Close Project(s)
ar: أَغلِق المشروع (المشاريع)

# @info:tooltip
source: Closes all currently selected projects
ar: يُغلق كل المشاريع المُختارة حاليًا

# @action
source: Open Configuration...
ar: اِفتح الضبط...

# @action
source: Commit Current Project...
ar: اِلتزِم بالمشروع الحالي...

# @action
source: Commit...
ar: أوْدِعْ...

# @action
source: Open Recent Project
ar: افتح مشروعًا حديثًا

# @info:whatsthis
source: Opens recently opened project.
ar: يَفتح مشروعًا مفتوحًا مؤخرًا.

# @action
source: Open Project for Current File
ar: اِفتح مشروع الملف الحالي

source: Project already open: %1
ar: المشروع مفتوح فعلًا: %1

source: No active document
ar: لا وثيقة نشطة

# @title:window
source: Project Already Open
ar: المشروع مفتوح فعلًا

source: The project you're trying to open is already open in at least one other session.<br>What do you want to do?
ar: المشروع الذي تحاول فتحه مفتوح بالفعل في جلسة أخرى على الأقل.<br>ماذا تريد أن تفعل؟

# @option:radio
source: Add project to current session
ar: أَضف المشروع إلى الجلسة الحالية

# @option:radio
source: Open session %1
ar: افتح جلسة %1

source: No enabled plugin supports this repository URL: %1
ar: لا ملحق مُفعَّل يدعم عنوان URL هذا للمستودع: %1

# @action
source: Reparse the Entire Project
ar: أَعِد تحليل المشروع بأكمله

# @info:tooltip
source: Select the Management Plugin to use for this project
ar: اِختر ملحق الإدارة لـ استخدامه لهذا المشروع

# @label:listbox
source: Project manager:
ar: مدير المشروع:

# @info:tooltip
source: Provide a name for the project
ar: زَوِّد اسمًا للمشروع

# @label:textbox
source: Name:
ar: الاسم:

# @item:inlistbox
source: From File System
ar: من نظام الملفات

source: Could not create the directory: %1
ar: لا أقدر على إنشاء المجلد: %1

source: You need to specify a valid or nonexistent directory to check out a project
ar: اِحتَجت أن تُحدد مجلدًا صالحًا أو غير موجود لـ سحب المشروع

source: You need to specify the source for your remote project
ar: اِحتَجت أن تُحدد مصدر مشروعك البعيد

source: You need to specify an empty folder as your project destination
ar: اِحتَجت أن تُحدد مجلدًا فارغًا كوجهة لمشروعك

# @label:listbox
source: Source:
ar: المصدر:

# @title:group
source: Destination
ar: المقصد

# @label:textbox
source: Directory:
ar: الدّليل:

# @info:placeholder
source: Select the directory to use...
ar: اِختر المجلد لـ استخدامه...

# @title:group
source: Source
ar: المصدر

# @action:button
source: Get
ar: إحضار

# launch mode
source: Debug
ar: التنقيح

# launch mode
source: Profile
ar: التشكيلة

# launch mode
source: Execute
ar: نفّذ

source: The current launch configuration does not support the '%1' mode.
ar: ضبط الإطلاق الحالي لا يدعم نمط '%1'.

# @action
source: Configure Launches...
ar: اضبط الإطلاقات...

# @info:tooltip
source: Open Launch Configuration Dialog
ar: اِفتح حوار ضبط الإطلاق

# @info:whatsthis
source: Opens a dialog to setup new launch configurations, or to change the existing ones.
ar: يَفتح حوارًا لـ إعداد ضبطات إطلاق جديدة، أو لـ تغيير الموجودة.

# @action
source: Execute Launch
ar: نَفِّذ الإطلاق

# @action Short text for 'Execute Launch' used in the toolbar
source: Execute
ar: نفّذ

# @info:tooltip
source: Execute current launch
ar: نَفِّذ الإطلاق الحالي

# @info:whatsthis
source: Executes the target or the program specified in currently active launch configuration.
ar: يُنفِّذ الهدف أو البرنامج المُحدَّد في ضبط الإطلاق النشط حاليًا.

# @action Short text for 'Debug Launch' used in the toolbar
source: Debug
ar: التنقيح

# @action
source: Stop All Jobs
ar: أَوقِف كل المهام

# @action Short text for 'Stop All Jobs' used in the toolbar
source: Stop All
ar: أوقف الكل

# @info:tooltip
source: Stop all currently running jobs
ar: أَوقِف كل المهام الجارية حاليًا

# @info:whatsthis
source: Requests that all running jobs are stopped.
ar: يَطلُب إيقاف كل المهام الجارية.

# @action
source: Stop
ar: أوقف

# @action Short text for 'Stop' used in the toolbar
source: Stop
ar: أوقف

# @info:tooltip
source: Menu allowing to stop individual jobs
ar: قائمة تسمح بـ إيقاف مهام منفردة

# @info:whatsthis
source: List of jobs that can be stopped individually.
ar: قائمة بالمهام التي يُمكِن إيقافها منفردة.

# @title:menu
source: Current Launch Configuration
ar: ضبط الإطلاق الحالي

# @info:tooltip
source: Current launch configuration
ar: ضبط الإطلاق الحالي

# @info:whatsthis
source: Select which launch configuration to run when run is invoked.
ar: اِختر أي ضبط إطلاق يُشغَّل عند استدعاء التشغيل.

# @item:inmenu
source: <%1> Unnamed job
ar: <%1> مهمة غير مُسمَّاة

source: New %1 Launcher
ar: مُطلق %1 جديد

# @title:menu
source: %1 As...
ar: %1 كـ...

source: Host System
ar: نظام المضيف

source: Allows to select a runtime
ar: يَسمح بـ اختيار وقت تشغيل

source: Runtime: %1
ar: وقت التشغيل: %1

# @title:window
source: Save Modified Files?
ar: اِحفظ الملفات المُعدَّلة؟

source: The following files have been modified. Save them?
ar: عُدِّلت الملفات التالية. اِحفظها؟

# @action:button
source: Save &None
ar: لا تَحفظ شيئًا

# @info:tooltip
source: Discard all modifications
ar: اِتخلَّص من كل التعديلات

source: (no projects)
ar: (لا مشاريع)

# @info:tooltip
source: Delete session
ar: احذف الجلسة

# @title:window
source: Pick a Session
ar: اِختر جلسة

# @action:button
source: Run
ar: شغّل

# @info:tooltip
source: Active session. pid %1, app %2, host %3
ar: جلسة نشطة. رقم العملية %1، تطبيق %2، مضيف %3

source: Running
ar: يعمل

# @title:window
source: Cannot Delete Session
ar: لا أقدر على حذف الجلسة

# @info
source: <p>Cannot delete a locked session.
ar: <p>لا أقدر على حذف جلسة مقفلة.

# @info
source: <p>The session <b>%1</b> is locked by %2 on %3 (PID %4).
ar: <p>الجلسة <b>%1</b> مقفلة بواسطة %2 على %3 (رقم العملية %4).

# @info
source: The session <b>%1</b> and all contained settings will be deleted. The projects will stay unaffected. Do you really want to continue?
ar: الجلسة <b>%1</b> وكل الإعدادات التي تحتويها ستحذف. المشاريع ستبقى غير متأثرة. هل تريد حقًا الاستمرار؟

# @title:window
source: Delete Session
ar: احذف الجلسة

# @title:window
source: Start New Session
ar: ابدأ جلسة جديدة

# @label:textbox
source: New session name:
ar: اسم الجلسة الجديدة:

source: The current session and all contained settings will be deleted. The projects will stay unaffected. Do you really want to continue?
ar: الجلسة الحالية وكل الإعدادات التي تحتويها ستحذف. المشاريع ستبقى غير متأثرة. هل تريد حقًا الاستمرار؟

# @title:window
source: Rename Session
ar: أعد تسمية الجلسة

source: Session Manager
ar: مدير الجلسات

# @action:inmenu
source: Start New Session
ar: ابدأ جلسة جديدة

# @info:tooltip
source: Start a new KDevelop instance with an empty session
ar: اِبدأ نسخة KDevelop مطوّرك جديدة بجلسة فارغة

# @action:inmenu
source: Start New Named Session...
ar: اِبدأ جلسة مُسمَّاة جديدة...

# @info:tooltip
source: Start a new KDevelop instance with an empty named session
ar: اِبدأ نسخة KDevelop مطوّرك جديدة بجلسة مُسمَّاة فارغة

# @action
source: Rename Current Session...
ar: أَعِد تسمية الجلسة الحالية...

# @action
source: Delete Current Session...
ar: اِحذف الجلسة الحالية...

# @action
source: Quit
ar: أنهِ

source: Copy of %1
ar: نسخة عن %1

# @title:column
source: Identity
ar: الهويّة

# @title:column
source: Contents
ar: المحتويات

# @title:column
source: State
ar: الحالة

# @title:column
source: Name
ar: الاسم

# @label:textbox
source: Filter:
ar: المرشّح:

source: Create New Session
ar: أَنشِئ جلسة جديدة

# @info:shell
source: Running %1 instance (PID: %2) detected, making this one visible instead of starting a new one
ar: اكتُشفت نسخة %1 جارية (رقم العملية: %2)، إِجعل هذه مرئية بدلًا من بدء نسخة جديدة

# @info:shell
source: Running %1 instance (PID: %2) is apparently hung
ar: يبدو أن النسخة %1 الجارية (رقم العملية: %2) معلَّقة

# @info
source: The given application did not respond to a DBUS call, it may have crashed or is hanging.
ar: التطبيق المُعطى لم يستجِب لـ استدعاء DBUS، ربما انهار أو أنه مُعلَّق.
