Repository: KDE/kdevelop
Catalog: po/*/kdevghprovider.po
Languages: ar

source: You have not authorized KDevelop to use your GitHub account. If you authorize KDevelop, you will be able to fetch your public/private repositories and the repositories from your organizations.
ar: أنت لَم تصرّح لمطورك KDevelop باستعمال حسابك في غت هاب. إن صرّحت لمطورك KDevelop، تستطيع جلب مستودعاتك العامة/الخاصة ومستودعات مؤسساتك.

# %1 is the URL with the GitHub token settings
source: You can check the authorization for this application and others at %1
ar: تستطيع مراجعة التصريح لهذا التطبيق والآخرين في %1

source: You are logged in as <b>%1</b>.<br/>%2
ar: أنت ولجت بصفتك <b>%1</b>.<br/>%2

# @action:button
source: Log Out
ar: اخرج

# @action:button
source: Force Sync
ar: فرض المزامنة

# @action:button
source: Authorize
ar: صرّح

# @title:window
source: GitHub Account
ar: حساب غت هاب

source: Enter a login and a password
ar: أدخل اسم ولوج وكلمة سر

source: Waiting for response
ar: انتظر ردًا

source: Authentication failed. Please try again. Could not create token: "%1" %2
ar: فشل الاستيثاق. رجاء حاول ثانية. ما أمكن إنشاء وسم: «%1» %2

# @title:window
source: GitHub Authorization Failed
ar: فشل تصريح غت هاب

source: Authentication succeeded. Created token: "%1" %2
ar: نجح الاستيثاق. أنشئ وسم: «%1» %2

# @title:window
source: GitHub Account Authorized
ar: صُرّح لحساب غت هاب

# @title:window
source: Authentication Code
ar: رمز الاستيثاق

# @label:textbox
source: OTP Code:
ar: رمز OTP:

source: Please, write your password here.
ar: رجاء، اكتب كلمة سرك هنا.

source: GitHub
ar: غت هاب

# @info:placeholder
source: Search...
ar: ابحث...

# @info:tooltip
source: You can press the Return key if you do not want to wait.
ar: تستطيع ضغط مفتاح الإدخال إن لَم ترغب في الانتظار.

# @info:tooltip
source: Configure your GitHub account
ar: اضبط حسابك في غت هاب

source: The Git plugin could not be loaded which is required to import a GitHub project.
ar: ما أمكن تحميل إضافة Git التي تلزم لاستيراد مشروع غت هاب.

# @title:window
source: GitHub Provider Error
ar: خطأ مزود غت هاب

# @item:inlistbox
source: User
ar: المستخدم

# @item:inlistbox
source: Organization
ar: المؤسسة
