Repository: KDE/kdevelop
Catalog: po/*/kdevstandardoutputview.po
Languages: ar, gl

# @info:tooltip
source: Enter a case-insensitive regular expression to filter the output view
ar: أدخل تعبيرًا نمطيًا غير حساس لحالة الأحرف لفلترة عرض المخرجات
gl: Escriba unha expresión regular que non distingue maiúsculas para filtrar a vista de saída.

# @title:window
source: Output View
ar: عرض المخرجات
gl: Vista de saída

# @info:tooltip
source: Close the currently active output view
ar: أغلق عرض المخرجات النشط حاليًا
gl: Pechar a vista de saída activa.

# @info:tooltip
source: Close all other output views
ar: أغلق كل عروض المخرجات الأخرى
gl: Pechar as outras vistas de saída.

# @action
source: Previous Output
ar: المخرج السابق
gl: Saída anterior

# @action
source: Next Output
ar: المخرج التالي
gl: Seguinte saída

# @action
source: Select Activated Item
ar: اختر العنصر المنشط
gl: Seleccionar o elemento activado

# @action
source: Focus when Selecting Item
ar: ركّز عند اختيار عنصر
gl: Enfocar ao seleccionar un elemento

# @action
source: Word Wrap
ar: التفاف الكلمات
gl: Axuste de palabras

# @action
source: First Item
ar: العنصر الأول
gl: Primeiro elemento

# @action
source: Previous Item
ar: العنصر السابق
gl: Elemento anterior

# @action
source: Next Item
ar: العنصر التالي
gl: Seguinte elemento

# @action
source: Last Item
ar: العنصر الأخير
gl: Último elemento

# @action
source: Clear
ar: امحُ
gl: Anular a selección

# @info:placeholder
source: Search...
ar: ابحث...
gl: Buscar…

# @action %1: output type, e.g. Build or Run
source: Configure %1 Output
ar: اضبط مخرج %1
gl: Configurar a saída de «%1»

source: Filter regular expression pattern error at offset %1: %2
ar: خطأ في نمط التعبير النمطي للفلترة عند الإزاحة %1: %2
gl: Erro de padrón de expresión regular de filtro na posición %1:%2.

# @title:window %1: output type, e.g. Build or Run
source: Configure %1 Output
ar: اضبط مخرج %1
gl: Configurar a saída de «%1»

# @option:check
source: Limit the number of output views
ar: حدّد عدد عروض المخرجات
gl: Limitar o número de vistas de saída.

# @info:tooltip
source: Automatically close oldest output views
ar: أغلق آليًا أقدم عروض المخرجات
gl: Pechar automaticamente as vistas de saída máis vellas.

# @label:spinbox
source: Maximum output view count
ar: العدد الأقصى لعرض المخرجات
gl: Número máximo de vistas de saída.

# @info:tooltip
source: The oldest output view is closed when the number of views exceeds this value
ar: يغلق أقدم عرض مخرجات عندما يتجاوز عدد العروض هذه القيمة
gl: A vista de saída máis vella péchase ao superar este valor o número de vistas.

# @title:window
source: Build
ar: ابنِ
gl: Construír

# @title:window
source: Run
ar: شغّل
gl: Executar

# @title:window
source: Debug
ar: صحّح
gl: Depurar

# @title:window
source: Analyze
ar: حلّل
gl: Analizar

# @title:window
source: Version Control
ar: تحكم بالإصدار
gl: Control de versións
