Repository: KDE/kdevelop
Catalog: po/*/kdevproblemreporter.po
Languages: ar

source: Parser
ar: محلل

# @title:window
source: Problems
ar: المشكلات

# @action:inmenu
source: Solve Problem
ar: حلّ المشكلة

# @action:inmenu
source: Solve: %1
ar: حلّ: %1

# @action
source: Force Full Update
ar: أجبِر على تحديث كامل

# @info:tooltip
source: Which files to display the problems for
ar: أي الملفات نعرض مشكلاتها

# @option:check
source: Current Document
ar: المستند الحالي

# @info:tooltip
source: Display problems in current document
ar: اعرض المشكلات في المستند الحالي

# @option:check
source: Open Documents
ar: المستندات المفتوحة

# @info:tooltip
source: Display problems in all open documents
ar: اعرض المشكلات في كل المستندات المفتوحة

# @option:check
source: Current Project
ar: المشروع الحالي

# @info:tooltip
source: Display problems in current project
ar: اعرض المشكلات في المشروع الحالي

# @option:check
source: All Projects
ar: كلّ المشاريع

# @info:tooltip
source: Display problems in all projects
ar: اعرض المشكلات في كل المشاريع

# @option:check
source: Documents In Path
ar: مستندات في المسار

# @info:tooltip
source: Display problems from all files in a specific path
ar: اعرض المشكلات من كل الملفات في مسار محدد

# @option:check
source: Documents In Current Path
ar: مستندات في المسار الحالي

# @info:tooltip
source: Display problems from all files in the path of the current document
ar: اعرض المشكلات من كل الملفات في مسار المستند الحالي

# @option:check
source: Show All
ar: أظهر الكل

# @info:tooltip
source: Display all problems
ar: اعرض كل المشكلات

# @info:placeholder
source: Path Filter...
ar: مصفّي المسار...

# @option:check
source: Show Imports
ar: أظهر التضمينات

# @info:tooltip
source: Display problems in imported files
ar: اعرض المشكلات في الملفات المضمّنة

# @info:tooltip
source: Display errors
ar: اعرض الأخطاء

# @option:check
source: Show Errors
ar: أظهر الأخطاء

# @info:tooltip
source: Display warnings
ar: اعرض التحذيرات

# @option:check
source: Show Warnings
ar: أظهر التحذيرات

# @info:tooltip
source: Display hints
ar: اعرض التلميحات

# @option:check
source: Show Hints
ar: أظهر التلميحات

# @title:menu
source: Grouping
ar: تجميع

# @option:check
source: None
ar: لا شيء

# @option:check
source: Path
ar: المسار

# @option:check
source: Severity
ar: الشدّة

# @info:placeholder
source: Search...
ar: ابحث...

# @title:menu
source: Scope: %1
ar: النطاق: %1

# @info:whatsthis
source: Problems
ar: المشكلات

# @title:menu
source: Problem
ar: المشكلة

# @action:inmenu
source: &Copy Description
ar: &انسخ الوصف

# @title:menu
source: Solve: %1
ar: حلّ: %1
