Repository: KDE/kdevelop
Catalog: po/*/kdevmesonmanager.po
Languages: ar

source: *** MESON ERROR ***
ar: *** خطأ ميسون ***

source: Failed to set the internally used Ninja builder
ar: فشل إعداد باني نينجا المستخدَم داخليًا

source: Failed to acquire the Ninja builder plugin
ar: فشل الحصول على إضافة باني نينجا

source: The current build directory for %1 is invalid
ar: مجلد البناء الحالي لـ %1 غير صالح

source: The directory '%1' is not empty and does not seem to be an already configured build directory
ar: المجلد '%1' ليس فارغًا ولا يبدو أنه مجلد بناء مضبط بالفعل

source: The directory '%1' cannot be used as a meson build directory
ar: لا أقدر على استخدام المجلد '%1' كمجلد بناء ميسون

source: The current build configuration is broken, because the build directory is not specified
ar: ضبط البناء الحالي معطَّل، لأن مجلد البناء غير محدد

source: Congratulations: You have reached unreachable code! Please report a bug at https://bugs.kde.org/ FILE: %1:%2
ar: تهانينا: بلغتَ شيفرة لا أقدر على الوصول إليها! أرجوك أبلغ عن علة في https://bugs.kde.org/ ملف: %1:%2

source: Internal error: The buildsystem manager is not the MesonManager
ar: خطأ داخلي: مدير نظام البناء ليس مدير ميسون

source: Failed to create a new build directory
ar: فشل إنشاء مجلد بناء جديد

source: Meson
ar: ميسون

source: The directory '%1' is already pruned
ar: المجلد '%1' مقلمٌ بالفعل

source: The directory '%1' does not appear to be a meson build directory
ar: لا يبدو أن المجلد '%1' مجلد بناء ميسون

source: Aborting prune operation
ar: إجهاض عملية التقليم

source: Deleting contents of '%1'
ar: أحذف محتويات '%1'

source: ** Prune successful **
ar: ** نجح التقليم **

source: ** Prune failed: %1 **
ar: ** فشل التقليم: %1 **

# @title:window
source: Project Import Failed
ar: فشل استيراد المشروع

source: Meson builder error: %1
ar: خطأ باني ميسون: %1

source: Importing %1 failed because no build directory could be created.
ar: فشل استيراد %1 بسبب عدم قدرة إنشاء مجلد بناء.

source: Introspection file '%1' does not exist
ar: ملف الاستبطان '%1' ليس موجودًا

source: Failed to open introspection file '%1'
ar: فشل فتح ملف الاستبطان '%1'

source: In %1:%2: %3
ar: في %1:%2: %3

source: The introspection file '%1' contains neither an array nor an object
ar: ملف الاستبطان '%1' لا يحتوي على مصفوفة ولا على كائن

source: %1 returned %2
ar: أعاد %1 %2

source: JSON parser error: %1
ar: خطأ محلل JSON: %1

source: The introspection output of '%1' contains neither an array nor an object
ar: خرج استبطان '%1' لا يحتوي على مصفوفة ولا على كائن

source: The current build directory is invalid
ar: مجلد البناء الحالي غير صالح

# %1 - test case name
source: Meson Test "%1"
ar: اختبار ميسون "%1"

source: Failed to create a temporary file.
ar: فشل إنشاء ملف مؤقت.

source: The rewriter output of '%1' is not an object
ar: خرج المُعيد كتابة '%1' ليس كائنًا

# @action:button
source: Show Advanced Configuration
ar: أظهر الضبط المتقدم

# @title:group
source: Advanced Configuration
ar: الضبط المتقدم

# @label:textbox
source: Extra Meson arguments:
ar: وسائط ميسون إضافية:

# @label:listbox
source: Meson backend:
ar: خلفية ميسون:

# @label:chooser
source: Meson executable:
ar: تنفيذي ميسون:

# @info:tooltip
source: Changing this will reset the build options.
ar: تغيير هذا سيعيد تعيين خيارات البناء.

# @info:placeholder
source: /path/to/mesonexecutable
ar: /المسار/إلى/تنفيذي_ميسون

# @action:button
source: Hide Advanced Configuration
ar: أخفِ الضبط المتقدم

source: Status: %1
ar: الحالة: %1

source: The current build directory does not exist
ar: مجلد البناء الحالي ليس موجودًا

source: The current build directory is empty
ar: مجلد البناء الحالي فارغ

source: Build directory configured
ar: مجلد البناء مضبط

source: This meson build directory is not fully configured
ar: مجلد بناء ميسون هذا لم يضبط بالكامل

source: This directory does not seem to be a meson build directory
ar: لا يبدو هذا المجلد مجلد بناء ميسون

source: Invalid build directory configuration (empty build directory string)
ar: ضبط مجلد بناء غير صالح (سلسلة مجلد بناء فارغة)

source: Something went very wrong. This is a bug
ar: حدث خطأ فادح. هذه علة

source: No changes
ar: لا تغييرات

source: %1 option changed
ar: تغيَّر خيار %1

# @title:tab
source: Meson
ar: ميسون

# @title:tab
source: Meson Project Configuration
ar: ضبط مشروع ميسون

source: Status message...
ar: رسالة الحالة...

source: Num changed
ar: عدد المتغيرات

source: <NEW>
ar: <جَدِيد>

source: Dialog
ar: حوار

source: New
ar: جديد

source: Delete
ar: احذف

source: First
ar: الأول

source: Up
ar: أعلى

source: Down
ar: أسفل

source: Last
ar: الأخير

# @title:window
source: Configure a Build Directory - %1
ar: اضبط مجلد بناء - %1

source: Specified meson executable does not exist
ar: تنفيذي ميسون المحدد ليس موجودًا

source: Creating new build directory
ar: أنشئ مجلد بناء جديد

source: Using an already configured build directory
ar: أستخدم مجلد بناء مضبط بالفعل

source: Using a broken meson build directory (this should be fine)
ar: أستخدم مجلد بناء ميسون معطَّل (يجب أن يكون هذا جيدًا)

source: Cannot use specified directory
ar: لا أقدر على استخدام المجلد المحدد

source: There are already files in the build directory
ar: هناك ملفات بالفعل في مجلد البناء

source: The build directory field must not be empty
ar: يجب ألا يكون حقل مجلد البناء فارغًا

source: You have reached unreachable code. This is a bug
ar: بلَغتَ شيفرة لا أقدر على الوصول إليها. هذه علة

source: Build directory:
ar: مجلد البناء:

source: Full Path to the new build directory
ar: المسار الكامل لمجلد البناء الجديد

source: Name:
ar: الاسم:

source: Reset to default value
ar: أعد تعيين للقيمة المبدئية

source: Meson Options
ar: خيارات ميسون

source: Core
ar: الأساسي

source: Backend
ar: الخلفية

source: Base
ar: القاعدة

source: Compiler
ar: المترجم

source: Directories
ar: المجلدات

source: Project
ar: المشروع

source: Testing
ar: الاختبار

source: Initializing GUI
ar: أهيئ واجهة المستخدم الرسومية

source: Loading project data...
ar: أحمِّل بيانات المشروع...

source: Writing project data...
ar: أكتب بيانات المشروع...

source: Loading meson rewriter data failed
ar: فشل تحميل بيانات مُعيد كتابة ميسون

# @title:window
source: Select Additional Meson Option
ar: اختر خيار ميسون إضافي

# @label:listbox
source: Meson option to add:
ar: خيار ميسون للإضافة:

# @title:tab
source: Project
ar: المشروع

# @title:tab
source: Meson Project Settings
ar: إعدادات مشروع ميسون

source: Meson project settings
ar: إعدادات مشروع ميسون

source: Project settings
ar: إعدادات المشروع

source: Project default options
ar: خيارات المشروع المبدئية

source: New Option
ar: خيار جديد
