Repository: KDE/kdevelop
Catalog: po/*/kdevprojectmanagerview.po
Languages: ar, he

source: Move %1 item into %2
ar: انقل %1 عنصرًا إلى %2
he: העברת פריט לתוך %2

source: Copy %1 item into %2
ar: انسخ %1 عنصرًا إلى %2
he: העתקת פריט לתוך %2

source: Delete %1 item
ar: احذف %1 عنصرًا
he: מחיקת פריט

source: Move item %1 into %2
ar: انقل العنصر %1 إلى %2
he: העברת הפריט %1 לתוך %2

source: Copy item %1 into %2
ar: انسخ العنصر %1 إلى %2
he: העתקת הפריט %1 לתוך %2

source: Delete item %1
ar: احذف العنصر %1
he: מחיקת הפריט %1

# @info:tooltip
source: Suboperation succeeded
ar: العملية الفرعية نجحت
he: תת־הפעולה הצליחה

# @info:tooltip
source: Suboperation failed
ar: العملية الفرعية فشلت
he: תת־הפעולה נכשלה

# @info:tooltip
source: Suboperation skipped to prevent data loss
ar: تخطي العملية الفرعية لمنع ضياع البيانات
he: תת־הפעולה נפסחה כדי למנוע אובדן נתונים

# @title:window
source: Paste Failed
ar: فشل اللصق
he: ההדבקה נכשלה

source: Failed to paste. Below is a list of suboperations that have been attempted.
ar: فشل اللصق. أدناه قائمة بالعمليات الفرعية التي جرت محاولتها.
he: ההדבקה נכשלה. להלן רשימה של תת־פעולות שניסינו לבצע.

source: Main Toolbar
ar: شريط الأدوات الرئيسي
he: סרגל כלים ראשי

# @title:menu
source: Build Set
ar: مجموعة البناء
he: ערכת בנייה

# @action:inmenu
source: Remove from Build Set
ar: أزل من مجموعة البناء
he: הסרה מערכת הבנייה

# @info:tooltip
source: Move the selected items to the top
ar: انقل العناصر المختارة إلى الأعلى
he: העלאת הפריטים הנבחרים לראש

# @info:tooltip
source: Move the selected items up
ar: حرّك العناصر المختارة إلى الأعلى
he: העלאת הפריטים הנבחרים למעלה

# @info:tooltip
source: Move the selected item down
ar: حرّك العنصر المختار إلى الأسفل
he: הורדת הפריט הנבחר למטה

# @info:tooltip
source: Move the selected items to the bottom
ar: انقل العناصر المختارة إلى الأسفل
he: הורדת הפריטים הנבחרים לתחתית

# @info:tooltip
source: These items will be built in the order they are listed.
ar: تُبنى هذه العناصر وفق تسلسل إدراجها.
he: הפריטים האלו ייבנו בסדר שבו הם מופיעים.

# @title
source: Build Sequence
ar: تسلسل البناء
he: רצף בנייה

# @info:tooltip
source: Add currently selected items from project tree view to the build set.
ar: أضف العناصر المختارة حاليًّا من عرض شجرة المشروع إلى مجموعة البناء.
he: הוספת הפריטים הנבחרים מתצוגת עץ המיזם לערכת הבנייה.

# @info:tooltip
source: Remove currently selected item from the build set.
ar: أزل العنصر المختار حاليًّا من مجموعة البناء.
he: הסרת הפריט הנבחר מערכת הבנייה.

# @title:window
source: Projects
ar: المشاريع
he: מיזמים

# @action
source: Locate Current Document
ar: حدد مكان المستند الحالي
he: איתור המסמך הנוכחי

# @info:tooltip
source: Locates the current document in the project tree and selects it.
ar: يحدد مكان المستند الحالي في شجرة المشروع ويختاره.
he: איתור המסמך הנוכחי בעץ המיזם ובחירה בו.

# @action
source: Auto-Select Current Document
ar: اختر المستند الحالي آليًّا
he: בחירת המסמך הנוכחי אוטומטית

# @info:tooltip
source: Automatically select the current document in the project tree.
ar: يختار المستند الحالي آليًّا في شجرة المشروع.
he: בחירת המסמך הנוכחי בעץ המיזם.

# @action
source: Show Build Targets
ar: اعرض أهداف البناء
he: הצגת יעדי בנייה

# @info:whatsthis
source: Project Overview
ar: نظرة عامة على المشروع
he: סקירת מיזם

# @info:whatsthis
source: Build Items:
ar: عناصر البناء:
he: פריטי בנייה:

# @action
source: Build All Projects
ar: ابنِ كل المشاريع
he: בנייה של כל המיזמים

# @action
source: Build Selection
ar: ابنِ التحديد
he: בניית הבחירה

# @action:intoolbar
source: Build
ar: ابنِ
he: בנייה

# @action
source: Install Selection
ar: ثبِّت التحديد
he: התקנת הבחירה

# @action:intoolbar
source: Install
ar: ثبِّت
he: התקנה

# @action
source: Clean Selection
ar: نظِّف التحديد
he: פינוי הבחירה

# @action:intoolbar
source: Clean
ar: نظِّف
he: פינוי

# @action
source: Configure Selection
ar: اضبط التحديد
he: הגדרת הבחירה

# @action:intoolbar
source: Configure
ar: اضبط
he: הגדרה

# @action
source: Prune Selection
ar: قلِّم التحديد

# @action:intoolbar
source: Prune
ar: قلِّم

# @action:inmenu
source: Create &File...
ar: أنشئ &ملفًّا...
he: יצירת &קובץ…

# @action:inmenu
source: Create F&older...
ar: أنشئ &مجلدًا...
he: יצירת &תיקייה…

# @action:inmenu
source: &Build
ar: &ابنِ
he: &בנייה

# @action:inmenu
source: &Install
ar: &ثبِّت
he: ה&תקנה

# @action:inmenu
source: &Clean
ar: &نظِّف
he: &פינוי

# @action:inmenu
source: &Add to Build Set
ar: &أضف إلى مجموعة البناء
he: הו&ספה לערכת בנייה

# @action:inmenu
source: C&lose Project
ar: &أغلق المشروع
he: ס&גירת מיזם

# @action:inmenu
source: &Reload
ar: &أعد التلقيم
he: &ריענון

# @action:inmenu
source: Remo&ve
ar: &أزل
he: הס&רה

# @action:inmenu
source: Re&name...
ar: &أعد التسمية...
he: &שינוי שם…

# @action:inmenu
source: Remove from &Target
ar: أزل من &الهدف
he: הסרה מהי&עד

# @title:window
source: Create Folder in %1
ar: أنشئ مجلدًا في %1
he: יצירת תיקייה תחת %1

# @label:textbox
source: Folder name:
ar: اسم المجلد:
he: שם התיקייה:

source: Do you really want to delete this item?
ar: هل تريد حقًّا حذف هذا العنصر؟
he: למחוק את הפריט הזה?

# @title:window
source: Delete Files
ar: احذف الملفات
he: מחיקת קבצים

# @window:title
source: Rename
ar: أعد التسمية
he: שינוי שם

# @label:textbox
source: New name for '%1':
ar: الاسم الجديد لـ «%1»:
he: שם חדש עבור ‚%1’:

source: There is already a file named '%1'
ar: يوجد ملف بالاسم «%1» بالفعل
he: כבר יש קובץ בשם ‚%1’

source: Could not rename '%1'
ar: لا أقدر إعادة تسمية «%1»
he: לא ניתן לשנות את השם של ‚%1’

source: '%1' is not a valid file name
ar: «%1» ليس اسم ملف صالحًا
he: ‚%1’ הוא לא שם תקף לקובץ

# @title:window
source: Create File in %1
ar: أنشئ ملفًّا في %1
he: יצירת קובץ תחת %1

# @label:textbox
source: File name:
ar: اسم الملف:
he: שם קובץ:

# @action:inmenu
source: &Move Here
ar: &انقل هنا
he: ה&עברה לכאן

# @action:inmenu
source: &Copy Here
ar: &انسخ هنا
he: הע&תקה לכאן

# @action:inmenu
source: C&ancel
ar: &ألغِ
he: &ביטול

# @action:inmenu
source: &Add to Build Target
ar: &أضف إلى هدف البناء
he: הו&ספה ליעד בנייה

# @title:menu
source: Analyze with
ar: حلل باستخدام
he: אבחון עם

# @action:inmenu
source: Open Configuration...
ar: افتح الضبط...
he: פתיחת ההגדרות…

# Version control: Currently not on a branch
source: (no branch)
ar: (لا فرع)
he: (אין ענף)
