Repository: KDE/kdevelop
Catalog: po/*/kdevappwizard.po
Languages: ar, he

# @title:window
source: Create New Project
ar: أنشئ مشروعًا جديدًا
he: יצירת מיזם חדש

# @title:tab Page for general configuration options
source: General
ar: عامّ
he: כללי

# @title:tab Page for version control options
source: Version Control
ar: التحكم بالإصدارات
he: בקרת גרסאות

# @action
source: New from Template...
ar: جديد من القالب...
he: חדש מתבנית…

# @info:tooltip
source: Generate a new project from a template
ar: ولّد مشروعًا جديدًا من قالب
he: יצירת מיזם חדש מתבנית

# @info:whatsthis
source: This starts KDevelop's application wizard. It helps you to generate a skeleton for your application from a set of templates.
ar: يشغّل هذا معالج تطبيقات مطوّرك. يساعدك في توليد هيكل لتطبيقك من مجموعة من القوالب.
he: מפעיל את אשף היישומים של KDevelop. הוא יסייע לך לייצר שלד ליישום שלך מסדרה של תבניות.

source: Could not create project from template.
ar: تعذّر إنشاء المشروع من القالب.
he: לא ניתן ליצור מיזם מתבנית.

source: Please see the Version Control tool view.
ar: اطلع على عرض أداة التحكّم بالإصدارات.
he: נא לגשת לתצוגת כלי בקרת הגרסאות.

# @title:window
source: Version Control System Error
ar: خطأ في نظام التحكّم بالإصدارات
he: שגיאת מערכת בקרת גרסאות

source: Could not initialize DVCS repository
ar: تعذّر تهيئة مستودع نظام التحكّم بالإصدارات الموزَّع (DVCS)
he: לא ניתן לאתר מאגר DVCS

source: Could not check status of the DVCS repository
ar: تعذّر فحص حالة مستودع نظام التحكّم بالإصدارات الموزَّع (DVCS)
he: לא ניתן לבדוק את מצב מאגר ה־DVCS

source: Could not add files to the DVCS repository
ar: تعذّر إضافة الملفّات إلى مستودع نظام التحكّم بالإصدارات الموزَّع (DVCS)
he: לא ניתן להוסיף קבצים למאגר ה־DVCS

source: Could not import project into %1.
ar: تعذّر استيراد المشروع إلى %1.
he: לא ניתן לייבא מיזם לתוך %1.

source: Could not import project
ar: تعذّر استيراد المشروع
he: לא ניתן לייבא מיזם

source: Could not checkout imported project
ar: تعذّر سحب المشروع المستورد
he: לא ניתן למשוך מיזם שיובא

source: Could not create new project
ar: تعذّر إنشاء مشروع جديد
he: לא ניתן ליצור מיזם חדש

source: The file %1 cannot be created.
ar: لا يمكن إنشاء الملف %1.
he: לא ניתן ליצור את הקובץ %1.

source: Project Templates
ar: قوالب المشروع
he: תבניות מיזמים

# @title:column
source: Category
ar: الفئة
he: קטגוריה

# @title:column
source: Project Type
ar: نوع المشروع
he: סוג מיזם

# @action:button
source: Get More Templates
ar: أحضر المزيد من القوالب
he: הורדת תבניות נוספות

# @action:button
source: Load Template from File
ar: حمّل القالب من ملفّ
he: טעינת תבנית מקובץ

source: Invalid location
ar: المكان غير صالح
he: מקום שגוי

source: Empty project name
ar: اسم مشروع فارغ
he: שם מיזם ריק

source: Invalid project name
ar: اسم مشروع غير صالح
he: שם מיזם שגוי

source: Unable to create subdirectories, missing permissions on: %1
ar: تعذّر إنشاء مجلّدات فرعية، إذن الوصول مفقود على: %1
he: לא ניתן ליצור תת־תיקיות, הרשאות חסרות אצל: %1

source: Invalid project template, please choose a leaf item
ar: قالب مشروع غير صالح، اختر عنصرًا طرفيًّا
he: תבנית מיזם שגויה, נא לבחור פריט עלה

source: Path already exists and contains files. Open it as a project.
ar: المسار موجود مسبقًا ويحوي ملفّات. افتحه كمشروع.
he: הנתיב כבר קיים ומכיל קבצים. יש לפתוח אותו כמיזם.

source: The specified path already exists and contains files. Are you sure you want to proceed?
ar: المسار المحدّد موجود مسبقًا ويحوي ملفّات. هل أنت متأكّد من المتابعة؟
he: הנתיב שצוין כבר קיים ומכיל קבצים. להמשיך?

# @title:window
source: Load Template from File
ar: حمّل القالب من ملفّ
he: טעינת תבנית מקובץ

# @title:group
source: Properties
ar: الخصائص
he: מאפיינים

# @label:textbox
source: Project name:
ar: اسم المشروع:
he: שם מיזם:

# @label:textbox
source: Location:
ar: المكان:
he: מקום:

# @item:inlistbox No Version Control Support chosen
source: None
ar: لا شيء
he: ללא

# @label:listbox
source: Version control system:
ar: نظام تحكم بالمراجعات:
he: מערכת בקרת גרסאות:
