Repository: KDE/kdevelop
Catalog: po/*/kdevscratchpad.po
Languages: ar, he, zh_tw

# @title:window
source: Scratchpad
ar: لوح الخربشة
he: פנקס שרבוטים
zh_tw: 試寫區

source: Failed to remove scratch: %1
ar: فشل في إزالة الخربشة: %1
he: הסרת השרבוט נכשלה: %1
zh_tw: 移除試寫區失敗：%1

source: Failed to create scratch: Name already in use
ar: فشل في إنشاء خربشة: الاسم مستعمل بالأصل
he: יצירת שרבוט נכשלה: השם כבר בשימוש
zh_tw: 建立試寫區失敗：名稱已被使用

source: Failed to create new scratch
ar: فشل في إنشاء خربشة جديدة
he: יצירת שרבוט חדש נכשלה
zh_tw: 建立試寫區失敗

source: Failed to rename scratch: Names must not include path separator
ar: فشل في إعادة تسمية الخربشة: يجب ألّا تتضمن الأسماء فاصل المسار
he: שינוי שם של שרבוט נכשל: השמות לא יכולים לכלול מפריד נתיבים
zh_tw: 重新命名試寫區失敗：名稱不能包含路徑分隔符

source: Failed renaming scratch.
ar: فشل في إعادة تسمية الخربشة.
he: שינוי שם השרבוט נכשל.
zh_tw: 重新命名試寫區失敗。

# prefix to distinguish scratch tabs
source: scratch:%1
ar: خربشة: %1
he: שרבוט:%1
zh_tw: 試寫區:%1

source: Running %1...
ar: شغّل %1...
he: %1 מופעל…
zh_tw: 正在執行 %1…

source: Process finished with exit code %1.
ar: أنهى الإجراء برمز خروج %1.
he: התהליך נסגר עם קוד היציאה %1.
zh_tw: 行程已完成，結束碼為 %1。

source: Failed to run scratch: %1
ar: فشل في تشغيل الخربشة: %1
he: הרצת השרבוט נכשלה: %1
zh_tw: 執行試寫區失敗：%1

source: Scratchpad lets you quickly run and experiment with code without a full project, and even store todos. Create a new scratch to start.
ar: لوح الخربشة يدعك تشغل وتجرّب الشيفرة بسرعة دون مشروع كامل، وحتى تخزّن الإجراءات التي عليك إتمامها. أنشئ خربشة جديدة للبدء.
he: פנקס השרבוטים מאפשר לך להריץ ניסוי עם קוד ללא תלות במיזם השלם ואפילו לאחסן מטלות. יש ליצור שרבוט חדש כדי להתחיל.
zh_tw: 試寫區讓您快速執行程式碼進行快速實驗，不需要建立完整專案，還讓您可以儲存待辦事項。

# @info:tooltip
source: Command to run this scratch. '$f' will expand to the scratch path.
ar: أمر تشغيل هذه الخربشة. '$f' سيتوسع إلى مسار الخربشة.
he: פקודה להרצת השרבוט הזה. ‚‎$f’ יתחלף בנתיב השרבוט.
zh_tw: 執行此試寫區用的指令。'$f' 會展開成試寫區的路徑。

# @action
source: New Scratch
ar: خربشة جديدة
he: שרבוט חדש
zh_tw: 新增試寫區

# @action
source: Remove Scratch
ar: أزل الخربشة
he: הסרת שרבוט
zh_tw: 移除試寫區

# @action
source: Rename Scratch
ar: أعد تسمية الخربشة
he: שינוי שם שרבוט
zh_tw: 重新命名試寫區

# @action
source: Run Scratch
ar: شغّل الخربشة
he: הרצת שרבוט
zh_tw: 執行試寫區

# @info:placeholder
source: Filter...
ar: رشّح...
he: סינון…
zh_tw: 過濾…

# @title:window
source: Create New Scratch
ar: أنشئ خربشة جديدة
he: יצירת שרבוט חדש
zh_tw: 建立新的試寫區

# @label:textbox
source: Name for scratch file:
ar: اسم لملف الخربشة:
he: שם קובץ השרבוט:
zh_tw: 試寫區檔案名稱：
