Repository: KDE/kdevelop
Catalog: po/*/kdevcustommake.po
Languages: ar

source: Tried include path resolution while another resolution process was still running
ar: حاول إيجاد مسار التضمين بينما عملية إيجاد أخرى ما تزال قيد التشغيل

source: Makefile is missing in folder "%1"
ar: ملف make مفقود في المجلد ”%1“

source: Problem while trying to resolve include paths for %1
ar: مشكلة أثناء محاولة إيجاد مسارات التضمين لـ %1

source: Cached: %1
ar: الخبيئة: %1

source: Filename %1 seems to be malformed
ar: اسم الملف %1 يبدو مشوّهًا

source: Failed to extract new working directory
ar: فشل استخراج دليل العمل الجديد

source: Output was: %1
ar: كان الخرج: %1

source: Recursive make call failed
ar: فشل استدعاء make التكراري

source: The parameter string "%1" does not seem to be valid. Output was: %2.
ar: سلسلة المعاملات ”%1“ لا تبدو صالحة. كان الخرج: %2.

source: The directory "%1" does not exist. Output was: %2.
ar: الدليل ”%1“ غير موجود. كان الخرج: %2.

source: Malformed recursive make call
ar: استدعاء make تكراري مشوّه

source: Could not extract include paths from make output
ar: لم نستطع استخراج مسارات التضمين من خرج make

source: Folder: "%1" Command: "%2" Output: "%3"
ar: المجلد: ”%1“ الأمر: ”%2“ الخرج: ”%3“
