Repository: KDE/kdevelop
Catalog: po/*/kdevlldb.po
Languages: ar, he

source: (running)
ar: (يعمل)
he: (רץ)

# @title:window
source: LLDB Console
ar: طرفية LLDB
he: מסוף LLDB

source: Attempting to execute user command on unsupported LLDB version
ar: محاولة تنفيذ أمر المستخدم على إصدار LLDB غير مدعوم

source: <b>Could not start debugger:</b><br />
ar: <b>لا يمكن بدء المنقّح:</b><br />

source: <b>Error connecting to remote target:</b><br />
ar: <b>خطأ في الاتصال بالهدف البعيد:</b><br />
he: <b>שגיאת חיבור ליעד המרוחק:</b><br />

source: <b>Failed to load core file</b><p>Debugger reported the following error:<p><tt>%1
ar: <b>فشل في تحميل ملف النواة</b><p>أفاد المنقّح بالخطأ التالي:<p><tt>%1

source: <b>Your lldb-mi version is unsupported, as it lacks an essential patch.</b><br/>See https://llvm.org/bugs/show_bug.cgi?id=28026 for more information.<br/>Debugger console will be disabled to prevent crash.<br/>Do you want to continue?
ar: <b>إصدار lldb-mi الذي لديك غير مدعوم، لأنه يفتقر إلى رقعة أساسية.</b><br/>للمزيد من المعلومات راجع https://llvm.org/bugs/show_bug.cgi?id=28026.<br/>ستعطّل طرفية المنقّح لمنع الانهيار.<br/>هل تريد المتابعة؟

source: LLDB Version Unsupported
ar: إصدار LLDB غير مدعوم

source: <b>You need lldb-mi from LLDB 3.8.1 or higher.</b><br />You are using: %1
ar: <b>تحتاج إلى lldb-mi من LLDB 3.8.1 أو أعلى.</b><br />أنت تستخدم: %1

source: Debugger Toolbar
ar: شريط أدوات المنقّح
he: סרגל כלי ניפוי שגיאות

source: Debug a native application in LLDB
ar: نقّح تطبيقًا أصيلًا في LLDB
he: ניפוי שגיאות של יישום מוטמע ב־LLDB

# @title:tab
source: LLDB Configuration
ar: اضبط LLDB
he: הגדרות LLDB

# @title:group
source: Debugger
ar: المنقّح
he: מנפה שגיאות

# @label:chooser
source: Debugger executable:
ar: منفّذ المنقّح:
he: קובץ הפעלת מנפה שגיאות:

# @info:placeholder
source: Override path to lldb-mi executable...
ar: تجاوز المسار إلى منفّذ lldb-mi...
he: דריסת הנתיב לקובץ ההפעלה של lldb-mi…

# @label:textbox
source: Additional arguments:
ar: وسائط إضافية:
he: ארגומנטים נוספים:

# @label:chooser
source: Environment:
ar: البيئة:
he: סביבה:

# @option:check
source: Inherit system environment
ar: ورِّث بيئة النظام
he: קבלת סביבת המערכת בירושה

# @title:group
source: Options
ar: خيارات
he: אפשרויות

# @label:chooser
source: Config script:
ar: نص اضبطي:
he: סקריפט הגדרות:

# @info:placeholder
source: /path/to/lldb/config/script
ar: /مسار/إلى/نص/اضبط/lldb

# @label:listbox
source: Start debugger with:
ar: ابدأ المنقّح بـ:
he: התחלת מנפה שגיאות עם:

# @item:inlistbox start debugger with
source: Application Output
ar: خرج التطبيق
he: פלט יישום

# @item:inlistbox start debugger with
source: LLDB Console
ar: طرفية LLDB
he: מסוף LLDB

# @item:inlistbox start debugger with
source: Frame Stack
ar: مكدس الإطارات
he: מחסנית מסגרות

# @option:check
source: Break on start:
ar: توقّف عند البدء:
he: עצירה עם ההתחלה:

# @title:group
source: Remo&te Debugging
ar: تنقيح &بعيد
he: ניפוי שגיאות מ&רוחק

# @label:textbox
source: Remote server:
ar: الخادوم البعيد:
he: שרת מרוחק:

# @info:placeholder
source: host:port
ar: المضيف:المنفذ
he: מארח:פתחה (host:port)

# @label:textbox
source: Remote work path:
ar: مسار العمل البعيد:
he: נתיב עבודה מרוחק:

# @info:placeholder
source: /path/to/a/on-device/writable/directory
ar: /مسار/إلى/دليل/قابل/للكتابة/على/الجهاز

source: The LLDB version used by your <code>lldb-mi</code> could not be detected.<br />Your <code>lldb-mi</code> sent the following reply to a CLI command <code>version</code>:<br />
he: לא ניתן לזהות את גרסת ה־LLDB שה־<code>lldb-mi</code> שלך משתמש בה.<br />ה־<code>lldb-mi</code> שלך שלח את התגובה הבאה לפקודה <code>version</code> שנשלחה דרך שורת הפקודות:<br />

source: Your <code>lldb-mi</code> must use LLDB version %1 or later.<br />But it is currently using LLDB version %2
he: ה־<code>lldb-mi</code> שלך חייב להשתמש ב־LLDB בגרסה %1 ומעלה.<br />אבל כרגע הוא משתמש ב־LLDB בגרסה %2
