Repository: KDE/kdevelop
Catalog: po/*/kdevclazy.po
Languages: ar, el, zh_tw

source: Clazy
ar: كلازي

# @item level of checks
source: Level 0
ar: المستوى 0
el: Επίπεδο 0
zh_tw: 等級 0

# @item level of checks
source: Level 1
ar: المستوى 1
el: Επίπεδο 1
zh_tw: 等級 1

# @item level of checks
source: Level 2
ar: المستوى 2
el: Επίπεδο 2
zh_tw: 等級 2

# @item level of checks
source: Level 3
ar: المستوى 3
el: Επίπεδο 3
zh_tw: 等級 3

# @item level of checks
source: Manual Level
ar: المستوى اليدوي
el: Χειροκίνητο επίπεδο
zh_tw: 手動等級

source: Very stable checks, 99.99% safe, mostly no false-positives, very desirable.
ar: فحوص مستقرة جدًا، آمنة بنسبة 99.99%، وغالبًا لا تحتوي على إيجابيات كاذبة، ومطلوبة جدًا.
el: Πολύ σταθεροί έλεγχοι, 99.99% ασφαλείς, ως επί το πλείστον χωρίς ψευδοθετικά, πολύ επιθυμητοί.
zh_tw: 非常穩定的檢查，99.99% 安全，基本上沒有誤判成錯誤的狀況，非常令人滿意。

source: The default level. Very similar to level 0, slightly more false-positives but very few.
ar: المستوى **المبدئي**. مشابه جدًا للمستوى 0، إيجابياته الكاذبة أكثر قليلاً ولكنها قليلة جدًا.
el: Το προκαθορισμένο επίπεδο. Αρκετά παρόμοιο με το 0, ελάχιστα ψευδοθετικά.
zh_tw: 預設等級。非常類似等級 0，會稍微多一點誤判為錯誤的情況，但還是很少。

source: Also very few false-positives, but contains noisy checks which not everyone agree should be default.
ar: إيجابياته الكاذبة أيضًا قليلة جدًا، لكنه يحتوي على فحوص مزعجة لا يوافق الجميع على أن تكون **مبدئية**.
el: Επίσης ελάχιστα ψευδοθετικά, αλλά περιέχει ελέγχους με θόρυβο για τους οποίους δεν υπάρχει ομοφωνία ότι πρέπει να είναι προκαθορισμένοι.
zh_tw: 也是很少誤判為錯誤，但包含一些比較混雜而不是所有人都覺得應該預設啟用的檢查。

source: Contains checks with high rate of false-positives.
ar: يحتوي على فحوص ذات معدل عالٍ من الإيجابيات الكاذبة.
el: Περιέχει ελέγχους με υψηλό ποσοστό ψευδοθετικών.
zh_tw: 包含經常誤判為錯誤的檢查。

source: Checks here need to be enabled explicitly, as they don't belong to any level. Checks here are very stable and have very few false-positives.
ar: يجب **تمكين** الفحوص هنا صراحةً، لأنها لا **تنتمي** إلى أي مستوى. هذه الفحوص مستقرة جدًا وإيجابياتها الكاذبة قليلة جدًا.
el: Οι έλεγχοι εδώ πρέπει να ενεργοποιούνται ρητά, καθώς δεν ανήκουν σε κανένα επίπεδο. Οι έλεγχοι εδώ είναι πολύ σταθεροί και έχουν ελάχιστα ψευδοθετικά.
zh_tw: 這裡的檢查需要明確啟用，因為它們不屬於任何等級。這裡的檢查非常穩定且很少誤判為錯誤。

source: Unable to load Clazy checks information from '%1'. Please check your settings.
ar: غير قادر على تحميل معلومات فحوص كلازي من '%1'. **تحقق** من إعداداتك.
el: Αδυναμία φόρτωσης πληροφοριών Clazy ελέγχων από το '%1'. Ελέγξτε τις ρυθμίσεις σας.
zh_tw: 無法從「%1」載入 Clazy 檢查資訊。請檢查您的設定。

# @title:window
source: Enter Name of New Check Set
ar: **أدخل** اسم مجموعة فحص جديدة
el: Εισάγετε το όνομα της νέας σειράς ελέγχου
zh_tw: 輸入新檢查集的名稱

# @label:textbox
source: Name:
ar: الاسم:
el: Όνομα:
zh_tw: 名稱：

# @label:listbox
source: Check set:
ar: مجموعة الفحص:
el: Σειρά ελέγχου:
zh_tw: 檢查集

# @info:tooltip
source: Add check set
ar: **أضف** مجموعة فحص
el: Προσθήκη σειράς ελέγχου
zh_tw: 新增檢查集

# @info:tooltip
source: Clone check set
ar: **انسخ** مجموعة الفحص
el: Κλωνοποίηση σειράς ελέγχου
zh_tw: 建立檢查集複本

# @info:tooltip
source: Remove check set
ar: **أزل** مجموعة الفحص
el: Αφαίρεση σειράς ελέγχου
zh_tw: 移除檢查集

# @info:tooltip
source: Set as default
ar: **عينها** ك**مبدئية**
el: Ορισμός προεπιλογής
zh_tw: 設定為預設

# @info:tooltip
source: Edit name of check set
ar: **عدّل** اسم مجموعة الفحص
el: Επεξεργασία ονόματος σειράς ελέγχου
zh_tw: 編輯檢查集名稱

# @item:inlistbox
source: Custom
ar: مخصص
el: Προσαρμοσμένο
zh_tw: 自訂

# @item:inlistbox
source: Use default (currently: %1)
ar: **استخدم** **المبدئي** (حاليًا: %1)
el: Χρήση προκαθορισμένου: (τρέχων: %1)
zh_tw: 使用預設（目前為：%1）

# @item:inlistbox
source: %1 (default selection)
ar: %1 (التحديد **المبدئي**)
el: %1 (προκαθορισμένη επιλογή)
zh_tw: %1（預設選擇）

# @info:placeholder
source: Search checks...
ar: **ابحث** عن الفحوص...
el: Αναζήτηση ελέγχων...
zh_tw: 搜尋檢查...

# @action:button
source: Reset Checks
ar: **أعد** **ضبط** الفحوص
el: Επαναφορά ελέγχων
zh_tw: 重設檢查

source: Since nothing is selected Clazy will use all checks from levels 0 and 1.
ar: بما أنّه لا **يوجد** شيء محدد، **يستخدم** كلازي جميع الفحوص من المستويين 0 و 1.
el: Επειδή τίποτε δεν επελέγη το Clazy θα χρησιμοποιήσει όλους τους ελέγχους από τα επίπεδα 0 και 1.
zh_tw: 由於什麼都沒有選擇，Clazy 會使用所有等級 0 和等級 1 的檢查。

# @title:group
source: Command Line
ar: سطر الأوامر
el: Γραμμή εντολών
zh_tw: 命令列

# @info:placeholder
source: Search...
ar: **ابحث**...
el: Αναζήτηση...
zh_tw: 搜尋...

# @option:check
source: Break lines
ar: **اكسر** الأسطر
el: Αλλαγή γραμμών
zh_tw: 斷開行數

source: 1 check detected
ar: كشف فحص 1
el: 1 έλεγχος ανιχνεύθηκε
zh_tw: 偵測到 %1 個檢查

# @title:tab
source: Clazy
ar: كلازي

# @title:tab
source: Configure Clazy Settings
ar: **اضبط** إعدادات كلازي
el: Διαμόρφωση ρυθμίσεων Clazy
zh_tw: 調整 Clazy 設定

# @title:group
source: Paths
ar: المسارات
el: Διαδρομές
zh_tw: 路徑

# @info:tooltip
source: Path to clazy-standalone executable.
ar: مسار ملف **تنفيذ** clazy-standalone.
el: Διαδρομή στο εκτελέσιμο clazy-standalone.
zh_tw: clazy-standalone 執行檔的路徑。

# @label:chooser
source: Documentation:
ar: **دليل** التوثيق:
el: Τεκμηρίωση:
zh_tw: 說明文件：

# @info:tooltip
source: Path to clazy documentation directory.
ar: مسار مجلد **دليل** توثيق كلازي.
el: Διαδρομή στον κατάλογο τεκμηρίωσης clazy.
zh_tw: Clazy 說明文件的路徑。

# @option:check
source: Run analysis jobs in parallel
ar: **شغّل** مهام التحليل بالتوازي
el: Παράλληλη εκτέλεση ανάλυσης εργασιών
zh_tw: 平行進行分析工作

# @option:check
source: Use all CPU cores
ar: **استخدم** جميع أنوية وحدة المعالجة المركزية
el: Χρήση όλων των CPU πυρήνων
zh_tw: 使用所有 CPU 核心

# @label:spinbox
source: Maximum number of threads:
ar: العدد الأقصى للخيوط:
el: Μέγιστο πλήθος νημάτων:
zh_tw: 最大執行緒數量：

# @title:group
source: Output
ar: المخرجات
el: Έξοδος
zh_tw: 輸出

# @option:check
source: Hide output view during check
ar: **أخفِ** عرض المخرجات أثناء الفحص
el: Απόκρυψη προβολής εξόδου στον έλεγχο
zh_tw: 檢查時隱藏輸出檢視

# @option:check
source: Verbose output
ar: مخرجات مطولة
el: Αναλυτική έξοδος
zh_tw: 詳細輸出

# @title:tab
source: Checks
ar: الفحوص
el: Έλεγχοι
zh_tw: 檢查

# @title:tab
source: Options
ar: الخيارات
el: Επιλογές
zh_tw: 選項

# @info:tooltip
source: Do not emit warnings for non-Qt files, or in other words, if -DQT_CORE_LIB is missing.
ar: لا **تبعث** تحذيرات لملفات غير Qt، أو بعبارة أخرى، إذا **غابت** -DQT_CORE_LIB.
el: Να μην στέλνονται προειδοποιήσεις για μη-Qt αρχεία, ή με άλλα λόγια, αν το -DQT_CORE_LIB λείπει.
zh_tw: 不要為非 Qt 的檔案（也就是缺乏 -DQT_CORE_LIB 時）產生警告。

# @option:check
source: Only Qt
ar: Qt فقط
el: Μόνο Qt
zh_tw: 僅 Qt

# @info:tooltip
source: Disable checks not compatible with Qt 4.
ar: **عطّل** الفحوص غير المتوافقة مع Qt 4.
el: Απενεργοποίηση ελέγχων που δεν είναι συμβατοί με το Qt 4.
zh_tw: 停用與 Qt 4 不相容的檢查。

# @option:check
source: Qt4 compatible
ar: متوافق مع Qt4
el: Qt4 συμβατό
zh_tw: 與 Qt4 相容

# @info:tooltip
source: For running clazy on Qt itself, optional, but honors specific guidelines.
ar: لتشغيل كلازي على Qt نفسها، **اخترها**، ولكنها **تراعي** إرشادات محددة.
el: Για εκτέλεση clazy στην ίδια την Qt, προαιρετικά, αλλά ακολουθεί ειδικές οδηγίες.
zh_tw: 用來在 Qt 本身上面執行 Clazy 檢查，可選，但使用時會遵從一些指引。

# @option:check
source: Qt developer
ar: مطوّر Qt
el: Qt προγραμματιστής
zh_tw: Qt 開發者

# @info:tooltip
source: For visiting implicit code like compiler generated constructors. None of the built-in checks benefit from this, but can be useful for custom checks.
ar: ل**زيارة** الشفرة الضمنية مثل المُنشئات المُوّلدة بواسطة المصرّف. لا **تستفيد** أي من الفحوص المضمنة من هذا، ولكنه **يمكن** أن **يكون** مفيدًا للفحوص المخصصة.
el: Για επίσκεψη εσωτερικού κώδικα όπως constructors παραγόμενους από το μεταγλωττιστή. Κανένας ενσωματωμένος έλεγχος δεν επωφελείται από αυτό, αλλά μπορεί να χρησιμεύσει για προσαρμοσμένους ελέγχους.
zh_tw: 造訪隱式程式碼，像是編譯器產生的建構子。 沒有內建的檢查有利用它，但有些自訂檢查可能能夠利用它。

# @option:check
source: Visit implicit code
ar: **زُر** الشفرة الضمنية
el: Άνοιγμα εσωτερικού κώδικα
zh_tw: 造訪隱式程式碼

# @info:tooltip
source: Only emit warnings for the current file being compiled and ignore any includes. Useful for performance reasons.
ar: لا **تبعث** تحذيرات إلا للملف الحالي الذي **يجري** تجميعه و**تجاهل** أي تضمينات. مفيد لأسباب متعلقة بالأداء.
el: Να αποστέλλονται προειδοποιήσεις μόνο για το τρέχον αρχείο που μεταγλωττίζεται και να αγνοούνται οποιουδήποτε άλλα συμπεριλαμβάνονται (includes). Χρήσιμο για λόγους απόδοσης.
zh_tw: 只產生目前編譯的檔案的警告，忽略任何引入。 可以用於改善效能。

# @option:check
source: Ignore included files
ar: **تجاهل** الملفات المتضمنة
el: Αγνόηση συμπεριλαμβανόμενων (includes) αρχείων
zh_tw: 忽略引入的檔案

# @label:textbox
source: Header filter:
ar: مُرشح الترويسة:
el: Φίλτρο κεφαλίδας:
zh_tw: 標頭檔過濾器：

# @info:tooltip
source: Regular expression matching the names of the headers to output diagnostics from. Diagnostics from the main file of each translation unit are always displayed.
ar: تعبير منتظم **يُطابق** أسماء الترويسات لإخراج التشخيصات منها. **يُعرض** التشخيص من الملف الرئيسي لكل وحدة ترجمة دائمًا.
el: Κανονικές εκφράσεις που ταιριάζουν τα ονόματα των κεφαλίδων με τα διαγνωστικά εξόδου. Πάντα εμφανίζονται τα διαγνωστικά από το κύριο αρχείο κάθε μεταφραστικής μονάδας.
zh_tw: 用來偵測要輸出診斷的標頭檔的名稱的正則表達式。 各個翻譯單元的主檔案的診斷總是會顯示。

# @option:check
source: Enable all fix-its
ar: **فعّل** جميع التثبيتات
el: Ενεργοποίηση όλων των διορθώσεων
zh_tw: 啟用所有「修正它」

# @info:tooltip
source: Fix-its will be applied to a separate file (for unit-test use only).
ar: **طبق** التثبيتات على ملف منفصل (للاستخدام في اختبارات الوحدة فقط).
el: Οι διορθώσεις θα εφαρμόζονται σε ξεχωριστό αρχείο (μόνο για unit-test).
zh_tw: 「修正它」會被套用到別的檔案上（僅單元測試用）。

# @option:check
source: No-inplace fix-its
ar: تثبيتات غير موضعية
zh_tw: 不使用原地「修正它」功能

source: Please backup your code before fix-its applying. For better results also disable parallel checking, which can lead to multiple fix-it applying for header files.
ar: **احتفظ** بنسخة احتياطية من شفرتك قبل **تطبيق** التثبيتات. للحصول على نتائج أفضل، **عطّل** أيضًا الفحص المتوازي، مما **قد** يؤدي إلى تطبيق تثبيتات متعددة لملفات الترويسة.
el: Κρατήστε εφεδρικό αντίγραφο του κώδικά σας πριν την εφαρμογή των διορθώσεων. Για καλύτερα αποτελέσματα απενεργοποιήστε τους παράλληλους ελέγχους, που μπορεί να οδηγούν σε πολλαπλές διορθώσεις για αρχεία κεφαλίδες.
zh_tw: 請在套用「修正它」之前備份您的程式碼。要取得更好的結果也請停用平行檢查：平行檢查可能會造成多個「修正它」套用到同一個標頭檔上。

# @title:tab
source: Extra Parameters
ar: المعاملات الإضافية
el: Επιπλέον παράμετροι
zh_tw: 額外參數

# @label:textbox
source: Compiler append:
ar: ملحق المصرّف:
el: Προσθήκη στο μεταγλωττιστή:
zh_tw: 編譯器後方額外參數：

# @info:tooltip
source: Additional parameters to append to the compiler command line.
ar: معاملات إضافية **تُلحق** بسطر أوامر المصرّف.
el: Πρόσθετες παράμετροι να προστεθούν στη γραμμή εντολών του μεταγλωττιστή.
zh_tw: 加到編譯器命令列後方的額外參數。

# @label:textbox
source: Compiler prepend:
ar: مُقدمة المصرّف:
el: Προθεματική εισαγωγή στο μεταγλωττιστή:
zh_tw: 編譯器前方額外參數：

# @info:tooltip
source: Additional parameters to prepend to the compiler command line.
ar: معاملات إضافية **تُسبق** سطر أوامر المصرّف.
el: Πρόσθετες παράμετροι να εισαχθούν προθεματικά στη γραμμή εντολών του μεταγλωττιστή.
zh_tw: 加到編譯器命令列前方的額外參數。

# @info:tooltip
source: Additional parameters to clazy-standalone.
ar: معاملات إضافية لـ clazy-standalone.
el: Πρόσθετες παράμετροι στο clazy-standalone.
zh_tw: clazy-standalone 的額外參數。

# @label:textbox
source: Extra parameters:
ar: معاملات إضافية:
el: Επιπλέον παράμετροι:
zh_tw: 額外參數：

source: Clazy Analysis (%1)
ar: تحليل كلازي (%1)
el: Clazy ανάλυση (%1)
zh_tw: Clazy 分析 (%1)

source: Unknown Level
ar: مستوى غير معروف
el: Άγνωστο επίπεδο
zh_tw: 未知等級

source: Failed to start Clazy analysis process.
ar: فشل في **بدء** عملية تحليل كلازي.
el: Αποτυχία εκκίνησης διεργασίας Clazy ανάλυσης.
zh_tw: 無法啟動 Clazy 分析處理程序。

source: Clazy analysis process crashed.
ar: تحطمت عملية تحليل كلازي.
el: Η διεργασία Clazy ανάλυσης κατέρρευσε.
zh_tw: Clazy 分析處理程序崩潰了。

source: Clazy analysis process timed out.
ar: انتهى وقت عملية تحليل كلازي.
el: Ο χρόνος της διεργασίας Clazy ανάλυσης εξέπνευσε.
zh_tw: Clazy 分析處理程序逾時。

source: Write to Clazy analysis process failed.
ar: فشل في **الكتابة** لعملية تحليل كلازي.
el: Αποτυχία εγγραφής στη διεργασία Clazy ανάλυσης.
zh_tw: 寫入 Clazy 分析處理程序失敗。

source: Read from Clazy analysis process failed.
ar: فشل في **القراءة** من عملية تحليل كلازي.
el: Αποτυχία ανάγνωσης από τη διεργασία Clazy ανάλυσης.
zh_tw: 從 Clazy 分析處理程序讀取失敗。

# @title:window
source: Clazy Error
ar: خطأ كلازي
el: Σφάλμα Clazy
zh_tw: Clazy 錯誤

source: clazy-standalone path cannot be detected. Set the path manually if Clazy is already installed.
ar: لا **يمكن** **اكتشاف** مسار clazy-standalone. **عين** المسار يدويًا إذا **كان** كلازي **مثبتًا** بالفعل.
el: Αδυναμία ανίχνευσης της διαδρομής στο clazy-standalone. Ρυθμίστε τη διαδρομή χειροκίνητα αν το Clazy έχει ήδη εγκατασταθεί.
zh_tw: clazy-standalone 路徑無法偵測到。如果的確有安裝 Clazy 則請手動設定路徑。

source: clazy-standalone path is empty.
ar: مسار clazy-standalone فارغ.
el: Η διαδρομή στο clazy-standalone είναι κενή.
zh_tw: clazy-standalone 路徑是空的。

source: clazy-standalone path '%1' does not exists.
ar: مسار clazy-standalone '%1' لا **يوجد**.
el: Η διαδρομή στο clazy-standalone '%1' δεν υπάρχει.
zh_tw: clazy-standalone 路徑「%1」不存在。

source: clazy-standalone path '%1' is not an executable.
ar: مسار clazy-standalone '%1' ليس ملفًا **تنفيذيًا**.
el: Η διαδρομή στο clazy-standalone '%1' δεν είναι εκτελέσιμο.
zh_tw: clazy-standalone 路徑「%1」不是執行檔。

source: Clazy documentation path cannot be detected. Set the path manually if Clazy is already installed.
ar: لا **يمكن** **اكتشاف** مسار **دليل** توثيق كلازي. **عين** المسار يدويًا إذا **كان** كلازي **مثبتًا** بالفعل.
el: Αδυναμία ανίχνευσης της διαδρομής στη Clazy τεκμηρίωση. Ρυθμίστε τη διαδρομή χειροκίνητα αν το Clazy έχει ήδη εγκατασταθεί.
zh_tw: Clazy 說明文件路徑無法偵測到。如果的確有安裝 Clazy 則請手動設定路徑。

source: Clazy documentation path is empty.
ar: مسار **دليل** توثيق كلازي فارغ.
el: Η διαδρομή στην τεκμηρίωση Clazy είναι κενή.
zh_tw: Clazy 說明文件路徑是空的。

source: Clazy documentation path '%1' does not exists.
ar: مسار **دليل** توثيق كلازي '%1' لا **يوجد**.
el: Η διαδρομή '%1' στην τεκμηρίωση Clazy δεν υπάρχει.
zh_tw: Clazy 說明文件路徑「%1」不存在。

source: Clazy documentation path '%1' is not a directory.
ar: مسار **دليل** توثيق كلازي '%1' ليس مجلدًا.
el: Η διαδρομή '%1' στην τεκμηρίωση Clazy δεν είναι κατάλογος.
zh_tw: Clazy 說明文件路徑「%1」不是目錄。
