Repository: KDE/kdevelop
Catalog: po/*/kdevdebuggercommon.po
Languages: ar

# @action:button
source: Attach
ar: أرفق

# @title:window
source: Attach to a Process
ar: إرفاق بعمليّة

# @info:placeholder
source: Search
ar: ابحث

# @info:tooltip
source: Display as List
ar: اعرض كقائمة

# @info:tooltip
source: Display as Tree
ar: اعرض كشجرة

# @item:inlistbox
source: Own Processes
ar: العمليّات الخاصّة

# @item:inlistbox
source: User Processes
ar: عمليّات المستخدم

# @item:inlistbox
source: System Processes
ar: عمليّات النظام

# @item:inlistbox
source: All Processes
ar: كافّة العمليّات

# @title:window
source: Select Core File
ar: اختر ملفًّا لبيانات النظام

source: Invalid executable file name
ar: اسم الملف تنفيذي غير صالح

source: Executable file does not exist
ar: الملف التنفيذي غير موجود

source: Executable is not a file
ar: التنفيذي ليس بملف

source: Executable file is not readable
ar: الملف التنفيذي غير قابل للقراءة

source: Empty core file name
ar: اسم ملف أساسي فارغ

source: Invalid core file name
ar: اسم ملف أساسي غير صالح

source: Core file does not exist
ar: ملف أساسي غير موجود

source: Core is not a file
ar: الأساسي ليس بملف

source: Core file is not readable
ar: ملف أساسي غير قابل للقراءة

# @label:chooser
source: Executable:
ar: الملفّ القابل للتنفيذ:

# @label:chooser
source: Core file:
ar: ملفّ بيانات النظام:

source: Old value: %1
ar: القيمة القديمة: %1

source: New value: %1
ar: القيمة الجديدة: %1

# <b>Internal debugger error</b>
source: <p>The debugger component encountered an internal error while processing the reply from the debugger. Please submit a bug report. The debug session will now end to prevent potential crash
ar: <p>صادفت مكوّنة مصحّح الأخطاء خطأً داخليًّا أثناء معالجة الردّ من مصحّح الأخطاء. من فضلك، قدّم تقرير خطأ. جلسة التصحيح ستُنهَى الآن لمنع ارتطام محتمل.

source: The exception is: %1 The MI response is: %2
ar: الاستثناء هو: %1 استجابة MI هي: %2

# @title:window
source: Internal Debugger Error
ar: خطأ داخليّ في مصحّح الأخطاء

source: Process exited
ar: العمليّة خرجت

source: <b>Could not start debugger.</b><p>Could not run '%1'. Make sure that the path name is specified correctly.
ar: <b>لا أستطيع بدء مصحّح الأخطاء.</b><p>لا أستطيع تشغيل «%1». تأكّد من تعيين اسم المسار بشكل صحيح.

source: Process failed to start
ar: العمليّة فشلت في البدء

source: <b>Debugger crashed.</b><p>The debugger process '%1' crashed.<br>Because of that the debug session has to be ended.<br>Try to reproduce the crash without KDevelop and report a bug.<br>
ar: <b>مصحّح الأخطاء ارتطم.</b><p>عمليّة مصحّح الأخطاء «%1» ارتطمت.<br>بسبب هذا، يجب إنهاء جلسة التصحيح.<br>حاول تكرار الارتطام دون KDevelop وقدّم تقريرًا عن خطأ.<br>

# @title:window
source: Debugger Crashed
ar: مصحّح الأخطاء ارتطم

source: Process crashed
ar: العمليّة ارتطمت

source: A program is already being debugged. Do you want to abort the currently running debug session and continue?
ar: برنامج يُصحَّح أخطاؤه بالفعل. أتريد إجهاض جلسة التصحيح الجارية ومتابعة؟

# @action
source: Examine Core File with %1
ar: افحص ملفّ بيانات النظام باستعمال %1

# @info:whatsthis
source: <b>Examine core file</b><p>This loads a core file, which is typically created after the application has crashed, e.g. with a segmentation fault. The core file contains an image of the program memory at the time it crashed, allowing you to do a post-mortem analysis.</p>
ar: <b>افحص ملفّ بيانات النظام</b><p>هذا يحمّل ملفّ بيانات نظام، الذي يُنشَأ عادةً بعد ارتطام التطبيق، على سبيل المثال مع خطأ تجزئة. ملفّ بيانات النظام يحتوي على صورة لذاكرة البرنامج في وقت الارتطام، يسمح لك بعمل تحليل ما بعد الوفاة.</p>

# @action
source: Attach to Process with %1
ar: أرفق بعمليّة باستعمال %1

# @info:whatsthis
source: <b>Attach to process</b><p>Attaches the debugger to a running process.</p>
ar: <b>أرفق بعمليّة</b><p>يرفق مصحّح الأخطاء بعمليّة جارية.</p>

source: KDevelop (%1) - %2
ar: مطورك (%1) - %2

source: Choose a core file to examine...
ar: اختر ملفّ بيانات نظام لفحصه...

source: Choose a process to attach to...
ar: اختر عمليّة لترفق بها...

source: Not attaching to process %1: cannot attach the debugger to itself.
ar: لا أُرفق بالعمليّة %1: لا أستطيع إرفاق مصحّح الأخطاء بنفسه.

source: Debugger
ar: مصحّح الأخطاء

source: '%1' is not an executable
ar: «%1» ليس ملفًّا قابلاً للتنفيذ

source: Debug core file
ar: صحّح ملفّ بيانات النظام

source: Debug process %1
ar: صحّح العمليّة %1

source: A program is already being debugged. Do you want to abort the currently running debug session and continue with the launch?
ar: برنامج يُصحَّح أخطاؤه بالفعل. أتريد إجهاض جلسة التصحيح الجارية ومتابعة بالتشغيل؟

source: Running program
ar: تشغيل البرنامج

source: Attaching to process %1
ar: إرفاق بالعمليّة %1

source: <b>Could not attach debugger:</b><br />
ar: <b>لا أستطيع إرفاق مصحّح الأخطاء:</b><br />

source: <b>Could not start debugger:</b><br />
ar: <b>لا يمكن بدء المنقّح:</b><br />

source: Examining core file %1
ar: فحص ملفّ بيانات النظام %1

source: Debugger stopped
ar: مصحّح الأخطاء توقّف

source: Application is running
ar: التطبيق جارٍ

source: Application is paused
ar: التطبيق موقوف مؤقّتًا

source: <b>Gdb command sent when debugger is not running</b><br>The command was:<br> %1
ar: <b>أُرسِل أمر Gdb عندما لا يشغّل مصحّح الأخطاء</b><br>الأمر كان:<br> %1

source: <b>Invalid debugger command</b><br>%1
ar: <b>أمر مصحّح أخطاء غير صالح</b><br>%1

source: <b>Failed to load core file:</b><br />
ar: <b>فشل تحميل الملف الأساسي:</b><br />

source: Exited with return code: %1
ar: خرج برمز إرجاع: %1

source: Exited normally
ar: خرج بشكل طبيعيّ

source: 1 command in queue
ar: 0 أمر في الطابور

# Only the 0 and 1 cases need to be translated
source: 1 command being processed by gdb
ar: 0 أمر يعالجه gdb

source: Debugger state: %1
ar: حالة مصحّح الأخطاء: %1

source: Current command class: '%1' Current command text: '%2' Current command original text: '%3'
ar: صنف الأمر الحاليّ: «%1» نصّ الأمر الحاليّ: «%2» نصّ الأمر الأصليّ الحاليّ: «%3»

source: <b>Debugger error:</b><br />
ar: <b>خطأ منقح الأخطاء:</b><br />

source: (running)
ar: (جارٍ)

source: Binary
ar: ثنائيّ

source: Octal
ar: ثمانيّ

source: Decimal
ar: عشريّ

source: Hexadecimal
ar: سداسيّ عشريّ

source: Raw
ar: خام

source: Unsigned
ar: غير مُوقَّع

source: General
ar: عامّ

source: Flags
ar: الأعلام

source: VFP single-word
ar: VFP كلمة واحدة

source: VFP double-word
ar: VFP كلمة مزدوجة

source: VFP quad-word
ar: VFP كلمة رباعيّة

source: Segment
ar: جزء

# @title:menu
source: Format
ar: صيغة

# @title:menu
source: Mode
ar: نمط

# @action:inmenu
source: Update
ar: حدّث

source: Cannot use the tty* or pty* devices. Check the settings on /dev/tty* and /dev/pty* As root you may need to "chmod ug+rw" tty* and pty* devices and/or add the user to the tty group using "usermod -aG tty username".
ar: لا أستطيع استخدام أجهزة tty* أو pty*. افحص الإعدادات على /dev/tty* و/dev/pty* كمستخدم جذر، قد تحتاج إلى «chmod ug+rw» لأجهزة tty* و pty* و/أو أضف المستخدم إلى مجموعة tty باستخدام «usermod -aG tty username».

source: %1 is incorrect terminal name
ar: %1 هو اسم طرفيّة غير صحيح

source: Can't create a temporary file
ar: لا أستطيع إنشاء ملفّ مؤقّت

source: Can't receive %1 tty/pty. Check that %1 is actually a terminal and that it accepts these arguments: %2
ar: لا أستطيع استلام %1 tty/pty. افحص أنّ %1 هو طرفيّة بالفعل وأنّه يقبل هذه الوسائط: %2

# @title:window
source: Debugger Console
ar: صالة مصحّح الأخطاء

# @info:whatsthis
source: <b>Debugger Console</b><p>Shows all debugger commands being executed. You can also issue any other debugger command while debugging.</p>
ar: <b>صالة مصحّح الأخطاء</b><p>اعرض كافّة أوامر مصحّح الأخطاء التي تُنفَّذ. يمكنك أيضًا إصدار أيّ أمر آخر لمصحّح الأخطاء أثناء التصحيح.</p>

# @info:tooltip
source: Repeat last command when hit Return
ar: كرّر الأمر الأخير عند ضغط 'إرجاع'

# @info:tooltip
source: Pause execution of the app to enter debugger commands
ar: أوقف تنفيذ التطبيق مؤقّتًا لإدخال أوامر مصحّح الأخطاء

# @action
source: Show Internal Commands
ar: اعرض الأوامر الداخليّة

# @info:whatsthis
source: Controls if commands issued internally by KDevelop will be shown or not.<br>This option will affect only future commands, it will not add or remove already issued commands from the view.
ar: اضبط هل ستُعرَض الأوامر الصادرة داخليًّا بواسطة مطورك أم لا.<br>هذا الخيار سيؤثّر على الأوامر المستقبليّة فقط، لن يُضِف أو يُزِل الأوامر الصادرة بالفعل من العرض.

# @label:listbox
source: &Command:
ar: الأ&مر:

# @title:window
source: %1 Command Bar
ar: شريط أوامر %1

# @action
source: Interrupt
ar: قاطع

# @action
source: Repeat
ar: كرّر

# @info:tooltip
source: Repeat last sent command when hit <Return>
ar: كرّر آخر أمر أُرسِل عند ضغط <إرجاع>

# @title:window
source: Address Selector
ar: محدّد العنوان

# @action
source: Change &Address
ar: غيّر الع&نوان

# @action
source: &Jump to Cursor
ar: ا&قفز إلى المؤشّر

# @info:whatsthis
source: Sets the execution pointer to the current cursor position.
ar: اضبط مؤشّر التنفيذ على موقع المؤشّر الحاليّ.

# @action
source: &Run to Cursor
ar: ش&غّل إلى المؤشّر

# @info:whatsthis
source: Continues execution until the cursor position is reached.
ar: تابع التنفيذ حتى يُبلَغ موقع المؤشّر.

# @option:check
source: &AT&&T
ar: &نمط AT&&T

# @info:tooltip
source: GDB will use the AT&T disassembly flavor (e.g. mov 0xc(%ebp),%eax).
ar: GDB سيستعمل نمط فكّ التجميع AT&T (مثال: mov 0xc(%ebp),%eax).

# @option:check
source: &Intel
ar: ن&مط Intel

# @info:tooltip
source: GDB will use the Intel disassembly flavor (e.g. mov eax, DWORD PTR [ebp+0xc]).
ar: GDB سيستعمل نمط فكّ التجميع Intel (مثال: mov eax, DWORD PTR [ebp+0xc]).

# @title:menu
source: Disassembly Flavor
ar: نمط فكّ التجميع

# @info:whatsthis
source: <b>Machine code display</b><p>A machine code view into your running executable with the current instruction highlighted. You can step instruction by instruction using the debuggers toolbar buttons of "step over" instruction and "step into" instruction.
ar: <b>عرض شيفرة الآلة</b><p>عرض شيفرة آلة داخل ملفّك القابل للتنفيذ الجاري مع تسليط الضوء على الأمر الحاليّ. يمكنك تخطّي أمر بأمر باستخدام أزرار شريط أدوات مصحّح الأخطاء لـ «تخطَّ أمرًا» و «اخطُ داخل أمر».

# @title:column
source: Address
ar: العنوان

# @title:column
source: Function
ar: الدالّة

# @title:column
source: Instruction
ar: الأمر

# @title:window
source: Disassemble/Registers View
ar: عرض فكّ التجميع/السجلاّت

# @info:tooltip
source: Select the address to disassemble around
ar: اختر العنوان لفكّ التجميع حوله

# @label:listbox
source: Address to disassemble around:
ar: العنوان لفكّ التجميع حوله:
