Repository: KDE/kdevelop
Catalog: po/*/kdevgrepview.po
Languages: ar, he

# @item:inlistbox
source: All Open Files
ar: كل الملفّات المفتوحة
he: כל הקבצים הפתוחים

# @item:inlistbox
source: All Open Projects
ar: كل المشاريع المفتوحة
he: כל המיזמים הפתוחים

# @title:window
source: Find/Replace in Files
ar: اعثر واستبدل في الملفّات
he: איתור/החלפה בקבצים

# @action:button
source: Search...
ar: ابحث...
he: חיפוש…

# @title:window
source: Select Directory to Search in
ar: اختر دليلاً للبحث فيه
he: בחירת תיקייה לחיפוש

source: %2, and %1 more item
ar: %2، وعنصر إضافي واحد
he: %2 ועוד פריט

# @item search result
source: Search "%1" in %2
ar: ابحث "%1" في %2
he: חיפוש אחר „%1” בתוך %2

# @item search result
source: Search "%1" in %2 (at time %3)
ar: ابحث "%1" في %2 (في الوقت %3)
he: חיפוש אחר „%1” בתוך %2 (בזמן %3)

source: Find in Files
ar: البحث في الملفّات
he: איתור בקבצים

source: No files found matching the wildcard patterns
ar: لا ملفّات تطابق أنماط الرموز البديلة
he: אין קבצים שעונים על תבניות תווי ההכללה

source: Captures are not allowed in pattern string
ar: لا يسمح بضم المجموعات في سلسلة النمط
he: אסור לכידות במחרוזת תבנית

source: Searching for <b>%2</b> in one file
ar: أبحث عن <b>%2</b> في ملفّ واحد
he: חיפוש אחר <b>%2</b> בקובץ אחד

source: Collecting files...
ar: أجمع الملفّات...
he: קבצים נאספים…

source: Search aborted
ar: البحث ألغي
he: החיפוש בוטל

source: Failed: %1
ar: فشل: %1
he: נכשל: %1

source: No results found
ar: لا نتائج
he: לא נמצאו תוצאות

source: Grep: %1
ar: جريب: %1

source: Line %1:
ar: السّطر %1:
he: שורה %1:

source: <b>1</b> match
ar: <b>مطابقة واحدة</b>
he: תוצאה <b>1</b>

source: <b>1</b> file
ar: <b>لا شيء</b>
he: קובץ <b>אחד</b>

# %1 is e.g. '4 matches', %2 is e.g. '1 file'
source: <b>%1 in %2</b>
ar: <b>%1 في %2</b>

source: %2: 1 match
ar: %2: %1 مطابقة

source: Failed to replace <b>%1</b> by <b>%2</b> in %3:%4:%5
ar: فشل استبدال <b>%1</b> بـ <b>%2</b> في %3:%4:%5
he: החלפת <b>%1</b> ב־<b>%2</b> ב־%3:%4:%5 נכשלה

# @title:window
source: Find/Replace Output View
ar: عرض خرج البحث/الاستبدال
he: תצוגת פלט איתור/החלפה

# @action
source: &Previous Item
ar: ال&عنصر السّابق
he: הפריט ה&קודם

# @action
source: &Next Item
ar: العنصر ال&تالي
he: הפריט ה&בא

# @action
source: C&ollapse All
ar: ا&طوِ الكل
he: &צמצום של הכול

# @action
source: &Expand All
ar: &وسّع الكل
he: ה&רחבה של הכול

# @action
source: New &Search
ar: &بحث جديد
he: חיפוש &חדש

# @action
source: Refresh
ar: حدّث
he: ריענון

# @action
source: Clear Search History
ar: امحُ تأريخ البحث
he: פינוי היסטוריית החיפוש

source: Do you want to replace with an empty string?
ar: هل تريد الاستبدال بسلسلة فارغة؟
he: להחליף במחרוזת ריקה?

# @title:window
source: Start Replacement
ar: ابدأ الاستبدال
he: התחלת החלפה

# @action:button
source: Replace
ar: استبدل
he: החלפה

# @label:listbox
source: Replacement &text:
ar: النص ال&بديل:
he: &טקסט החלפה:

# @info:tooltip
source: Enter the replacement pattern
ar: أدخل نمط الاستبدال
he: נא למלא את תבנית ההחלפה

# @info:tooltip
source: Apply replacement on selected items
ar: طبّق الاستبدال على العناصر المختارة
he: החלת ההחלפה על הפריטים הנבחרים

# @action:button
source: &Replace
ar: ا&ستبدل
he: ה&חלפה

# @action
source: Find/Replace in Fi&les...
ar: اعثر واستبدل في الملفّات...
he: איתור/החלפה ב&קבצים…

# @info:tooltip
source: Search for expressions over several files
ar: ابحث عن تعابير في عدّة ملفّات
he: חיפוש ביטויים על פני מספר קבצים

# @info:whatsthis
source: Opens the 'Find/Replace in Files' dialog. There you can enter a regular expression which is then searched for within all files in the directories you specify. Matches will be displayed, you can switch to a match directly. You can also do replacement.
ar: يفتح هذا الأمر حوار 'اعثر واستبدل في الملفّات'. هناك، أدخل تعبيراً نمطيًّا سيبحث فيه ضمن جميع الملفّات في الأدلة التي تحدّدها. ستعرض المطابقات، ويمكنك التبديل إلى مطابقة مباشرة. يمكنك إجراء استبدال أيضاً.

# @action:inmenu
source: Find/Replace in This Folder...
ar: اعثر واستبدل في هذا المجلّد...
he: איתור/החלפה בתיקייה הזאת…

# @action:inmenu
source: &Find/Replace in Files...
ar: ا&عثر واستبدل في الملفّات...
he: איתור/החלפה ב&קבצים…

# @info:tooltip
source: Enter the regular expression you want to search for
ar: أدخل التعبير النمطي الذي تريد البحث عنه
he: נא למלא את הביטוי הרגולרי לחיפוש

# @info:whatsthis
source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Enter the regular expression you want to search for here.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">If you do not check "Regular Expression" below, this is considered a raw string. That means, all meta characters are escaped.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Possible meta characters are:</p> <ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">.</span> - Matches any character</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">^</span> - Matches the beginning of a line</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">$</span> - Matches the end of a line</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">\b</span> - Matches a word boundary</li> <li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">\s</span> - Matches any whitespace character</li></ul> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">The following repetition operators exist:</p> <ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">?</span> - The preceding item is matched at most once</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">*</span> - The preceding item is matched zero or more times</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">+</span> - The preceding item is matched one or more times</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">}</span> - The preceding item is matched exactly <span style=" font-style:italic;">n</span> times</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">,}</span> - The preceding item is matched <span style=" font-style:italic;">n</span> or more times</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{,</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">}</span> - The preceding item is matched at most <span style=" font-style:italic;">n</span> times</li> <li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">,</span><span style=" font-weight:600; font-style:italic;">m</span><span style=" font-weight:600;">}</span> - The preceding item is matched at least <span style=" font-style:italic;">n</span>, but at most <span style=" font-style:italic;">m</span> times.</li></ul> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Furthermore, backreferences to bracketed subexpressions are available via the notation \<span style=" font-style:italic;">n</span>.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">For further reference, look at <a href="https://www.pcre.org/"><span style=" text-decoration: underline; color:#0057ae;">www.pcre.org</span></a> or <span style=" font-style:italic;">man pcresyntax.</span></p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">أدخل التعبير النمطي الذي تريد البحث عنه هنا.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">إن لم تشر على "تعبير نمطي" أدناه، سيعتبر سلسلة خام. هذا يعني، أن كل الأحرف الوصفية ستهرب.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">الأحرف الوصفية المحتملة هي:</p> <ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">.</span> - يطابق أي حرف</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">^</span> - يطابق بداية السطر</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">$</span> - يطابق نهاية السطر</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">\b</span> - يطابق حدّ كلمة</li> <li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">\s</span> - يطابق أي حرف مسافة بيضاء</li></ul> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">توجد عوامل التكرار التالية:</p> <ul style="margin-top: 0px; margin-bottom: 0px; margin-left: 0px; margin-right: 0px; -qt-list-indent: 1;"><li style=" margin-top:12px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">?</span> - العنصر السابق يطابق مرة واحدة على الأكثر</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">*</span> - العنصر السابق يطابق صفر أو أكثر من المرات</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">+</span> - العنصر السابق يطابق مرة واحدة أو أكثر</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">}</span> - العنصر السابق يطابق بالضبط <span style=" font-style:italic;">n</span> من المرات</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">,}</span> - العنصر السابق يطابق <span style=" font-style:italic;">n</span> أو أكثر من المرات</li> <li style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{,</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">}</span> - العنصر السابق يطابق <span style=" font-style:italic;">n</span> من المرات على الأكثر</li> <li style=" margin-top:0px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">{</span><span style=" font-weight:600; font-style:italic;">n</span><span style=" font-weight:600;">,</span><span style=" font-weight:600; font-style:italic;">m</span><span style=" font-weight:600;">}</span> - العنصر السابق يطابق <span style=" font-style:italic;">n</span> من المرات على الأقل، و <span style=" font-style:italic;">m</span> من المرات على الأكثر.</li></ul> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">علاوة على ذلك، مراجع خلفية للتعبيرات الفرعية الموضوعة بين قوسين متوفرة عبر الترميز \<span style=" font-style:italic;">n</span>.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">للمزيد من المراجع، انظر <a href="https://www.pcre.org/"><span style=" text-decoration: underline; color:#0057ae;">www.pcre.org</span></a> أو <span style=" font-style:italic;">man pcresyntax.</span></p>

# @label:listbox
source: Template:
ar: القالب:
he: תבנית:

# @info:tooltip
source: This is the regular expression template.
ar: هذا هو قالب التعبير النمطي.
he: זאת תבנית ביטוי רגולרי.

# @info:whatsthis
source: This is the regular expression template. <i>%s</i> will be replaced by the pattern, while <i>%%</i> will be replaced by <i>%</i>.
ar: هذا هو قالب التعبير النمطي. <i>%s</i> سيستبدل بالنمط، بينما <i>%%</i> سيستبدل بـ <i>%</i>.

# @info:tooltip
source: Quickly select location from a set of directories
ar: اختر موقعاً بسرعة من مجموعة من الأدلّة
he: בחירת מקום מסדרה של תיקיות במהירות.

# @action:button
source: Quick Select
ar: اختيار سريع
he: בחירה מהירה

# @label:spinbox
source: Depth:
ar: العمق:
he: עומק:

source: Maximum level of subdirectory recursion
ar: المستوى الأقصى لتداخل الأدلة الفرعية
he: הרמה המרבית של חדירת תת־תיקיות

source: For each search location, descend at most Depth levels of directories. Depth=0 means searching only in files directly inside selected search locations. Full Depth means no recursion limit.
ar: لكل موقع بحث، انزل إلى عمق على الأكثر من مستويات الأدلة. العمق=0 يعني البحث فقط في الملفّات مباشرة داخل مواقع البحث المختارة. عمق كامل يعني لا حدود للتداخل.

# @item full recursion
source: Full
ar: كامل
he: מלא

# @label:listbox
source: Pattern:
ar: النمط:
he: תבנית:

# @label:listbox
source: Files:
ar: الملفات:
he: קבצים:

# @option:check
source: Case sensitive:
ar: حسّاس لحالة الأحرف:
he: תלוי רישיות:

# @info:tooltip
source: Case-sensitive searching.
ar: البحث الحسّاس لحالة الأحرف.
he: חיפוש תלוי רישיות.

# @label:listbox
source: Location(s):
ar: الموقع (المواقع):
he: מקום/מקומות:

# @info:tooltip
source: Files filter
ar: مرشّح الملفّات
he: מסנן קבצים

# @info:whatsthis
source: Enter the file name pattern of the files to search here. You may give several patterns separated by commas or spaces.
ar: أدخل نمط أسماء الملفّات التي تريد البحث فيها هنا. يمكنك إعطاء عدّة أنماط مفصولة بفواصل أو مسافات.

# @label:listbox
source: Exclude:
ar: استثنِ:
he: החרגה:

# @info:tooltip
source: Files pattern to exclude
ar: نمط الملفّات المراد استثناؤها
he: תבנית קבצים להחרגה

# @info:whatsthis
source: Enter the file name pattern of the files to exclude from the search here. You may give several patterns separated by commas or spaces.<p>Every pattern is internally surrounded by asterisks, so that each pattern can match parts of the file paths.</p>
ar: أدخل نمط أسماء الملفّات التي تريد استثناءها من البحث هنا. يمكنك إعطاء عدّة أنماط مفصولة بفواصل أو مسافات.<p>كل نمط محاط داخلياً بعلامات نجميّة، بحيث يمكن لكل نمط أن يطابق أجزاء من مسارات الملفّات.</p>

# @option:check
source: Regular expression:
ar: تعبير نمطي:
he: ביטוי רגולרי:

# @info:tooltip
source: Enable or disable regular expression.
ar: فعّل أو عطّل التعبير النمطي.
he: הפעלה או כיבוי של ביטוי רגולרי.

# @option:check
source: Limit to project files:
ar: حدّد لملفّات المشروع:
he: הגבלה לקובצי מיזם:

# @info:tooltip
source: Enter the replacement template
ar: أدخل قالب الاستبدال
he: מילוי תבנית ההחלפה

# @label:textbox
source: Replacement template:
ar: قالب الاستبدال:
he: תבנית החלפה:

# @info:tooltip
source: Select the location where you want to search. It can be a directory, a file, or a semicolon separated (without spaces) list of directories/files.
ar: اختر الموقع الذي تريد البحث فيه. يمكن أن يكون دليلاً، أو ملفّاً، أو قائمة مفصولة بفاصلة منقوطة (بدون مسافات) من الأدلة/الملفات.

# @info:tooltip
source: Select a directory to search in
ar: اختر دليلاً للبحث فيه
