Repository: KDE/kdevelop
Catalog: po/*/kdevgdb.po
Languages: ar

source: GDB
ar: منقّح غنو GDB

# @title:window
source: Disassemble/Registers
ar: فك التجميع/السجلات

# @title:window
source: Memory
ar: الذاكرة

# @title:window
source: Tracing Configuration
ar: إعداد التتبّع

# @info:whatsthis
source: <b>Custom format string</b> <p>Specify a C-style format string that will be used when printing the chosen expression. For example: <p align="center"> <tt>Tracepoint 1: g = %d</tt></p> If custom format string is not enabled, names and values of all expressions will be printed, using "%d" as format specifier for all expressions.
ar: <b>سلسلة التنسيق المخصصة</b> <p>حدد سلسلة تنسيق على نمط C ستُستخدم عند طباعة التعبير المختار. على سبيل المثال: <p align="center"> <tt>نقطة تتبّع 1: g = %d</tt></p> إذا لَم يُفعّل تنسيق مخصص، فستُطبَع أسماء وقيم كل التعبيرات، باستخدام "%d" كمُحدِّد تنسيق لكل التعبيرات.

# @label
source: Expressions to print:
ar: التعبيرات المراد طباعتها:

# @info:whatthis
source: <b>Enable tracing</b> <p>Tracing is a mechanism to automatically print values of the chosen expressions and continue execution when breakpoint is hit. You can think of it as printf debugging that does not require modifying the source.</p>
ar: <b>فعّل التتبّع</b> <p>التتبّع هو آلية لطباعة قيم التعبيرات المختارة آليًا والاستمرار في التنفيذ عند الوصول إلى نقطة توقف. يُمكِنك اعتبارها طباعة لتصحيح الأخطاء (printf debugging) لا تتطلب تعديل المصدر.</p>

# @option:check
source: Enable tracing
ar: فعّل التتبّع

# @option:check
source: Custom format string
ar: سلسلة تنسيق مخصصة

source: No environment profile specified, looks like a broken configuration, please check run configuration '%1'. Using default environment profile.
ar: لَم تُحدّد تشكيلة بيئة، يبدو أنّ التشكيل معطّل، الرجاء التحقق من تشكيلة التشغيل '%1'. استخدام تشكيلة البيئة المبدئية.

source: <unknown version>
ar: <إصدار مجهول>

source: <b>You need gdb 7.0.0 or higher.</b><br />You are using: %1
ar: <b>تحتاج GDB 7.0.0 أو أعلى.</b><br />أنت تستخدم: %1

source: <b>Could not start debugger:</b><br />
ar: <b>لا يُمكِن بدء المنقّح:</b><br />

source: <b>Failed to load core file</b><p>Debugger reported the following error:<p><tt>%1
ar: <b>فشل تحميل ملف اللُب</b><p>أبلغ المنقّح عن الخطأ التالي:<p><tt>%1

source: Could not locate the debugging shell '%1'.
ar: لا يُمكِن العثور على صدفة التنقيح '%1'.

# @title:tab
source: GDB Configuration
ar: إعداد GDB

source: Executes a native application in GDB
ar: ينفّذ تطبيقًا أصليًا في GDB

# @title:group
source: Debugger
ar: المنقّح

# @label:chooser
source: Debugger e&xecutable:
ar: مُلّف المنقّح التنف&يذي:

# @info:tooltip
source: Gdb executable
ar: ملف GDB التنفيذي

# @info:whatsthis
source: To run "gdb" executable from $PATH, leave this field empty. To run custom gdb, for example, for a different architecture, enter the executable name here. You can either run gdb from $PATH, but with a different name (say, "arm-gdb"), by typing the name here, or specify full path to the gdb executable.
ar: لِتشغيل مُلّف "gdb" التنفيذي من $PATH، اترك هذا الحقل فارغًا. لِتشغيل gdb مخصص، على سبيل المثال، لبنية مختلفة، أدخِل اسم المُلّف التنفيذي هنا. يُمكِنك إمّا تشغيل gdb من $PATH، ولكن باسم مختلف (مثل "arm-gdb")، عن طريق كتابة الاسم هنا، أو تحديد المسار الكامل لمُلّف gdb التنفيذي.

# @info:placeholder
source: Override path to gdb executable...
ar: تجاوز مسار مُلّف gdb التنفيذي...

# @info:tooltip
source: <html><head/><body><p>If you want gdb to be executed by a special shell script, which for example properly sets the library path, insert it here e.g.: /path/to/script.sh --scriptArguments</p><p>Note: your script'll be invoked like this: /path/to/script.sh --scriptArguments debugger --debuggerArguments. So script.sh <span style=" font-weight:600;">must</span> invoke &quot;debugger&quot; executable manually.</p></body></html>
ar: <html><head/><body><p>إذا أردت أن يُنفّذ gdb بواسطة سكربت صدفة خاص، والذي على سبيل المثال يضبط مسار المكتبة بشكل صحيح، أدخِله هنا مثل: /path/to/script.sh --scriptArguments</p><p>ملاحظة: سيُستدعى سكربت الصدفة هكذا: /path/to/script.sh --scriptArguments debugger --debuggerArguments. لذلك <span style=" font-weight:600;">يجب</span> أن يستدعي script.sh المُلّف التنفيذي &quot;debugger&quot; يدويًا.</p></body></html>

# @label:chooser
source: She&ll script:
ar: س&كربت الصدفة:

# @title:group
source: Options
ar: الخيارات

# @option:check
source: Display static &members:
ar: اعرض ال&أعضاء الثابتة:

# @info:whatsthis
source: Displaying static members makes GDB slower in producing data with Qt-based code. It may change the "signature" of the data which QString and friends rely on, but if you need to debug into these values then check this option.
ar: عرض الأعضاء الثابتة يجعل GDB أبطأ في إنتاج البيانات مع شيفرة قائمة على Qt. قد يغيّر "توقيع" البيانات التي يعتمد عليها QString وأصدقاؤه، ولكن إذا كنت تحتاج إلى التنقيح في هذه القيم فحدد هذا الخيار.

# @option:check
source: Display &demangled names:
ar: اعرض الأسماء &مفكوكة التشويه:

# @info:whatthis
source: When displaying the disassembled code you can select to see the methods' mangled names. However, non-mangled names are easier to read.
ar: عند عرض الشيفرة مفكوكة التجميع، يُمكِنك الاختيار لِرؤية أسماء الطرق المشوّهة. ومع ذلك، فإن الأسماء غير المشوّهة أسهل للقراءة.

# @label:listbox
source: S&tart debugger with:
ar: اب&دأ المنقّح بـ:

# @item:inlistbox start debugger with
source: Application Output
ar: مُخرجات التطبيق

# @item:inlistbox start debugger with
source: GDB Console
ar: طرفيّة GDB

# @item:inlistbox start debugger with
source: Frame Stack
ar: رصيف الإطارات

# @info:whatsthis
source: This script is intended for the actual commands needed to connect to a remotely running executable. shell sleep 5 wait for remote program to start target remote ... connect to the remote debugger continue [optional] run debugging to the first breakpoint
ar: هذا السكربت مُخصّص للأوامر الفعلية المطلوبة للاتصال بمُلّف تنفيذي يعمل عن بُعد. shell sleep 5 انتظِر البرنامج البعيد ليبدأ target remote ... اتصل بالمنقّح البعيد continue [اختياري] شَغِّل التنقيح حتى نقطة التوقف الأولى

# @title:group
source: Remote Debugging
ar: تنقيح عن بُعد

# @info:tooltip
source: <html><head/><body><p>Script to start remote application</p><p></p><p>This shell script is run after the Gdb Config script has been sourced by gdb.</p><p>It's purpose is to actually start the remote process.</p><p>1) Find a way to execute a command remotely - rsh, ssh, telnet, ...</p><p>2a) Execute &quot;gdbserver ... application&quot; on target.</p><p>or if your executable contains the gdb stub:</p><p>2b) Execute &quot;application&quot; on target.</p></body></html>
ar: <html><head/><body><p>سكربت لبدء التطبيق البعيد</p><p></p><p>يُشغَّل سكربت الصدفة هذا بعد أن يَصدر سكربت إعداد GDB عن gdb.</p><p>الهدف منه هو البدء الفعلي للعملية البعيدة.</p><p>1) اعثُر على طريقة لِتنفيذ أمر عن بُعد - rsh, ssh, telnet, ...</p><p>2أ) نفّذ &quot;gdbserver ... application&quot; على الهدف.</p><p>أو إذا كان مُلّفك التنفيذي يحتوي على الكعب gdb:</p><p>2ب) نفّذ &quot;application&quot; على الهدف.</p></body></html>

# @label:chooser Shell script to be executed at run time
source: R&un shell script:
ar: س&كربت صدفة التشغيل:

# @info:tooltip
source: This script is sourced by gdb when the debugging starts.
ar: يصدر gdb هذا السكربت عند بدء التنقيح.

# @label:chooser
source: Gdb &config script:
ar: س&كربت إعداد Gdb:

# @info:tooltip
source: <html><head/><body><p>Script to connect with remote application</p><p>For example:</p><p> shell sleep 5 #wait for remote program to start</p><p> target remote ... #connect to the remote debugger</p><p> continue #[optional] run debugging to the first breakpoint.</p></body></html>
ar: <html><head/><body><p>سكربت للاتصال بالتطبيق البعيد</p><p>على سبيل المثال:</p><p> shell sleep 5 #انتظِر البرنامج البعيد ليبدأ</p><p> target remote ... #اتصل بالمنقّح البعيد</p><p> continue #[اختياري] شَغِّل التنقيح حتى نقطة التوقف الأولى.</p></body></html>

# @label:chooser Gdb script to be executed at run time.
source: Run &gdb script:
ar: شَغِّل س&كربت gdb:

# @title:window
source: GDB Output
ar: مُخرجات GDB

# @info:whatsthis
source: <b>GDB output</b><p>Shows all GDB commands being executed. You can also issue any other GDB command while debugging.</p>
ar: <b>مُخرجات GDB</b><p>يعرض كل أوامر GDB الجاري تنفيذها. يُمكِنك أيضًا إصدار أي أمر GDB آخر أثناء التنقيح.</p>

# @label:listbox
source: &GDB command:
ar: أمر &GDB:

# @info:tooltip
source: Pause execution of the app to enter GDB commands
ar: أوقِف تنفيذ التطبيق لِإدخال أوامر GDB

# @action:inmenu
source: Show Internal Commands
ar: اعرض الأوامر الداخلية

# @info:tooltip
source: Controls if commands issued internally by KDevelop will be shown or not.<br>This option will affect only future commands, it will not add or remove already issued commands from the view.
ar: يضبط ما إذا كانت الأوامر الصادرة داخليًا عن KDevelop ستُعرَض أم لا.<br>يؤثر هذا الخيار فقط في الأوامر المستقبلية، لا يُضيف أوامر صدرت بالفعل إلى العرض ولا يُزيلها منه.

# @action:inmenu
source: Copy All
ar: انسخ الكل

source: Debugger Toolbar
ar: شريط أدوات المنقّح

# @label:textbox
source: Start:
ar: البداية:

# @label:textbox
source: Amount:
ar: الكمية:

# @title:window
source: Memory View
ar: عرض الذاكرة

source: %2 (1 byte)
ar: %2 (0 بايت)

# @action::inmenu
source: &Reload
ar: أ&عِد التحميل

# @title:menu
source: &Format
ar: ال&تنسيق

# @item:inmenu display format
source: &Binary
ar: &ثنائي

# @item:inmenu display format
source: &Octal
ar: &ثماني

# @item:inmenu display format
source: &Decimal
ar: &عشري

# @item:inmenu display format
source: &Hexadecimal
ar: &سداسي عشري

# @title:menu
source: &Grouping
ar: ال&تجميع

# @action:inmenu
source: Write Changes
ar: اكتُب التغييرات

# @action:inmenu
source: Change Memory Range
ar: غيِّر نطاق الذاكرة

# @action:inmenu
source: Close View
ar: أغلِق العرض

# @title:window
source: Memory Viewer
ar: عارض الذاكرة

# @action
source: New Memory Viewer
ar: عارض ذاكرة جديد

# @info:tooltip
source: Open a new memory viewer
ar: افتح عارض ذاكرة جديدًا
