Repository: KDE/kdevelop
Catalog: po/*/kdevheaptrack.po
Languages: ar, zh_tw

# @title:tab
source: Configure Heaptrack Settings
ar: اضبط إعدادات Heaptrack
zh_tw: 調整 Heaptrack 設定

# @title:group
source: Executables
ar: الملفات التنفيذية
zh_tw: 執行檔

# @label:chooser
source: Visualizer:
ar: المُصوِّر البصري:
zh_tw: 視覺化工具：

# %1 - process ID
source: PID: %1
ar: مُعرّف العملية: %1

source: Heaptrack Analysis (%1)
ar: تحليل Heaptrack (%1)
zh_tw: Heaptrack 分析 (%1)

# @action
source: Run Heaptrack Analysis
ar: شغِّل تحليل Heaptrack
zh_tw: 執行 Heaptrack 分析

# @action
source: Attach to Process with Heaptrack
ar: أرفِق بالعملية باستعمال Heaptrack
zh_tw: 用 Heaptrack 附加到行程

source: Unable to start Heaptrack analysis - "%1" plugin is not loaded.
ar: غير قادر على بدء تحليل Heaptrack - لم يُحمّل الملحق "%1".
zh_tw: 無法開始 Heaptrack 分析 - 「%1」外掛程式未載入。

source: Configure a native application launch to perform Heaptrack analysis on.
ar: اضبط إطلاق تطبيق أصيل لتنفيذ تحليل Heaptrack عليه.
zh_tw: 設定要進行 Heaptrack 分析的原生應用程式啟動。

source: Heaptrack analysis can be started only for native applications.
ar: يمكن بدء تحليل Heaptrack للتطبيقات الأصيلة فقط.
zh_tw: Heaptrack 分析只能為原生應用程式啟動。

source: Failed to start Heaptrack visualizer from "%1".
ar: فشِل بدء المُصوِّر البصري لـ Heaptrack من "%1".
zh_tw: 無法從「%1」啟動 Heaptrack 視覺化工具。

source: Check your settings and install the visualizer if necessary.
ar: افحص إعداداتك وثبِّت المُصوِّر البصري إن لزِم الأمر.
zh_tw: 請檢查您的設定，需要的時候請安裝視覺化工具。

source: Error during Heaptrack visualizer execution:
ar: خطأ أثناء تنفيذ المُصوِّر البصري لـ Heaptrack:
zh_tw: Heaptrack 視覺化工具執行時發生錯誤：
