Repository: KDE/kdevelop
Catalog: po/*/kdevclang.po
Languages: ar, he, zh_tw

# @title:tab
source: C/C++ Helpers
ar: مساعدات C/C++
he: מסייעי C/C++‎
zh_tw: C/C++ 輔助程式

# @title:tab
source: Configure C/C++ Helpers
ar: اضبط مساعدات C/C++
he: הגדרת מסייעי C/C++‎
zh_tw: 設定 C/C++ 輔助程式

# @title:group
source: Code Completion
ar: إكمال الشّيفرة
he: השלמת קוד
zh_tw: 程式碼自動補完

# @info:tooltip
source: If disabled, macros will not be included in the code completion results. This can improve the responsiveness of code completion in some cases.
ar: إذا عُطّلَت، فلن تُضف الماكروهات إلى نتائج إكمال الشّيفرة. هذا يرفع من استجابة إكمال الشّيفرة في بعض الحالات.
he: אם האפשרות כבויה, תסריטי המאקרו לא יוכללו בתוצאות השלמת הקוד. ההגדרות הזאת יכולה לשפר את זמן התגובה של השלמת קוד בחלק מהמקרים.
zh_tw: 停用時，程式碼補完候補中不會包含巨集。這在某些情況可以改善程式碼補完的效能。

# @option:check
source: Add macros to code completion
ar: أضف ماكروهات إلى إكمال الشّيفرة
he: הוספת תסריטי מאקרו להשלמת קוד
zh_tw: 程式碼補完時包含巨集

# @option:check
source: Enable Look-ahead code completion
ar: مكّن إكمال شيفرة النّظر إلى الأمام
he: הפעלת השלמת קוד לפי הסתכלות קדימה
zh_tw: 啟用向前檢查程式碼補完

# @title:group
source: Assistants
ar: المساعدات
he: עוזרים
zh_tw: 輔助工具

# @option:check
source: Forward declare assistant
ar: مساعدة التّصريح الأماميّ
he: מסייע הכרזה קדימה
zh_tw: 在前宣告助手

source: The clang builtin include path "%1" is invalid (missing cpuid.h header). Try setting the KDEV_CLANG_BUILTIN_DIR environment variable manually to fix this. See also: https://bugs.kde.org/show_bug.cgi?id=393779
ar: مسار تضمين clang المُدْمَج «%1» غير صالح (تضمين التّرويسة cpuid.h مفقود). حاول ضبط متغيّر البيئة KDEV_CLANG_BUILTIN_DIR يدويًا لإصلاح هذا. انظر أيضًا: https://bugs.kde.org/show_bug.cgi?id=393779
he: נתיב ההכללה (include) המובנה ב־clang ‏„%1” הוא שגוי חסרה כותרת cpuid.h). כדאי לנהות להגדיר את משתנה הסביבה KDEV_CLANG_BUILTIN_DIR ידנית כדי לתקן את זה. למידע נוסף: https://bugs.kde.org/show_bug.cgi?id=393779
zh_tw: Clang 內建包含路徑 "%1" 是無效的（缺乏 cpuid.h 標頭）。 請試著手動設定 KDEV_CLANG_BUILTIN_DIR 環境變數來修正此問題。 請參照：https://bugs.kde.org/show_bug.cgi?id=393779

# @action
source: Rename Declaration
ar: أعد تسمية التّصريح
he: שינוי שם ההכרזה
zh_tw: 重新命名宣告

# @action
source: Move into Source
ar: انقل إلى المصدر
he: העברה למקור
zh_tw: 移動到原始碼中

source: Override %1
ar: تجاوز %1
he: דריסת %1
zh_tw: 覆寫 %1

source: Implement %1
ar: طبّق %1
he: מימוש %1
zh_tw: 實作 %1

source: Special
ar: خاصّ
he: מיוחד
zh_tw: 特殊

source: Look-ahead Matches
ar: تطابقات النّظر إلى الأمام
he: תוצאות בהסתכלות קדימה
zh_tw: 向前檢查符合項目

source: Builtin
ar: مُدْمَج
he: מוּבנה
zh_tw: 內建

source: Macros
ar: ماكروهات
he: תסריטי מאקרו
zh_tw: 巨集

source: Abstract Override
ar: تجاوز مُجرَّد
he: דריסה מופשטת

source: Virtual Override
ar: تجاوز افتراضيّ
he: דריסה וירטואלית

source: Implement Function
ar: طبّق الدّالة
he: מימוש פונקציה
zh_tw: 實作函數

source: Update declaration signature
ar: حدّث توقيع التّصريح
he: עדכון חתימת הכרזה
zh_tw: 更新宣告簽章

source: Update definition signature
ar: حدّث توقيع التّعريف
he: עדכון חתימת הגדרה
zh_tw: 更新定義簽章

source: Update declaration signature from: %1 to: %2
ar: حدّث توقيع التّصريح من: %1 إلى: %2
he: עדכון חתימת הכרזה מהחתימה: %1 לחתימה: %2
zh_tw: 更新宣告簽章 從：%1 到：%2

source: Update definition signature from: %1 to: %2
ar: حدّث توقيع التّعريف من: %1 إلى: %2
he: עדכון חתימת הגדרה מהחתימה: %1 לחתימה: %2
zh_tw: 更新定義簽章 從：%1 到：%2

source: Failed to apply changes: %1
ar: فشل تطبيق التّغييرات: %1
he: החלת השינויים נכשלה: %1
zh_tw: 套用變更失敗：%1

source: Adapt Signature
ar: كيّف التّوقيع
he: התאמת חתימה

# @action
source: Rename %1
ar: أعد تسمية %1
he: שינוי השם של %1
zh_tw: 重新命名 %1

source: Create separate definition for %1
ar: أنشئ تعريفًا منفصلاً لـ %1
he: יצירת הגדרה נפרדת עבור %1
zh_tw: 為 %1 建立分別的定義

source: No declaration under cursor
ar: لا تصريح تحت المؤشّر
he: אין הכרזה תחת הסמן
zh_tw: 在游標下沒有宣告

source: No source file available for %1.
ar: لا ملف مصدر متوفّر لـ %1.
he: אין קובץ מקור זמין עבור %1.
zh_tw: %1 沒有可用的原始碼檔案。

source: Failed to update DUChain for %1.
ar: فشل تحديث DUChain لـ %1.
he: עדכון DUChain עבור %1 נכשל.
zh_tw: 更新 %1 的 DUChain 失敗。

source: Declaration lost while updating.
ar: فُقد التّصريح أثناء التّحديث.
he: ההכרזה אבדה בזמן העדכון.
zh_tw: 更新時喪失宣告。

source: Cannot create definition for this declaration.
ar: لا يمكن إنشاء تعريف لهذا التّصريح.
he: לא ניתן ליצור הגדרה להכרזה הזאת.
zh_tw: 無法為此宣告建立定義。

source: No document for %1
ar: لا مستند لـ %1
he: אין מסמך עבור %1
zh_tw: %1 沒有說明文件

source: Insertion failed
ar: فشل الإدراج
he: ההוספה נכשלה
zh_tw: 插入失敗

source: Applying changes failed: %1
ar: فشل تطبيق التّغييرات: %1
he: החלת השינויים נכשלה: %1
zh_tw: 套用變更時失敗：%1

source: Fix-it Hints
ar: تلميحات الإصلاح
he: רמזים לתיקון
zh_tw: 修正提示

source: Insert "%1" at line: %2, column: %3
ar: أدرج «%1» في السّطر: %2، العمود: %3
he: להוסיף את „%1” בשורה: %2, עמודה: %3
zh_tw: 插入 "%1" 於行：%2，欄：%3

source: Replace text at line: %1, column: %2 with: "%3"
ar: استبدل النّص في السّطر: %1، العمود: %2 بـ: «%3»
he: להחליף את הטקסט בשורה: %1, עמודה: %2 ב־: „%3”
zh_tw: 替換位於行：%1，欄：%2 的文字為："%3"

source: Replace "%1" with: "%2"
ar: استبدل «%1» بـ: «%2»
he: להחליף את „%1” ב־: „%2’
zh_tw: 將 "%1" 替換為："%2"

source: Replace multiple lines starting at line: %1, column: %2 with: "%3"
ar: استبدل عدّة أسطر ابتداءً من السّطر: %1، العمود: %2 بـ: «%3»
he: להחליף כמה שורות שנפתחות בשורה: %1, עמודה: %2 ב־:„%3”
zh_tw: 替換從行：%1，欄：%2 開始的多行為："%3"

source: Add #pragma once
ar: أضف #pragma once
he: יש לציין ‎#pragma פעם אחת בלבד
zh_tw: 新增 #pragma once

source: Add macro-based #ifndef/#define/#endif header guard
ar: أضف حارس ترويسة #ifndef/#define/#endif المعتمد على الماكرو
he: יש להוסיף מגני כותרות מבוססי מאקרו כגון ‎#ifndef/#define/#endif
zh_tw: 新增基於巨集的 #ifndef/#define/#endif 標頭防衛

source: Macro %1
ar: الماكرو %1
he: תסריט מאקרו %1
zh_tw: 巨集 %1

source: Function macro
ar: ماكرو دالّة
he: מאקרו של פונקציה
zh_tw: 函數巨集

source: Macro
ar: ماكرو
he: מאקרו
zh_tw: 巨集

# %1: the link to the definition
source: Defined in: %1
ar: مُعرَّف في: %1
he: הוגדר תחת: %1
zh_tw: 定義於：%1

source: Show uses
ar: أظهر الاستخدامات
he: הצגת שימושים
zh_tw: 顯示使用

source: Body:
ar: الجسد:
he: תוכן:
zh_tw: 內文：

source: Add Custom Include Path
ar: أضف مسار تضمين مخصّصًا
he: הוספת נתיב הכללה מותאם אישית
zh_tw: 新增自訂包含路徑

source: Open Project
ar: افتح المشروع
he: פתיחת מיזם
zh_tw: 開啟專案

source: Requested here: %1
ar: مطلوب هنا: %1
he: התקבלה בקשה כאן: %1
zh_tw: 於此要求：%1

source: In included file: %1
ar: في ملف مُضمَّن: %1
he: בקבצים שנכללים: %1
zh_tw: 在包含的檔案：%1

source: Header is not guarded against multiple inclusions
ar: التّرويسة ليست محمية من التّضمينات المتعدّدة
he: הכותרת לא מוגנת מהכללות
zh_tw: 標頭並未為多重包含進行防衛

source: The given header is not guarded against multiple inclusions, either with the conventional #ifndef/#define/#endif macro guards or with #pragma once.
ar: التّرويسة المعطاة ليست محمية من التّضمينات المتعدّدة، إمّا بحراس الماكرو التقليديّ #ifndef/#define/#endif أو بـ #pragma once.
he: הכותרת שסופקה לא מוגנת מהכללות, או עם הגנות המאקרו המקובלות ‎#ifndef/#define/#endif או עם ‎#pragma פעם אחת.
zh_tw: 指定標頭並未為多重包含進行防衛，不論用是常用的 #ifndef/#define/#endif 巨集防衛或是用 #pragma once。

source: Insert '%1'
ar: أدرج «%1»
he: הוספת ‚%1’
zh_tw: 插入 '%1'

source: Forward declare as 'class'
ar: صَرِّح أماميًا كـ «صنف»
he: העברת ההכרזה בתור ‚מחלקה’ (class)
zh_tw: 在前宣告為 'class'

source: Forward declare as 'struct'
ar: صَرِّح أماميًا كـ «بنية»
he: העברת ההכרזה בתור ‚מבנה’ (struct)
zh_tw: 在前宣告為 'struct'

source: <parse error>
ar: <خطأ تحليل>
he: <שגיאת פענוח>
zh_tw: <剖析錯誤>
