Repository: KDE/kdevelop
Catalog: po/*/kdevflatpak.po
Languages: ar, fi, fr, he, it, pl, pt_br, ru, sv, tr, zh_cn

# @action
source: Rebuild Environment
ar: أعِد بناء البيئة
fi: Koosta ympäristö uudelleen
fr: Recompiler l'environnement
he: בניית הסביבה מחדש
it: Rigenera l'ambiente
pl: Przebuduj środowisko
pt_br: Recompilar ambiente
ru: Пересобрать среду
sv: Bygg om omgivning
tr: Ortamı Yeniden Yap
zh_cn: 重建环境

# @info:whatsthis
source: Recompiles all dependencies for a fresh environment.
ar: أعِد تصريف جميع التبعيات للحصول على بيئة جديدة.
fi: Kääntää kaikki riippuvuudet uuteen ympäristöön.
fr: Recompile toutes les dépendances pour un environnement rafraîchi.
he: הידור כל התלויות מחדש לסביבה רעננה.
it: Ricompila tutta le dipendenze per avere un ambiente pulito.
pl: Przebudowuje wszystkie zależności dla świeżego środowiska.
pt_br: Recompila todas as dependências para um ambiente novo.
ru: Пересобирает все зависимости для чистой среды.
sv: Kompilerar om alla beroende för en ny omgivning.
tr: Taze bir ortam için tüm bağımlılıkları yeniden derler.
zh_cn: 为一个新环境重新编译所有依赖。

# @action
source: Export Flatpak Bundle...
ar: صدّر حزمة فلاتباك...
fi: Vie Flatpak-paketti…
fr: Exporter un paquet « Flatpak »…
he: ייצוא מאגד Flatpak…
it: Esporta pacco flatpak...
pl: Wyeksportuj zestaw Flatpaka…
pt_br: Exportar o pacote Flatpak...
ru: Экспорт пакета Flatpak…
sv: Exportera Flatpak-packe
tr: Flatpak Demetini Dışa Aktar…
zh_cn: 导出 Flatpak 包...

# @info:whatsthis
source: Exports the current build into a 'bundle.flatpak' file.
ar: يُصدِّر البنية الحالية إلى ملف 'bundle.flatpak'.
fi: Vie nykyisen kooosteen ”bundle.flatpak”-tiedostoksi.
fr: Exporte la version compilée actuelle dans un fichier « paquet.flatpak ».
he: ייצוא הבנייה הנוכחית לקובץ ‚bundle.flatpak’.
it: Esporta i contenuti generati in un file «bundle.flatpak».
pl: Eksportuje bieżącą budowę do pliku 'bundle.flatpak'.
pt_br: Exporta a compilação atual para um arquivo 'bundle.flatpak'.
ru: Экспортирует текущую сборку в файл «bundle.flatpak».
sv: Exporterar nuvarande bygge till filen 'bundle.flatpak'.
tr: Geçerli yapıyı bir “bundle.flatpak” dosyasına dışa aktarır.
zh_cn: 将当前构造导出为一个“bundle.flatpak”文件

# @action
source: Send to Device...
ar: أرسِل إلى الجهاز...
fi: Lähetä laitteeseen…
fr: Envoyer vers un périphérique…
he: שליחה למכשיר…
it: Invia al dispositivo...
pl: Wyślij na urządzenie…
pt_br: Enviar para o dispositivo...
ru: Отправить на устройство...
sv: Skicka till enhet...
tr: Aygıta Gönder…
zh_cn: 发送到设备...

# @title:window
source: Export %1
ar: صدّر %1
fi: Vie %1
fr: Exporter %1
he: ייצוא %1
it: Esportazione di %1
pl: Wyeksportuj %1
pt_br: Exportar %1...
ru: Экспорт %1
sv: Exporterar %1
tr: Dışa Aktar: %1
zh_cn: 导出 %1

source: Flatpak Bundle (*.flatpak)
ar: حزمة فلاتباك (*.flatpak)
fi: Flatpak-paketti (*.flatpak)
fr: Paquet Flatpak (*.flatpak)
he: מאגד Flatpak‏ (‎*.flatpak)
it: Pacco Flatpak (*.flatpak)
pl: Zestaw Flatpaka (*.flatpak)
pt_br: Pacote Flatpak (*.flatpak)
ru: Пакет Flatpak (*.flatpak)
sv: Flagpak-packe (*.flatpak)
tr: Flatpak demeti (*.flatpak)
zh_cn: Flatpak 包 (*.flatpak)

# %1 - application ID
source: Flatpak Export Bundle %1
ar: تصدير حزمة فلاتباك %1
fi: Flatpak-vientipaketti %1
fr: Paquet d'exportation du Flatpak %1
he: ייצוא מאגד %1 מ־Flatpak
it: Esportazione pacco Flatpak %1
pl: Zestaw eksportowy Flatpaka %1
pt_br: Pacote de exportação Flatpak %1
sv: Flatpak-exportpacke %1
tr: Flatpak: Demeti dışa aktar: %1
zh_cn: Flatpak 导出包 %1

# @action:inmenu
source: Rebuild Flatpak Environment: %1
ar: أعِد بناء بيئة فلاتباك: %1
fi: Koosta Flatpak-ympäristö uudelleen: %1
fr: Recompiler l'environnement pour Flatpak : %1
he: בניית סביבת Flatpak מחדש: %1
it: Rigenera l'ambiente Flatpak: %1
pl: Przebuduj środowisko Flatpaka: %1
pt_br: Recompilar ambiente Flatpak: %1
sv: Bygg om Flatpak-omgivning: %1
tr: Flatpak Ortamını Yeniden Yap: %1
zh_cn: 重建 Flatpak 环境：%1

# @action:inmenu
source: Build Flatpak Environment %1 for %2
ar: ابنِ بيئة فلاتباك %1 من أجل %2
fi: Koosta Flatpak-ympäristö %1 koneelle %2
fr: Compiler l'environnement %1 de Flatpak pour %2
he: בניית סביבת Flatpak‏ %1 עבור %2
it: Genera l'ambiente Flatpak %1 per %2
pl: Zbuduj środowisko Flatpaka %1 dla %2
pt_br: Compilar o ambiente Flatpak %1 para %2
sv: Bygg Flatpak-omgivning %1 för %2
tr: %2 için %1 Flatpak Ortamını Yeniden Yap
zh_cn: 为 %2 建造 Flatpak 环境 %1

# @title:window
source: Choose Tag Name
ar: اختر اسم الوسم
fi: Valitse luokitusnimi
fr: Choisir un nom d'étiquette
he: בחירת שם תגית
it: Scegli il nome del tag
pl: Wybierz nazwę znacznika
pt_br: Escolher o nome da marca
ru: Выбор названия метки
sv: Välj etikettnamn...
tr: Etiket Adı Seç
zh_cn: 选择标签名称

# @label:textbox
source: Device hostname:
ar: اسم مُضيف الجهاز:
fi: Laitteen konenimi:
fr: Nom d'hôte du périphérique :
he: שם המארח של המכשיר:
it: Nome host del dispositivo:
pl: Nazwa gospodarza urządzenia:
pt_br: Nome do dispositivo:
ru: Название узла устройства:
sv: Enhetens värddatornamn
tr: Aygıt makine adı:
zh_cn: 设备主机名：

# @title:window
source: Flatpak
ar: فلات باك

# %1 - application ID or name
source: Flatpak Create %1
ar: فلاتباك أنشِئ %1
fi: Flatpak – Luo %1
fr: Création du Flatpak %1
he: ‏Flatpak יצירת %1
it: Creazione Flatpak %1
pl: Utwórz Flatpaka %1
pt_br: Criar Flatpak %1
sv: Flatpak skapa %1
tr: Flatpak: Oluştur: %1
zh_cn: Flatpak 创建 %1

# %1 - application ID
source: Flatpak Finalize %1
ar: فلاتباك أنهِ %1
fi: Flatpak – Viimeistele %1
fr: Finaliser le Flatpak %1
he: ‏Flatpak סיום %1
it: Completamento Flatpak %1
pl: Ukończ Flatpaka %1
pt_br: Finalizar Flatpak %1
sv: Flatpak slutför %1
tr: Flatpak: Finalize et: %1
zh_cn: Flatpak 完成 %1

# %1 - application ID
source: Flatpak Export %1
ar: فلاتباك صدّر %1
fi: Flatpak-vienti %1
fr: EXportation du Flatpak %1
he: ‏Flatpak ייצוא %1
it: Esportazione Flatpak %1
pl: Wyeksportuj Flatpaka %1
pt_br: Exportar Flatpak %1
sv: Flatpak exportera %1
tr: Flatpak: Dışa aktar: %1
zh_cn: Flatpak 导出 %1

# %1 - application ID
source: Flatpak Bundle %1
ar: حزمة فلاتباك %1
fi: Flatpak-paketti %1
fr: Paquet Flatpak %1
he: מאגד Flatpak %1
it: Generazione pacco Flatpak %1
pl: Zestaw Flatpaka %1
pt_br: Empacotar Flatpak %1
sv: Flatpak-packe %1
tr: Flatpak: Demet yap: %1
zh_cn: Flatpak 包 %1

# %1 - application ID, %2 - device host name
source: Flatpak Run %1 on %2
ar: فلاتباك شغّل %1 على %2
fi: Flatpak-suoritus %1 koneella %2
fr: Lancer le Flatpak %1 sur %2
he: הרצת Flatpak‏ %1 על %2
it: Esecuzione Flatpak %1 su %2
pl: Wykonaj Flaptaka %1 na %2
pt_br: Executar Flatpak %1 em %2
sv: Flatpak kör %1 på %2
tr: Flatpak: %1 uygulamasını %2 üzerinde çalıştır
zh_cn: Flatpak 运行 %1 在 %2 上

# %1 - device host name
source: Transfer .flatpak to %1
ar: انقُل .flatpak إلى %1
fi: Lähetä .flatpak koneelle %1
fr: Transfert du fichier « .flatpak » vers %1
he: העברת ‎.flatpak אל %1
it: Trasferimento file .flatpak su %1
pl: Przenieś .flatpak na %1
pt_br: Transferir .flatpak para %1
sv: Överför .flatpak till %1
tr: .flatpak dosyasını %1 konumuna taşı
zh_cn: 传输 .flatpak 到 %1

# %1 - device host name
source: Transfer replicate.sh to %1
ar: انقُل replicate.sh إلى %1
fi: Lähetä replicate.sh koneelle %1
fr: Transférer le ficher « replicate.sh » vers %1
he: העברת replicate.sh אל %1
it: Trasferimento di replicate.sh su %1
pl: Przenieś replicate.sh na %1
pt_br: Transferir replicate.sh para %1
sv: Överför replicate.sh till %1
tr: replicate.sh dosyasını %1 konumuna taşı
zh_cn: 传输 replicate.sh 到 %1

# %1 - application ID, %2 - device host name
source: Flatpak Install %1 to %2
ar: فلاتباك ثبّت %1 على %2
fi: Flatpak-asennus %1 koneelle %2
fr: Installation du Flatpak de %1 vers %2
he: התקנת ה־Flatpak‏ %1 אל %2
it: Installazione Flatpak %1 su %2
pl: Wgraj Flaptaka %1 na %2
pt_br: Instalar Flatpak %1 para %2
sv: Flatpak installera %1 på %2
tr: Flatpak: %1 uygulamasını %2 konumuna kur
zh_cn: Flatpak 安装 %1 到 %2 上

# @action:inmenu
source: Build Flatpak %1 for %2
ru: Собрать Flatpak %1 для %2

source: Bundling
ru: Пакетирование

source: Run on Device
ru: Запустить на устройстве
