Repository: KDE/kdevelop
Catalog: po/*/kdevninja.po
Languages: ar, eu, zh_tw

source: Unable to find ninja executable. Is it installed on the system?
ar: غير قادر على إيجاد منفَّذ نينجا. أهو مثبَّت على حاسوبك؟
eu: Ezin du ninja exekutagarria aurkitu. Zure sisteman instalatuta dago?
zh_tw: 找不到 ninja 執行檔。您確定有安裝它嗎？

source: Cannot specify prefix in %1, on ninja
ar: لا أستطيع تحديد بادئة في %1، على نينجا
eu: Ezin da %1(e)an, ninjan, aurrizkia zehaztu
zh_tw: 無法在 ninja 上於 %1 中指定前置詞

# @title:tab
source: Ninja
ar: نينجا

# @title:tab
source: Configure Ninja settings
ar: اضبط إعدادات نينجا
eu: Konfiguratu Ninja-ren ezarpenak
zh_tw: 設定 Ninja 選項

# @option:check
source: &Display commands but do not execute them:
ar: &اعرض الأوامر ولكن لا تنفذها:
eu: E&rakutsi komandoak baina ez exekutatu:
zh_tw: 顯示指令但不實際執行它們(&D)：

# @option:check
source: Install as &root:
ar: ثبّت بصلاحيات &الجذر:
eu: Instalatu &root gisa:
zh_tw: 以 root 安裝(&R)：

# @label:textbox
source: Root installation &command:
ar: &أمر التثبيت بصلاحيات الجذر:
eu: Root gisa instalatzeko &komandoa:
zh_tw: Root 安裝指令(&C)：

# @label:spinbox
source: &Number of simultaneous jobs:
ar: &عدد المهام المتزامنة:
eu: Aldi bereko lan ko&purua:
zh_tw: 同時進行的工作數量(&N)：

# @label:spinbox
source: Count of &errors to be tolerated:
ar: &عدد الأخطاء المسموح بها:
eu: Onartu beharreko erroreen kopurua:
zh_tw: 允許錯誤數量(&E)：

# @label:textbox
source: Additional ninja &options:
ar: &خيارات نينجا إضافية:
eu: Ninja-&aukera gehigarriak:
zh_tw: Ninja 額外設定(&O)：

# @label:chooser
source: Active environment &profile:
ar: &تشكيلة البيئة النشطة:
eu: Ingurune aktoboaren &profila:
zh_tw: 作用中的環境設定檔(&P)：

# @option:check
source: O&verride number of jobs:
ar: &تجاوز عدد المهام:
eu: Gaine&zarri lan kopurua:
zh_tw: 覆寫工作數量(&V)：

source: Ninja
ar: نينجا

source: Ninja (%1): %2
ar: نينجا (%1): %2

source: Ninja (%1)
ar: نينجا (%1)
