Repository: KDE/kdevelop
Catalog: po/*/kdevqmljs.po
Languages: ar, he

source: Choose the Location
ar: اختر الموقع
he: בחירת המקום

source: Name:
ar: الاسم:
he: שם:

source: Path:
ar: المسار:
he: נתיב:

source: &Class name:
ar: ا&سم الصنف:
he: &שם מחלקה:

source: &Base class:
ar: ا&لصنف الأساسي:
he: &מחלקת יסוד:

source: &Type information:
ar: م&علومات النوع:
he: &פרטי טיפוס:

source: None
ar: لا شيء
he: ללא

source: Inherits QObject
ar: يرث كائن QObject
he: ירושה מ־QObject

source: Inherits QWidget
ar: يرث ويدجت QWidget
he: ירושה מ־QWidget

source: Inherits QDeclarativeItem - Qt Quick 1
ar: يرث بند QDeclarativeItem - كويك كيو تي 1
he: ירושה מ־QDeclarativeItem ‏- Qt Quick 1

source: Inherits QQuickItem - Qt Quick 2
ar: يرث بند QQuickItem - كويك كيو تي 2
he: ירושה מ־QQuickItem ‏- Qt Quick 2

source: Based on QSharedData
ar: يعتمد على QSharedData
he: מבוסס על QSharedData

source: &Header file:
ar: ملف الر&أسية:
he: קובץ &כותרת:

source: &Source file:
ar: ملف ا&لمصدر:
he: קובץ מ&קור:

source: &Generate form:
ar: أ&نشئ استمارة:
he: יצירת &טופס:

source: &Form file:
ar: ملف ا&لاستمارة:
he: קובץ טופ&ס:

source: &Path:
ar: ال&مسار:
he: &נתיב:

source: Introduction and Project Location
ar: مقدمة وموقع المشروع
he: היכרות ומקום מיזם

source: Create in:
ar: أنشئ في:
he: יצירה תחת:

source: Use as default project location
ar: استخدم كموقع مشروع مبدئي
he: שימוש כמקום ברירת המחדל למיזמים

source: Project:
ar: المشروع:
he: מיזם:

source: Possible type mismatch between the argument type (%1) and the value passed as argument (%2)
ar: تباين محتمل في النوع بين نوع الوسيط (%1) والقيمة التي مررَت كوسيط (%2)
he: חוסר התאמת טיפוס בין טיפוס הארגומנט (%1) והערך שהועבר כארגומנט (%2)

source: Module not found, some types or properties may not be recognized
ar: الوحدة غير موجودة، قد لا يتعرف على بعض الأنواع أو الخاصيات
he: לא נמצא מודול, חלק מהטיפוסים או המאפיינים כנראה לא מוכרים

source: Mismatch between the value type (%1) and the property type (%2)
ar: تباين بين نوع القيمة (%1) ونوع الخاصية (%2)

source: Error loading QML file: %1
ar: حدث خطأ عند تحميل ملف QML: %1

source: Duration in milliseconds
ar: المدة بالملّي ثانية

# example text to test a font
source: The lazy dog jumps over<br>the quick brown fox.
ar: الكلب الكسول يقفز فوق<br>الثعلب البني السريع.

source: Font family
ar: عائلة الخط

source: Font size
ar: حجم الخط

source: Height of an item in pixels
ar: ارتفاع بند بالبكسلات

source: Opacity of an item
ar: شفافية بند

source: Spacing between items
ar: التباعد بين البنود

source: Width of an item in pixels
ar: عرض بند بالبكسلات
