Repository: KDE/kdevelop
Catalog: po/*/kdevexecute.po
Languages: ar, he

source: There is a quoting error in the arguments for the launch configuration '%1'. Aborting start.
ar: يوجد خطأ اقتباس في معاملات ضبط الإطلاق '%1'. أوقف البدء.

source: A shell meta character was included in the arguments for the launch configuration '%1', this is not supported currently. Aborting start.
ar: ضمّنت علامة ميتا خاصّة بالصدفة في معاملات ضبط الإطلاق '%1'، هذا غير مدعوم حالياً. أوقف البدء.

source: Couldn't resolve the dependency: %1
ar: تعذّر حل الاعتمادية: %1
he: לא ניתן לפתור את התלות: %1

source: No valid executable specified
ar: لم يحدد ملف تنفيذي صالح

source: There is a quoting error in the executable for the launch configuration '%1'. Aborting start.
ar: يوجد خطأ اقتباس في الملف التنفيذي لضبط الإطلاق '%1'. أوقف البدء.

source: A shell meta character was included in the executable for the launch configuration '%1', this is not supported currently. Aborting start.
ar: ضمّنت علامة ميتا خاصّة بالصدفة في الملف التنفيذي لضبط الإطلاق '%1'، هذا غير مدعوم حالياً. أوقف البدء.

# @item:inlistbox
source: Ask If Running
ar: اسأل إن شغلته
he: לשאול אם רץ

# @item:inlistbox
source: Kill All Instances
ar: اقتل كل النّسخ
he: לחסל את כל המופעים

# @item:inlistbox
source: Start Another
ar: ابدأ آخر
he: להתחיל חדש

# @title:tab
source: Configure Native Application
ar: اضبط التطبيق الأصيل
he: הגדרת יישום טבעי

source: Executes Native Applications
ar: يشغّل تطبيقات أصيلة
he: הפעלת יישומים טבעיים

source: Native Application
ar: تطبيق أصيل
he: יישום טבעי

source: Compiled Binary
ar: ثنائي مجمّع
he: בינרי מהודר

# @title:menu
source: Project Executables
ar: الملفات التنفيذية للمشروع
he: קובצי הפעלה של המיזם

# @title:group
source: Executable
ar: تنفيذي
he: קובץ הפעלה

# @label:chooser
source: Project &target:
ar: &هدف المشروع:
he: י&עד מיזם:

# @label:chooser
source: E&xecutable:
ar: &تنفيذي:
he: קובץ ה&פעלה:

# @info:placeholder
source: executable or /path/to/executable
ar: ملف تنفيذي أو ‎/مسار/إلى/ملف/تنفيذي
he: קובץ הפעלה או /נתיב/לקובץ/הפעלה

# @info:tooltip
source: Enter the executable name or the absolute path to the executable file
ar: أدخل اسم الملف التنفيذي أو المسار المطلق لملف الملف التنفيذي
he: נא למלא את שם קובץ ההפעלה או את הנתיב המלא לקובץ הפעלה

# @title:group
source: Behavior
ar: السّلوك
he: התנהגות

# @label:textbox
source: Ar&guments:
ar: ال&معاملات:
he: &ארגומנטים:

# @info:tooltip
source: <html><head/><body><p>Enter arguments to give to the executable.<br/>You can pass arguments containing space characters by putting them in double-quotes.</p></body></html>
ar: <html><head/><body><p>أدخل المعاملات التي ستقدّمها للملف التنفيذي.<br/>يمكنك تمرير المعاملات التي تحتوي على مسافات بوضعها بين علامتي اقتباس مزدوجتين.</p></body></html>
he: <html><head/><body><p>נא למלא ארגומנטים שיועברו לקובץ ההפעלה.<br/>אפשר להעביר ארגומנטים שמכילים רווח על ידי תחימתם במירכאות כפולות.</p></body></html>

# @label:chooser
source: Working &directory:
ar: &دليل العمل:
he: תיקיית &עבודה:

# @info:tooltip
source: Select a working directory for the executable
ar: اختر دليل عمل للملف التنفيذي
he: נא לבחור תיקיית עבודה לקובץ ההפעלה

# @label:chooser
source: E&nvironment:
ar: ال&بيئة
he: &סביבה:

# @info:tooltip
source: Select an environment to be used
ar: اختر بيئة للاستخدام
he: נא לבחור סביבה לשימוש

# @info:tooltip
source: <p>By default applications will be run in the background and only their output will be displayed in a tool view. This makes it impossible to interact with applications requiring user input from a terminal emulator. To run such applications, you should use an external terminal.</p>
ar: <p>مبدئياً، شغّل التطبيقات في الخلفية واعرض ناتجها فقط في عرض أداة. هذا يجعل التفاعل مع التطبيقات التي تتطلب إدخال المستخدم من محاكي طرفية مستحيلاً. لتشغيل مثل هذه التطبيقات، استخدم طرفية خارجية.</p>
he: <p>כברירת מחדל יישומים ירוצו ברקע ורק הפלט שלהם יוצג בתצוגת כלי. המצב הזה לא מאפשר תפעול יישומים שדורשים קלט משתמש במדמה מסוף. כדי להריץ יישומים כאלה, יש להשתמש במסוף חיצוני.</p>

# @option:check
source: Use external terminal:
ar: استخدم طرفية خارجية:
he: להשתמש במסוף חיצוני:

# @info:tooltip
source: <p>Defines the command to execute the external terminal emulator. Use the following placeholders:</p> <dl> <dt><code>%exe</code></dt> <dd>The path to the executable selected above.</dd> <dt><code>%workdir</code></dt> <dd>The path to the working directory selected above.</dd> </dl> <p>The arguments defined above will get appended to this command.</p>
ar: <p>عرّف الأمر لتنفيذ محاكي الطرفية الخارجي. استخدم العلامات التالية:</p> <dl> <dt><code>%exe</code></dt> <dd>مسار الملف التنفيذي الذي اخترته أعلاه.</dd> <dt><code>%workdir</code></dt> <dd>مسار دليل العمل الذي اخترته أعلاه.</dd> </dl> <p>المعاملات المعرّفة أعلاه ستلحق بهذا الأمر.</p>

# @label:listbox
source: Restart
ar: أعد التّشغيل
he: הפעלה מחדש

# @title:group
source: Dependencies
ar: الاعتماديّات
he: תלויות

# @label:listbox
source: Act&ion:
ar: الإج&راء:
he: &פעולה:

# @info:tooltip
source: Specifies the action to take for the dependencies before starting the executable.
ar: يحدّد الإجراء الذي نفّذه للاعتماديّات قبل بدء الملف التنفيذي.
he: ציון הפעולה שתינקט עבור התלויות בטרם הרצת קובץ ההפעלה.

# @info:whatsthis
source: The selected action will be run before the executable is started. This allows there to be parts of a project, upon which the executable does not directly depend, to be built and/or installed before running the application.
ar: شغّل الإجراء المختار قبل بدء الملف التنفيذي. هذا يسمح ببناء و/أو تثبيت أجزاء من مشروع، لا يعتمد عليها الملف التنفيذي مباشرةً، قبل تشغيل التطبيق.
he: הפעולה הבאה תרוץ לפני הרצת קובץ ההפעלה. כך מתאפשרים כמה חלקים של מיזם, שקובץ ההפעלה לא תלוי בהם ישירות, לבנייה ו/או להתקנה בטרם הרצת היישום.

# @item:inlistbox dependency action
source: Do Nothing
ar: لا تفعل شيئًا
he: לא לעשות כלום

# @item:inlistbox dependency action
source: Build
ar: البناء
he: לבנות

# @item:inlistbox dependency action
source: Build and Install
ar: ابنِ وثبّت
he: לבנות ולהתקין

# @label:chooser
source: Targets:
ar: الأهداف:
he: יעדים:

source: No environment profile specified, looks like a broken configuration, please check run configuration '%1'. Using default environment profile.
ar: لم يحدد تشكيلة بيئة، يبدو أن الضبط مكسور، يرجى فحص ضبط التشغيل '%1'. استخدم تشكيلة البيئة المبدئية.
he: לא צוין פרופיל סביבה, זה נראה כמו הגדרות פגומות, נא להריץ בדיקה על ההגדרות ‚%1’. עוברים להשתמש בפרופיל סביבה כברירת מחדל.

# @title:window
source: Job Already Running
ar: المهمّة قيد التشغيل بالفعل
he: המשימה כבר פעילה

source: '%1' is already being executed.
ar: ينفّذ '%1' بالفعل.
he: הפקודה ‚%1’ כבר רצה.

# @action:button
source: Kill All Instances
ar: اقتل كل النّسخ
he: לחסל את כל המופעים

# @action:button
source: Start Another
ar: ابدأ آخر
he: להתחיל חדש

# @option:check
source: Remember choice
ar: تذكر الاختيار
he: לזכור את הבחירה
