Repository: KDE/kdevelop
Catalog: po/*/kdevclangtidy.po
Languages: ar, he

source: Clang-Tidy
ar: كلانج-تايدي

# @info:placeholder
source: Search...
ar: ابحث...
he: חיפוש…

# @item
source: All checks
ar: كل الفحوص
he: כל הבדיקות

# @title:window
source: Enter Name of New Check Set
ar: أدخل اسم مجموعة الفحص الجديدة
he: נא למלא שם לסדרת הבדיקות החדשה

# @label:textbox
source: Name:
ar: الاسم:
he: שם:

# @label:listbox
source: Check set:
ar: مجموعة الفحص:
he: סדרת בדיקות:

# @info:tooltip
source: Add check set
ar: أضف مجموعة فحص
he: הוספת סדרת בדיקות

# @info:tooltip
source: Clone check set
ar: انسخ مجموعة الفحص
he: שכפול סדרת בדיקות

# @info:tooltip
source: Remove check set
ar: أزل مجموعة الفحص
he: הסרת סדרת בדיקות

# @info:tooltip
source: Set as default
ar: اضبط كمبدئي
he: הגדרה כברירת מחדל

# @info:tooltip
source: Edit name of check set
ar: حرر اسم مجموعة الفحص
he: עריכת שם ערכת הבדיקות

# @item:inlistbox
source: Custom
ar: مخصص
he: התאמה אישית

# @item:inlistbox
source: Use default (currently: %1)
ar: استخدم المبدئي (الحالي: %1)
he: להשתמש בברירת המחדל (כרגע: %1)

# @item:inlistbox
source: %1 (default selection)
ar: %1 (الاختيار المبدئي)
he: %1 (בחירת ברירת המחדל)

# @title:tab
source: Clang-Tidy
ar: كلانج-تايدي

# @title:tab
source: Configure Clang-Tidy Settings
ar: اضبط إعدادات كلانج-تايدي
he: הגדרת תצורת Clang-Tidy

# @title:group
source: Paths
ar: المسارات
he: נתיבים

# @label:chooser
source: Clang-&Tidy executable:
ar: الملف &التنفيذي لكلانج-تايدي:
he: קובץ ה&פעלת Clang-Tidy:

# @info:tooltip
source: The full path to the Clang-Tidy executable
ar: المسار الكامل لملف Clang-Tidy القابل للتنفيذ
he: הנתיב המלא לקובץ ההפעלה של Clang-Tidy

# @option:check
source: Run analysis jobs in parallel
ar: شغّل مهام التحليل بالتوازي
he: הרצת משימות ניתוח במקביל

# @option:check
source: Use all CPU cores
ar: استخدم كل أنوية المعالج
he: להשתמש בכל ליבות המעבד

# @label:spinbox
source: Maximum number of threads:
ar: العدد الأقصى للخيوط:
he: מספר התהליכונים המרבי:

# @option:check
source: &Use .clang-tidy file(s)
ar: ا&ستخدم ملف(ملفات) ‎.clang-tidy
he: לה&שתמש בקובצי ‎.clang-tidy

# @title:tab
source: Checks
ar: الفحوص
he: בדיקות

# @title:tab
source: Includes
ar: التضمينات
he: הכללות (Includes)

# @option:check
source: &Check system headers:
ar: ا&فحص ترويسات النظام:
he: בדיקת קובצי ה&כותרת של המערכת:

# @label:textbox
source: Header fi&lter:
ar: &مُرشِّح الترويسة:
he: מסנן קובצי &כותרת:

# @info:tooltip
source: Regular expression matching the names of the headers to output diagnostics from. Diagnostics from the main file of each translation unit are always displayed. Can be used together with -line-filter.
ar: تعبير نمطي يطابق أسماء الترويسات لإخراج التشخيصات منها. تظهر التشخيصات من الملف الرئيسي لكل وحدة ترجمة دائماً. يمكن استخدامه مع -line-filter.
he: ביטויים רגולריים תופסים את שמות הכותרות מהם לבצע ניתוח פלט. ניתוח מהקובץ הראשי של כל יחידת תרגום תמיד מוצג. אפשר להשתמש בזה יחד עם ‎-line-filter.

# @title:tab
source: Extra Parameters
ar: معاملات إضافية
he: משתנים נוספים

# @label.textbox
source: E&xtra parameters:
ar: م&عاملات إضافية:
he: משתנים &נוספים:

# @info:tooltip
source: Additional command line options to pass to Clang-Tidy.
ar: خيارات سطر الأوامر الإضافية لتمريرها إلى كلانج-تايدي.
he: אפשרויות נוספות לשורת הפקודות להעברה ל־Clang-Tidy.

source: Clang-Tidy Analysis
ar: تحليل كلانج-تايدي
he: ניתוח Clang-Tidy

source: Failed to start Clang-Tidy process.
ar: فشل بدء عملية كلانج-تايدي.
he: הפעלת תהליך Clang-Tidy נכשלה.

source: Clang-Tidy crashed.
ar: تعطل كلانج-تايدي.
he: Clang-Tidy קרס.

source: Clang-Tidy process timed out.
ar: انتهت مهلة عملية كلانج-تايدي.
he: הזמן שהוקצב לתהליך Clang-Tidy נגמר.

source: Write to Clang-Tidy process failed.
ar: فشل الكتابة إلى عملية كلانج-تايدي.
he: הכתיבה לתהליך Clang-Tidy נכשלה.

source: Read from Clang-Tidy process failed.
ar: فشل القراءة من عملية كلانج-تايدي.
he: הקריאה מתהליך Clang-Tidy נכשלה.
