Repository: KDE/kdevelop
Catalog: po/*/kdevexecuteplasmoid.po
Languages: fi, he

# @title:tab
source: Configure Plasmoid Execution
fi: Sovelman suorittamisen asetukset
he: הגדרת הפעלת פלזמואידים

source: Display a plasmoid
fi: Näytä sovelma
he: הצגת פלזמואיד

source: Plasmoid Launcher
fi: Sovelmakäynnistin
he: משגר פלזמואידים

source: Could not resolve the dependency: %1
fi: Ei voitu selvittää riippuvuutta: %1
he: לא ניתן לפתור את התלות: %1

# @title:menu
source: Plasmoids
fi: Sovelmat
he: פלזמואידים

# @title:group
source: Plasmoid
fi: Sovelma
he: פלזמואיד

# @label:listbox
source: Path or name:
fi: Sijainti tai nimi:
he: נתיב או שם:

# @title:group
source: Behavior
fi: Toiminta
he: התנהגות

# @label:listbox
source: Form factor:
fi: Alusta:
he: מקדם גודל:

# @label:listbox
source: Theme:
fi: Teema:
he: ערכת עיצוב:

# @title:group
source: Dependencies
fi: Riippuvuudet
he: תלויות

# @label:chooser
source: &Targets:
fi: Ko&hteet:
he: י&עדים:

source: Plasmoid Viewer
fi: Sovelmakatselin
he: מציג פלזמואידים

source: ** Killed **
fi: ** Tapettu **
he: ** חוסל **

source: *** Failed ***
fi: *** Epäonnistui ***
he: *** נכשל ***

source: *** Finished ***
fi: *** Päättyi ***
he: *** הסתיים ***

source: Plasmoid failed to execute on %1
fi: Sovelman suoritus epäonnistui: %1
he: ההפעלה של הפלזמואיד ב־%1 נכשלה
