Repository: KDE/kdevelop
Catalog: po/*/kdevquickopen.po
Languages: he

source: Documentation in the %1
he: תיעוד ב־%1

source: Not available any more: %1
he: לא זמינים עוד: %1

source: Not available any more
he: לא זמינים עוד

# %1: function signature
source: Return: %1
he: החזרה: %1

# %1: file path
source: File: %1
he: קובץ: %1

source: Quick Open Toolbar
he: סרגל פתיחה מהירה

# %1: project name
source: Project %1
he: מיזם %1

source: Not parsed yet
he: לא פוענח עדיין

# @item no project
source: none
he: אין

# @item quick open item type
source: Classes
he: מחלקות

# @item quick open item type
source: Functions
he: פונקציות

# @item quick open scope
source: Project
he: מיזם

# @item quick open scope
source: Includes
he: הכללות (Includes)

# @item quick open scope
source: Includers
he: מכלילים (Includers)

# @item quick open scope
source: Currently Open
he: פתוחים כרגע

# @item quick open item type
source: Files
he: קבצים

# @item quick open item type
source: Documentation
he: תיעוד

# @item quick open item type
source: Actions
he: פעולות

# @action
source: &Quick Open
he: &פתיחה מהירה

# @action
source: Quick Open &File
he: פתיחת &קובץ מהירה

# @action
source: Quick Open &Class
he: פתיחה מ&חלקה מהירה

# @action
source: Quick Open &Function
he: פתיחה &פונקציה מהירה

# @action
source: Quick Open &Already Open File
he: פתיחה מהירה של קובץ ש&כבר פתוח

# @action
source: Quick Open &Documentation
he: פתיחת &תיעוד מהירה

# @action
source: Quick Open &Actions
he: פתיחת &פעולות מהירה

# @action
source: Jump to Declaration
he: קפיצה להכרזה

# @action
source: Jump to Definition
he: מעבר להגדרה

# @action
source: Embedded Quick Open
he: פתיחה מהירה מוטמעת

# @action jump to
source: Next Function
he: הפונקציה הבאה

# @action jump to
source: Previous Function
he: הפונקציה הקודמת

# @action open outline quick open menu
source: Outline
he: מתאר

# @title:window
source: Quick Open
he: פתיחה מהירה

# @title:window
source: Outline
he: מתאר

# @info:placeholder
source: Quick Open...
he: פתיחה מהירה…

# @info:tooltip
source: Search for files, classes, functions and more, allowing you to quickly navigate in your source code.
he: חיפוש אחר קבצים, מחלקות, פונקציות ועוד, כך אפשר לנווט במהירות בקוד המקור שלך.

# @label:textbox
source: Search:
he: חיפוש:

# @action:button
source: Open
he: פתיחה

# @action:button
source: Cancel
he: ביטול

# @label:listbox
source: &Scopes:
he: &טווחים:

# @label:listbox
source: &Items:
he: &פריטים:
