Repository: KDE/kdevelop
Catalog: po/*/kdevexecutescript.po
Languages: ar, he

source: No valid executable specified
ar: لم تحدد برنامجا صالحا قابلا للتنفيذ

source: There is a quoting error in the script for the launch configuration '%1'. Aborting start.
ar: يوجد خطأ اقتباس في النص البرمجي لضبط الإطلاق '%1'. أوقف البدء.

source: A shell meta character was included in the script for the launch configuration '%1', this is not supported currently. Aborting start.
ar: أُدرجت حرفٌ تعريفي من الصدفة في النص البرمجي لضبط الإطلاق '%1'، هذا غير مدعوم حاليًا. أوقف البدء.

source: No remote host set for launch configuration '%1'. Aborting start.
ar: لم يحدد حاسوب مضيف بعيد لضبط الإطلاق '%1'. أوقف البدء.
he: לא הוגדר מארח מרוחק להגדרת ההרצה ‚%1’. ההתחלה מבוטלת.

source: There is a quoting error in the arguments for the launch configuration '%1'. Aborting start.
ar: يوجد خطأ اقتباس في الوسائط لضبط الإطلاق '%1'. أوقف البدء.

source: A shell meta character was included in the arguments for the launch configuration '%1', this is not supported currently. Aborting start.
ar: أُدرجت حرفٌ تعريفي من الصدفة في الوسائط لضبط الإطلاق '%1'، هذا غير مدعوم حاليًا. أوقف البدء.

source: No valid interpreter specified
ar: لم تحدد مفسّرًا صالحًا

source: There is a quoting error in the interpreter for the launch configuration '%1'. Aborting start.
ar: يوجد خطأ اقتباس في المفسر لضبط الإطلاق '%1'. أوقف البدء.

source: A shell meta character was included in the interpreter for the launch configuration '%1', this is not supported currently. Aborting start.
ar: أُدرجت حرفٌ تعريفي من الصدفة في المفسر لضبط الإطلاق '%1'، هذا غير مدعوم حاليًا. أوقف البدء.

source: Splitting the interpreter command for the launch configuration '%1' yields an empty list. Aborting start.
ar: تقسيم أمر المفسر لضبط الإطلاق '%1' ينتج قائمة فارغة. أوقف البدء.

# @info:placeholder
source: Type or select an interpreter...
ar: اكتب أو اختر مفسّرًا...
he: נא להקליד או לבחור מפרש…

# @title:tab
source: Configure Script Application
ar: اضبط تطبيق النص البرمجي
he: הגדרת יישום סקריפטים

source: Executes Script Applications
ar: ينفذ تطبيقات النص البرمجي
he: הרצת יישומי סקריפטים

source: Script Application
ar: تطبيق النص البرمجي
he: יישום סקריפט

# @title:group
source: Interpreter
ar: المفسّر
he: מפרש

# @label:listbox
source: Script interpreter:
ar: مفسّر النص البرمجي:
he: מפרש סקריפטים:

# @title:group
source: Script file
ar: ملف نص برمجي
he: קובץ סקריפט

# @option:radio
source: Run the file currently open in the editor
ar: شغّل الملف المفتوح حاليًا في المحرّر
he: הרצת הקובץ שפתוח כרגע בעורך

# @option:radio
source: Always run the same file
ar: شغّل الملف نفسه آليًا
he: תמיד להריץ את אותו הקובץ

# @label:chooser
source: Script file:
ar: ملف النص البرمجي:
he: קובץ סקריפט:

# @info:tooltip
source: Enter the absolute path to the script to run
ar: أدخل المسار المطلق للنص البرمجي لتشغيله
he: נא למלא את הנתיב המלא של הסקריפט להרצה

# @info:placeholder
source: /path/to/script
ar: /مسار/النص/البرمجي

# @title:group
source: Behavior
ar: السلوك
he: התנהגות

# @label:textbox
source: Arguments:
ar: الوسائط:
he: ארגומנטים:

# @info:tooltip
source: Enter arguments to give to the executable
ar: أدخل الوسائط لتعطيها للبرنامج القابل للتنفيذ
he: נא למלא ארגומנטים לספק לקובץ ההפעלה

# @label:chooser
source: Working directory:
ar: دليل العمل:
he: תיקיית עבודה:

# @info:tooltip
source: Select a working directory for the executable
ar: اختر دليل عمل للبرنامج القابل للتنفيذ
he: נא לבחור תיקיית עבודה לקובץ ההפעלה

# @label:chooser
source: Environment:
ar: البيئة:
he: סביבה:

# @info:tooltip
source: Select an environment to be used
ar: اختر تشكيلة بيئة للاستخدام
he: נא לבחור סביבה לשימוש

# @label:listbox
source: Output filter:
ar: مُرشّح المخرجات:
he: מסנן פלט:

# @info:tooltip
source: Select the filter to applied to the output. E.g. to mark errors with red text
ar: اختر المُرشّح ليُطبق على المخرجات. على سبيل المثال، لوضع علامة على الأخطاء بنص أحمر
he: נא לבחור את המסנן שיוחל על הפלט. למשל: לסמן שגיאות בטקסט אדום

# @item:inlistbox output filter
source: No Filter
ar: لا مُرشّح
he: ללא מסנן

# @item:inlistbox output filter
source: Compiler Filter
ar: مُرشّح المُصرّف
he: מסנן מהדר

# @item:inlistbox output filter
source: Script Error Filter
ar: مُرشّح أخطاء النص البرمجي
he: מסנן שגיאת סקריפט

# @item:inlistbox output filter
source: Static Analysis Filter
ar: مُرشّح التحليل الساكن
he: מסנן ניתוח סטטי

# @title:group
source: Execute on Host
ar: نفّذ على المضيف
he: הרצה על המארח

# @option:check
source: Execute on remote host
ar: نفّذ على حاسوب مضيف بعيد
he: הרצה על מארח מרוחק

# @label:textbox
source: Remote host (ssh):
ar: حاسوب مضيف بعيد (ssh):
he: מארח מרוחק (ssh):

# @info:placeholder
source: user@host
ar: مستخدم@مضيف

# @info:tooltip
source: Enter a remote host (user@host)
ar: أدخل حاسوبًا مضيفًا بعيدًا (مستخدم@مضيف)
he: נא למלא מארח מרוחק (user@host)

source: No environment profile specified, looks like a broken configuration, please check run configuration '%1'. Using default environment profile.
ar: لم تحدد تشكيلة بيئة، يبدو كأنّ تضبيطًا مكسورًا، الرجاء افحص تضبيط التشغيل '%1'. يستخدم تشكيلة البيئة المبدئية.
he: לא צוין פרופיל סביבה, זה נראה כמו הגדרות פגומות, נא להריץ בדיקה על ההגדרות ‚%1’. עוברים להשתמש בפרופיל סביבה כברירת מחדל.

source: There is no active document to launch.
ar: لا يوجد مستند نشط للإطلاق.
he: אין מסמך פעיל להפעלה.

source: Starting: %1
ar: يبدأ: %1
he: מופעל: %1

source: *** Killed Application ***
ar: *** قُتل التطبيق ***
he: *** יישום חוסל ***

source: *** Exited normally ***
ar: *** خرج بصورة طبيعية ***
he: *** הסתיים בצורה רגילה ***

source: *** Exited with return code: %1 ***
ar: *** خرج برمز إرجاع: %1 ***
he: *** הסתיים עם קוד החזרה: %1 ***

source: *** Process aborted ***
ar: *** أُجهضت العملية ***
he: *** התהליך בוטל ***

source: *** Crashed with return code: %1 ***
ar: *** تحطمت برمز إرجاع: %1 ***
he: *** קרס עם קוד החזרה: %1 ***

source: *** Could not start program '%1'. Make sure that the path is specified correctly ***
ar: *** لا يمكن بدء البرنامج '%1'. تأكد أن المسار محدد بصورة صحيحة ***
he: *** לא ניתן להפעיל את התוכנית ‚%1’. נא לוודא שהנתיב מוגדר כראוי ***

# path to a script
source: script path
he: נתיב הסקריפט

# command line arguments to a script
source: arguments
he: ארגומנטים

source: interpreter command
he: פקודת מפרש
