Repository: KDE/kdevelop
Catalog: po/*/kdevcmakebuilder.po
Languages: ar, fi, zh_tw

source: Could not find the make builder. Check your installation
ar: لا أستطِع إيجاد باني make. تحقَّق من تثبيتك
fi: make-koostajaa ei löytynyt. Tarkista asennus
zh_tw: 找不到 make 編譯工具。請檢查您的安裝

source: Could not find a builder for %1
ar: لا أستطِع إيجاد بانٍ لـ %1
fi: Projektille %1 ei löytynyt koostajaa
zh_tw: 找不到 %1 的編譯工具

source: No build directory configured, cannot install
ar: لم يجرِ اضباط دليل بناء، لا أستطِع التثبيت
fi: Koostamiskansiota ei ole määritetty: ei voida asentaa
zh_tw: 未設定編譯目錄，無法 install

source: No build directory configured, cannot configure
ar: لم يجرِ اضباط دليل بناء، لا أستطِع اضباط
fi: Koostamiskansiota ei ole määritetty: ei voi asettaa
zh_tw: 未設定編譯目錄，無法 configure

# @title:tab
source: Configure Global CMake Settings
ar: اضبط إعدادات CMake العامة
fi: CMaken yleisasetukset
zh_tw: 設定 CMake 全域選項

# @label:chooser
source: Default CMake executable:
ar: تنفيذي CMake مبدئي:
fi: CMake-oletusohjelmatiedosto:
zh_tw: 預設 CMake 執行檔：

# @label:listbox
source: Default generator:
ar: مُوَلِّد مبدئي:
fi: Oletusluoja:
zh_tw: 預設產生器：

source: Internal error: no project specified to configure.
ar: خطأ داخلي: لم يجرِ تحديد مشروع لغرض اضباط.
fi: Sisäinen virhe: määritettävää projektia ei ole valittu.
zh_tw: 內部錯誤：未指定要 configure 的專案。

source: Failed to create build directory %1.
ar: فشِل إنشاء دليل البناء %1.
fi: Koostamiskansiota %1 ei voitu luoda.
zh_tw: 建立編譯目錄 %1 時發生錯誤。

source: No build directory configured, cannot clear the build directory
ar: لم يجرِ اضباط دليل بناء، لا أستطِع مسح دليل البناء
fi: Koostamiskansiota ei ole asetettu, joten sitä ei voi tyhjentää
zh_tw: 未設定編譯目錄，無法清除編譯目錄。

source: Wrong build directory, cannot clear the build directory
ar: دليل بناء خاطئ، لا أستطِع مسح دليل البناء
fi: Käännöshakemistoa ei voida tyhjentää: se on väärä
zh_tw: 編譯目錄錯誤，無法清除編譯目錄

source: ** Prune successful **
ar: ** نجح التَّهذيب **
fi: ** Tyhjentäminen onnistui **
zh_tw: ** Prune 成功 **

source: ** Prune failed: %1 **
ar: ** فشِل التَّهذيب: %1 **
fi: ** Tyhjentäminen epäonnistui: %1 **
zh_tw: ** Prune 失敗：%1 **
