Repository: KDE/kdevelop
Catalog: po/*/kdevgit.po
Languages: ar, gl

source: Filter by filename/project name
ar: صَفِّ بالاسم أو اسم المشروع
gl: Filtrar por ruta ou nome de proxecto

source: Refresh
ar: حدّث
gl: Actualizar

source: Stage selected
ar: أجهِز المختار
gl: Preseleccionar a selección

source: Unstage selected
ar: أبعِد المختار عن الإجهاز
gl: Anular a preselección da selección

source: Revert unstaged edits
ar: تراجع عن التعديلات غير المجهّزة
gl: Reverter as edicións non preseleccionadas

source: Committing failed. See Version Control tool view.
ar: إيداع فاشل. انظر عرض أداة 'التحكم في النسخة'.
gl: Produciuse un erro ao remitir. Consulte a vista de ferramenta de versión de control.

source: Stage selected lines or hunk
ar: أجهِز الأسطر أو مجموعة التغييرات المختارة
gl: Preseleccionar as liñas ou bloque seleccionados

source: Unstage selected lines or hunk
ar: أبعِد الأسطر أو مجموعة التغييرات المختارة عن الإجهاز
gl: Anular a preselección das liñas ou bloque seleccionados

source: Revert selected lines or hunk
ar: تراجع عن الأسطر أو مجموعة التغييرات المختارة
gl: Reverter as liñas ou bloque seleccionados

source: Go to line in source
ar: اذهب إلى السطر في المصدر
gl: Ir á liña na fonte

source: Unstage selected lines
ar: أبعِد الأسطر المختارة عن الإجهاز
gl: Anular a preselección das liñas seleccionadas

source: Stage selected lines
ar: أجهِز الأسطر المختارة
gl: Preseleccionar as liñas seleccionadas

source: Revert selected lines
ar: تراجع عن الأسطر المختارة
gl: Reverter as liñas seleccionadas

source: Unstage selected hunk
ar: أبعِد مجموعة التغييرات المختارة عن الإجهاز
gl: Anular a preselección do bloque seleccionado

source: Stage selected hunk
ar: أجهِز مجموعة التغييرات المختارة
gl: Preseleccionar o bloque seleccionado

source: Revert selected hunk
ar: تراجع عن مجموعة التغييرات المختارة
gl: Reverter o bloque seleccionado

source: S
gl: P

source: G
gl: I

source: %1 (staged)
ar: %1 (مجهّز)
gl: %1 (preseleccionado)

source: Staged (%1)
ar: مجهّز (%1)
gl: Preseleccionado (%1)

source: Unstaged (%1)
ar: غير مجهّز (%1)
gl: Non preseleccionado (%1)

source: %1 (unstaged)
ar: %1 (غير مجهّز)
gl: %1 (non preseleccionado)

source: The selected lines will be reverted and the changes lost. This operation cannot be undone. Continue?
ar: سنتراجع عن الأسطر المختارة وسنفقد التغييرات. لا يمكن التراجع عن هذه العملية. هل تواصل؟
gl: As liñas seleccionadas reverteranse e perderanse os cambios. Non é posíbel desfacer esta operación. Quere continuar?

# @action:button
source: Revert
ar: تراجع
gl: Reverter

source: Try to keep summary length below %1 characters.
ar: حاول أن تُبقي طول الملخّص أقل من %1 من المحارف.
gl: Intentar que a lonxitude do resumo sexa inferior a %1 caracteres.

source: Separate summary from details with one empty line.
ar: افصل الملخص عن التفاصيل بسطر فارغ واحد.
gl: Separar o resumo dos detalles cunha liña baleira.

source: Try to keep line length below %1 characters.
ar: حاول أن تُبقي طول السطر أقل من %1 من المحارف.
gl: Intentar que a lonxitude da liña sexa inferior a %1 caracteres.

# @title:window
source: Configure Name and Email for Git
ar: اضبط الاسم والبريد لـ Git
gl: Configurar o nome e o correo electrónico para Git

source: <html><head/><body><p>You have not yet configured the name and email to be associated with your Git commits.<br/>The values you enter here will be written to the Git configuration, either locally for the current project only, or globally for all Git projects.</p></body></html>
ar: <html><head/><body><p>لم تضبط بعد الاسم والبريد لربطهما بإيداعات Git الخاصة بك.<br/>القِيَم التي تُدخلها هنا ستُكتب في ضبط Git، إما محليًا للمشروع الحالي فقط، أو عامًا لكل مشاريع Git.</p></body></html>
gl: <html><head/><body><p> Aínda non configurou o nome e o correo electrónico que quere asociar coas súas remisións de Git.<br/> Os valores que escriba gardaranse na configuración de Git, ou ben unicamente para o proxecto actual, ou ben globalmente para todos os proxectos que usen Git.</p></body></html>

# @label:textbox
source: &Name:
ar: &الاسم:
gl: &Nome:

# @label:textbox
source: Emai&l:
ar: البري&د:
gl: Correo e&lectrónico:

# @option:check
source: Write to global config
ar: اكتب في الضبط العام
gl: Gardar na configuración global.

source: Unable to find git executable. Is it installed on the system?
ar: تعذّر العثور على ملف git التنفيذي. هل هو مثبَّت على الحاسوب؟
gl: Non é posíbel atopar o executábel git. Está instalado no sistema?

source: Git Commit
ar: إيداع جِت
gl: Remisión de Git

# @action:inmenu
source: Rebase
ar: إعادة القاعدة
gl: Rebasear

# @title:menu
source: Git Stashes
ar: مخبّآت جِت
gl: Reservas de Git

# @action:inmenu
source: Stash Manager
ar: مدير المخبّآت
gl: Xestor de reservas

# @action:inmenu
source: Push Stash
ar: ادفع مخبّأ
gl: Puxar á reserva

# @action:inmenu
source: Pop Stash
ar: أَخرِج مخبّأ
gl: Pular da reserva

source: error: %1
gl: erro: %1

source: Did not specify the list of files
ar: لم تحدّد قائمة الملفات
gl: Non se indicou a lista de ficheiros

source: Could not reset changes (empty list of paths)
ar: لم أستطع إعادة تعيين التغييرات (قائمة مسارات فارغة)
gl: Non foi posíbel restabelecer os cambios (a lista de rutas está baleira).

source: Could not revert changes
ar: لم أستطع التراجع عن التغييرات
gl: Non foi posíbel reverter os cambios.

source: The following files have uncommitted changes, which will be lost. Continue?
ar: لدى الملفات التالية تغييرات غير مودعة، ستفقد. هل تواصل؟
gl: Os seguintes ficheiros conteñen cambios que non forman parte de ningunha remisión e polo tanto perderanse. Seguro que quere continuar?

source: No files or message specified
ar: لم تحدّد ملفات أو رسالة
gl: Non se indicaron ficheiros ou mensaxe

source: Email or name for Git not specified
ar: لم تحدّد بريد أو اسم لـ Git
gl: Non indicou o correo electrónico ou o nome para Git.

source: No message specified
ar: لم تحدّد رسالة
gl: Non se indicou unha mensaxe.

source: No files to remove
ar: لا ملفات للحذف
gl: Non hai ficheiros para eliminar

source: There are pending changes, do you want to stash them first?
ar: لديك تغييرات معلّقة، هل تريد تخبئتها أولاً؟
gl: Hai cambios pendentes; quere poñelos en reserva primeiro?

# @action:button
source: Stash
ar: خبّئ
gl: Reserva

# @action:button
source: Keep
ar: احتفظ
gl: Manter

# @title:window
source: Branch Selection
ar: اختيار الفرع
gl: Selección de rama

# @title:window
source: Rebase
ar: إعادة القاعدة
gl: Rebasear

# @label:listbox
source: Base branch:
ar: الفرع المبدئي:
gl: Rama base:

# @action:button
source: Rebase
ar: أَعِد القاعدة
gl: Rebasear

# @action:button
source: Cancel
ar: ألغِ
gl: Cancelar

# Files in a vcs which have changes staged for commit
source: Staged changes
ar: تغييرات مجهّزة
gl: Cambios preseleccionados

# Files in a vcs which have changes not yet staged for commit
source: Unstaged changes
ar: تغييرات غير مجهّزة
gl: Cambios non preseleccionados

# Files in a vcs which have unresolved (merge) conflits
source: Conflicts
ar: تعارضات
gl: Conflitos

# Files which are not tracked by a vcs
source: Untracked files
ar: ملفات غير متتبّعة
gl: Ficheiros sen seguimento

# Files in a vcs which have changes staged for commit
source: Staged
ar: مجهّز
gl: Preseleccionado

source: Files with changes staged for commit
ar: ملفات بتغييرات مجهّزة للإيداع
gl: Ficheiros con cambios preseleccionados para remitir.

# Files in a vcs which have changes not checked in to repo
source: Modified
ar: معدّل
gl: Modificado

source: Files with changes
ar: ملفات بتغييرات
gl: Ficheiros con cambios

# Files in git which have unresolved (merge) conflits
source: Conflicts
ar: تعارضات
gl: Conflitos

source: Files with unresolved (merge) conflicts
ar: ملفات بتعارضات (دمج) غير محلولة
gl: Ficheiros con conflitos (de mestura) sen resolver

# Files which are not tracked by a vcs
source: Untracked
ar: غير متتبّع
gl: Sen seguimento

source: Files not tracked in VCS
ar: ملفات غير متتبّعة في نظام التحكم بالنسخ
gl: Ficheiros sen seguimento no sistema de control de versións.

# @item file has unstaged changes
source: Modified (unstaged)
ar: معدّل (غير مجهّز)
gl: Modificado (non preseleccionado)

# @item file was deleted from worktree
source: Deleted (unstaged)
ar: محذوف (غير مجهّز)
gl: Eliminado (non preseleccionado)

# @item file was renamed in worktree
source: Renamed (unstaged)
ar: أُعيد تسميته (غير مجهّز)
gl: Renomeado (non preseleccionado)

# @item file was copied in worktree
source: Copied (unstaged)
ar: منسوخ (غير مجهّز)
gl: Copiado (non preseleccionado)

# @item file has staged changes
source: Modified (staged)
ar: معدّل (مجهّز)
gl: Modificado (preseleccionado)

# @item file has both staged and unstaged changes
source: Modified (unstaged changes)
ar: معدّل (تغييرات غير مجهّزة)
gl: Modificado (cambios non preseleccionados)

# @item file has staged changes and was deleted in worktree
source: Modified (unstaged deletion)
ar: معدّل (حذف غير مجهّز)
gl: Modificado (eliminación non preseleccionada)

# @item file was added to versioncontrolsystem and has unstaged changes
source: Added (unstaged changes)
ar: مضاف (تغييرات غير مجهّزة)
gl: Engadido (cambios non preseleccionados)

# @item file was added to versioncontrolsystem and deleted in worktree
source: Added (unstaged deletion)
ar: مضاف (حذف غير مجهّز)
gl: Engadido (eliminación non preseleccionada)

# @item file was deleted from versioncontrolsystem and renamed in worktree
source: Deleted (unstaged rename)
ar: محذوف (إعادة تسمية غير مجهّزة)
gl: Eliminado (renomeamento non preseleccionado)

# @item file was deleted from versioncontrolsystem and copied in worktree
source: Deleted (unstaged copy)
ar: محذوف (نسخ غير مجهّز)
gl: Eliminado (copia non preseleccionada)

# @item file was renamed in versioncontrolsystem
source: Renamed (staged)
ar: أُعيد تسميته (مجهّز)
gl: Renomeado (preseleccionado)

# @item file was renamed in versioncontrolsystem and has unstaged changes
source: Renamed (unstaged changes)
ar: أُعيد تسميته (تغييرات غير مجهّزة)
gl: Renomeado (cambios non preseleccionados)

# @item file was renamed in versioncontrolsystem and was deleted in worktree
source: Renamed (unstaged deletion)
ar: أُعيد تسميته (حذف غير مجهّز)
gl: Renomeado (eliminación non preseleccionada)

# @item file was copied in versioncontrolsystem
source: Copied
ar: منسوخ
gl: Copiado

# @item file was copied in versioncontrolsystem and has unstaged changes
source: Copied (unstaged changes)
ar: منسوخ (تغييرات غير مجهّزة)
gl: Copiado (cambios non preseleccionados)

# @item file was copied in versioncontrolsystem and was deleted in worktree
source: Copied (unstaged deletion)
ar: منسوخ (حذف غير مجهّز)
gl: Copiado (eliminación non preseleccionada)

# @item file has unresolved merge conflicts
source: Unresolved conflicts
ar: تعارضات غير محلولة
gl: Conflitos sen resolver

# @item file is not under vcs
source: Untracked
ar: غير متتبّع
gl: Sen seguimento

# file in unknown (invalid) state
source: Unknown
ar: غير معروف
gl: Descoñecido

source: (staged)
ar: (مجهّز)
gl: (preseleccionado)

source: (unstaged)
ar: (غير مجهّز)
gl: (non preseleccionado)

source: (conflicts)
ar: (تعارضات)
gl: (conflitos)

source: (untracked)
ar: (غير متتبّع)
gl: (sen seguimento)

source: no branch
ar: لا فرع
gl: sen rama

source: Commit
ar: إيداع
gl: Remitir

source: Extended commit description
ar: وصف الإيداع المفصّل
gl: Descrición estendida da remisión.

source: Commit summary
ar: ملخّص الإيداع
gl: Resumo da remisión

source: To commit changes, please write a commit message first
ar: لإيداع التغييرات، اكتب رسالة الإيداع أولاً
gl: Para remitir os cambios escriba primeiro unha mensaxe de remisión.

source: Commit changes to <b>%1</b> on branch <b>%2</b>
ar: أَدِع التغييرات إلى <b>%1</b> على الفرع <b>%2</b>
gl: Remitir os cambios a <b>%1</b> na rama <b>%2</b>

source: To commit changes, please select a project first
ar: لإيداع التغييرات، اختر مشروعًا أولاً
gl: Para remitir os cambios primeiro seleccione un proxecto.

source: Please stage some changes before committing.
ar: أجهِز بعض التغييرات قبل الإيداع.
gl: Preseleccione algún cambio para remitir.

# @title:window
source: Stash Manager
ar: مدير المخبّآت
gl: Xestor de reservas

source: Are you sure you want to drop the stash '%1'?
ar: هل أنت متأكّد من أنك تريد إسقاط المخبّأ '%1'؟
gl: Seguro que quere eliminar a reserva «%1»?

# @action:button
source: Drop
ar: أَسقِط
gl: Eliminar

# @title:window
source: Git Stash
ar: مخبّأ جِت
gl: Reserva de Git

# @label:textbox
source: Name for the new branch:
ar: اسم الفرع الجديد:
gl: Nome da nova rama:

source: %1 created on %2
ar: %1 أُنشئ على %2
gl: %1 creado o %2

# @info:tooltip
source: Remove the selected stash
ar: أَزِل المخبّأ المختار
gl: Eliminar a reserva seleccionada.

# @info:tooltip
source: Apply stash's patch and drop the stash
ar: طَبِّق رقعة المخبّأ وأَسقِط المخبّأ
gl: Aplicar o parche da reserva e eliminar a reserva.

# @action:button
source: Pop
ar: أَخرِج
gl: Sacar

# @info:tooltip
source: Show the content of the stash
ar: أَرِ محتوى المخبّأ
gl: Amosar o contido da reserva.

# @action:button
source: Show
ar: أَرِ
gl: Amosar

# @info:tooltip
source: Apply stash's patch
ar: طَبِّق رقعة المخبّأ
gl: Aplicar o parche da reserva.

# @action:button
source: Apply
ar: طَبِّق
gl: Aplicar

# @info:tooltip
source: Create a new branch and apply the stash there, then drop the stash
ar: أنشئ فرعًا جديدًا وطَبِّق المخبّأ عليه، ثم أَسقِط المخبّأ
gl: Crear unha nova rama, aplicar a reserva nela, e eliminar a reserva.

# @action:button
source: Branch
ar: فرّع
gl: Rama
