Repository: KDE/kdevelop
Catalog: po/*/kdevplatform.po
Languages: ar

# @info
source: Failed to lock the session <em>%1</em>, already locked by %2 on %3 (PID %4).
ar: فشِل قفل الجلسة <em>%1</em>، مقفلة بالفعل بواسطة %2 على %3 (رقم العملية %4).

# @info
source: Failed to lock the session <em>%1</em> (lock-file unavailable).
ar: فشِل قفل الجلسة <em>%1</em> (ملف القفل غير متوفر).

# @info
source: <p>Please, close the offending application instance or choose another session to launch.</p>
ar: <p>اِرجوك، أَغلِق نسخة التطبيق المُخالِفة أو اِختر جلسة أخرى لـ إطلاقها.</p>

# @action:button
source: Retry Startup
ar: أَعِد محاولة البدء

# @action:button
source: Choose Another Session
ar: اِختر جلسة أخرى

# @title:window
source: Failed to Lock Session %1
ar: فشِل قفل الجلسة %1

# @info
source: The session %1 is already active in another running instance.
ar: الجلسة %1 نشطة بالفعل في نسخة جارية أخرى.

source: Analyzers
ar: المُحلِّلات

source: Configure Analyzers
ar: اضبط المُحلِّلات

source: Configure Background Parser
ar: اضبط المُحلِّل الخلفي

# @info:tooltip
source: <p>Enables or disables the background parser.<br>If unsure, leave it enabled. Disabling the background parser will disable large parts of KDevelop's functionality.</p>
ar: <p>يُفعّل أو يُعطّل المُحلِّل الخلفي.<br>إن لم تكن متأكدًا، اِتركه مُفعّلاً. تعطيل المُحلِّل الخلفي سـ يُعطّل أجزاء كبيرة من وظيفة KDevelop مطوّرك.</p>

# @title:group
source: Enable Background Parser
ar: فَعِّل المُحلِّل الخلفي

# @info:tooltip
source: The time to wait before the document is re-analyzed when you edit it.
ar: الوقت لـ الانتظار قبل أن يُعاد تحليل الوثيقة عند تحريرها.

# @label:spinbox
source: Delay:
ar: التّأخير:

# @item:valuesuffix
source: ms
ar: مث

# @info:tooltip
source: The maximum number of parallel instances the background parser uses. If unsure, select 1 or 2.
ar: العدد الأقصى من النُسَخ المتوازية التي يستخدمها المُحلِّل الخلفي. إن لم تكن متأكدًا، اِختر 1 أو 2.

# @label:spinbox
source: Maximum number of threads:
ar: العدد الأقصى من الخيوط:

# @item:valuesuffix
source: threads
ar: الخطوط

source: Configure Documentation
ar: اضبط التوثيق

source: Toggle preview visibility for this style. Preview should be disabled for styles whose formatting depends on the file path.
ar: بدِّل رؤية المعاينة لهذا النمط. يَجب تعطيل المعاينة للأنماط التي يعتمد تنسيقها على مسار الملف.

source: Show Preview
ar: أظهر معاينة

# @label
source: Preview:
ar: معاينة:

source: Environment
ar: البيئة

source: Configure Environment Variables
ar: اضبط متغيرات البيئة

source: %1 (default profile)
ar: %1 (التشكيلة المبدئية)

# @title:column
source: Variable
ar: المتغير

# @title:column
source: Value
ar: القيمة

# @info:placeholder
source: Enter variable...
ar: أدخل متغير…

# @title:window
source: Enter Name of New Environment Profile
ar: أَدخِل اسم تشكيلة البيئة الجديدة

# @title:window
source: Batch Edit Mode
ar: نمط التحرير الدفعي

# @label:listbox
source: Environment profile:
ar: تشكيلة البيئة:

# @info:tooltip
source: Add profile...
ar: أضف ملف شخصي...

# @info:tooltip
source: Clone profile...
ar: اِستنسِخ التشكيلة...

# @info:tooltip
source: Remove profile
ar: احذف منظومة

# @info:tooltip
source: Set as default
ar: اجعله المبدئي

# @info:tooltip
source: Remove variable
ar: أزل المتغيّر

# @info:tooltip
source: Batch edit mode
ar: نمط التحرير الدفعي

# @item:valuesuffix
source: file
ar: ملف

source: Language Support
ar: دعم اللغة

source: Configure Code-Completion and Semantic Highlighting
ar: اضبط إكمال الشيفرة والإبراز الدلالي

# @title:group
source: Code Completion
ar: إكمال الأكواد

# @info:tooltip
source: If disabled, the code completion widget will never show automatically.
ar: إن عُطِّل، ويدجت إكمال الشيفرة لن يُعرَض آليًا أبدًا.

# @label
source: Enable automatic invocation:
ar: فَعِّل الاستدعاء الآلي:

# @info:tooltip
source: Choose whether to display additional information for the currently selected codecompletion item.
ar: اِختر ما إذا كـ يُعرَض معلومات إضافية لعنصر إكمال الشيفرة المُختار حاليًا.

# @label
source: Additional information for current item:
ar: معلومات إضافية للعنصر الحالي:

# info:tooltip
source: Choose whether to display additional information for the currently selected code completion item.
ar: اِختر ما إذا كـ يُعرَض معلومات إضافية لعنصر إكمال الشيفرة المُختار حاليًا.

source: <p>The code completion UI has a minimal mode and a detailed mode.<br>Choose in what cases full code completion will be displayed.</p>
ar: <p>واجهة مستخدِم إكمال الشيفرة لديها نمط مبدئي ونمط مُفصَّل.<br>اِختر في أي حالات سـ يُعرَض إكمال الشيفرة الكامل.</p>

# @label
source: Detailed completion:
ar: إكمال مُفصَّل:

# @item:inlistbox
source: Never
ar: البتة

# @item:inlistbox
source: When Invoked Manually
ar: عند الاستدعاء يدويًا

# @item:inlistbox
source: Always
ar: دائمًا

# @title:group
source: Semantic Code Highlighting
ar: إبراز الشيفرة الدلالي

source: <p>This setting decides about the intensity of colors for local variables, for example function arguments, variables and the like.</p>
ar: <p>يُقرِّر هذا الإعداد شدة الألوان للمتغيرات المحلية، على سبيل المثال مُعامِلات الدوال، المتغيرات وما شابه.</p>

# @label:slider
source: Local colorization intensity:
ar: شدة الألوان المحلية:

source: <p>By default, the global colors for types, functions, namespaces and so forth are auto-generated and will adapt to the selected editor theme based on the global colorization intensity. If you want to have full control over the colors, you can instead use the editor theme as color source. You can then fine tune the colors in the settings under Editor &gt; Color Themes &gt; Highlighting Text Styles &gt; KDevelop/Semantic Colors.</p>
ar: <p>بـ شكل مبدئي، الألوان الشاملة للأنواع، الدوال، فضاءات الأسماء، وهلم جرا، مولّدة آليًا وسـ تتكيَّف مع سمة المُحرِّر المُختارة بناءً على شدة الألوان الشاملة. إن أردت سيطرة كاملة على الألوان، يُمكِنك عوضًا عن ذلك اِستخدِم سمة المُحرِّر كمصدر لون. يُمكِنك إذًا ضبط الألوان بدقة في الإعدادات ضمن المُحرِّر &gt; سمات الألوان &gt; أنماط إبراز النص &gt; KDevelop مطوّرك/ألوان دلالية.</p>

source: Auto-Generated
ar: مولَّد آليًا

source: From Editor Theme
ar: من سمة المُحرِّر

source: Global colors:
ar: ألوان شاملة:

source: <p>This settings lets you change the intensity of globally accessible types, for example classes, methods, functions etc.</p>
ar: <p>يَسمح لك هذا الإعداد بـ تغيير شدة الأنواع الشاملة المتاحة، على سبيل المثال الأصناف، الطرق، الدوال، إلخ.</p>

# @label:slider
source: Global colorization intensity:
ar: شدة الألوان الشاملة:

source: <p>Highlight semantic problems, such as non-existent or inaccessible declarations.</p>
ar: <p>أَبْرِز المشاكل الدلالية، مثل التصريحات غير الموجودة أو غير المتاحة.</p>

# @label
source: Highlight semantic problems:
ar: أَبْرِز المشاكل الدلالية:

source: <p>When enabled, lines with errors will get additionally highlighted and their positions get marked in the scrollbar.</p>
ar: <p>عند التفعيل، سـ تُبرَز الأسطر التي تحتوي أخطاء إضافيًا وتُعلَّم مواضعها في شريط التمرير.</p>

# @label
source: Highlight problematic lines:
ar: أَبْرِز الأسطر المُشكِلة:

source: <html><head/><body><p>Use bold font for declarations such as classes, functions, local variables, etc.</p></body></html>
ar: <html><head/><body><p>اِستخدِم خطًا عريضًا للتصريحات مثل الأصناف، الدوال، المتغيرات المحلية، إلخ.</p></body></html>

# @label
source: Bold font for declarations:
ar: خط عريض للتصريحات:

# @label:listbox
source: Problems shown as inline notes:
ar: المشاكل المعروضة كملاحظات مُضمَّنة:

# @item:inlistbox inline problems shown
source: None
ar: لا شيء

# @item:inlistbox inline problems shown
source: Errors
ar: الأخطاء

# @item:inlistbox inline problems shown
source: Warnings and Errors
ar: تحذيرات وأخطاء

# @item:inlistbox inline problems shown
source: Hints, Warnings and Errors
ar: تلميحات، تحذيرات، وأخطاء

# @info:tooltip
source: Space-separated list of words that make a comment represent a TODO item
ar: قائمة من الكلمات مفصولة بـ مسافات تجعل تعليقًا يُمثِّل عنصر TODO

# @label:textbox
source: TODO marker words:
ar: كلمات علامة TODO:

# @info:tooltip
source: Space-separated list of words that make a comment represent a TODO item.
ar: قائمة من الكلمات مفصولة بـ مسافات تجعل تعليقًا يُمثِّل عنصر TODO.

# @title:group
source: Project Parsing
ar: تحليل المشروع

source: <p>When a project contains more files than this number, the project will be parsed in simplified mode, increasing the efficiency by gathering less information. Global code navigation and quickopen capabilities will be reduced.</p>
ar: <p>عندما يحتوي مشروع عدد ملفات أكبر من هذا الرقم، سـ يُحلَّل المشروع في نمط مُبسَّط، ما يزيد الكفاءة بجمع معلومات أقل. سـ تُقلَّل قدرات تصفح الشيفرة الشاملة والفتح السريع.</p>

# @label:spinbox
source: Minimum project size for simplified parsing:
ar: الحد الأدنى لحجم المشروع للتحليل المبسَّط:

# @title:group
source: Storage and Memory Use
ar: التخزين واستخدام الذاكرة

# @label
source: Store precompiled preambles in:
ar: اِحفظ الديباجات المُصرَّفة مُسبَقًا في:

source: <p>Precompiled preambles remain in the temporary directory after KDevelop crashes and are deleted only when the same session is started again.<br> When the preambles are stored in memory, they are guaranteed to disappear on exit even if KDevelop crashes.<br> Choosing the Session Temporary Directory storage makes sense on systems where RAM is limited and the temporary directory does not use tmpfs, because the preamble files can occupy gigabytes of space.<br> Changing this option takes effect after restarting KDevelop.<br> This option has effect only if KDevelop has been built against Clang version 17 or later. </p>
ar: <p>تبقى الديباجات المُصرَّفة مُسبَقًا في المجلد المؤقت بعد انهيار KDevelop مطوّرك ولا تُحذف إلا عند بدء الجلسة نفسها مرة أخرى.<br> عندما تُخزَّن الديباجات في الذاكرة، نَضمَن اختفاءها عند الخروج حتى لو انهار KDevelop مطوّرك.<br> اختيار تخزين مجلد الجلسة المؤقت يَجدُر على الأنظمة التي ذاكرتها العشوائية محدودة والمجلد المؤقت لا يستخدم tmpfs، لأن ملفات الديباجة يُمكِن أن تشغل جيجابايتات من المساحة.<br> يَسرِي تغيير هذا الخيار بعد إعادة تشغيل KDevelop مطوّرك.<br> يَسرِي هذا الخيار فقط إذا بُني KDevelop مطوّرك مقابل الإصدار 17 أو الأحدث من Clang. </p>

# @item:inlistbox
source: Memory
ar: الذاكرة

# @item:inlistbox
source: Session Temporary Directory
ar: مجلد الجلسة المؤقت

# @title:group
source: Core
ar: النواة

# @title:group
source: Project Management
ar: إدارة المشاريع

# @title:group
source: Version Control
ar: التحكم بالإصدارات

# @title:group
source: Utilities
ar: الأدوات

# @title:group
source: Documentation
ar: التّوثيق

# @title:group
source: Language Support
ar: دعم اللغة

# @title:group
source: Debugging
ar: التّنقيح

# @title:group
source: Testing
ar: اختباريّ

# @title:group
source: Analyzers
ar: المُحلِّلات

# @title:group
source: Runtimes
ar: أوقات التشغيل

# @title:group
source: Other
ar: أخرى

source: Plugins
ar: الملحقات

source: Configure Plugins
ar: اضبط الملحقات

source: Schedule all project source code to be parsed by the language support in the background
ar: جَدْوِل كل شيفرة مصدر المشروع لـ تُحلَّل بواسطة دعم اللغة في الخلفية

source: If this option is set, KDevelop will schedule all source code found by the current build system for parsing by the appropriate language support part. This will enable more complete language support, but may be slower.
ar: إن ضُبِط هذا الخيار، KDevelop مطوّرك سـ يُجدوِل كل الشيفرة المصدر التي يجدها نظام البناء الحالي لـ تُحلَّل بواسطة جزء دعم اللغة المُناسب. هذا سـ يُفعِّل دعم لغة أكثر اكتمالًا، ولكنه قد يكون أبطأ.

source: Chooses the base directory where new projects are created.
ar: يَختار المجلد مبدئي حيث تُنشأ المشاريع الجديدة.

source: Save all open documents before building anything
ar: اِحفظ كل الوثائق المفتوحة قبل بناء أي شيء

source: If this option is set all open documents will be automatically saved before any build is started.
ar: إن ضُبِط هذا الخيار كل الوثائق المفتوحة سـ تُحفظ آليًا قبل بدء أي بناء.

source: Projects
ar: المشاريع

source: Configure Projects
ar: اضبط المشاريع

# @info:tooltip
source: Select the base directory where new projects are to be created
ar: اِختر المجلد مبدئي حيث سـ تُنشأ المشاريع الجديدة

# @label:textbox
source: Projects base directory:
ar: مجلد المشاريع مبدئي:

# @info:tolltip
source: Parse all files in a project after the project has been opened
ar: حَلِّل كل الملفات في المشروع بعد فتح المشروع

# @option:check
source: Schedule all project files for parsing
ar: جَدْوِل كل ملفات المشروع لـ تحليلها

# @info:tooltip
source: Save all modified documents when the "build" action is triggered
ar: اِحفظ كل الوثائق المُعدَّلة عند تفعيل إجراء "بناء"

# @option:check
source: Save all documents before building
ar: اِحفظ كل الوثائق قبل البناء

source: Runtimes
ar: أوقات التشغيل

source: Configure Runtimes
ar: اضبط أوقات التشغيل

source: Source Formatter
ar: منسِّق المصدر

source: Configure Source Formatter
ar: اضبط منسِّق المصدر

# @title:group
source: General
ar: عامّ

# @info:tolltip
source: Override the editor indentation mode according to the formatting style for documents without Kate modeline.
ar: تجاوز وضع مسافة بادئة للمحرر حسب أسلوب التنسيق للمستندات دون علامة طراز Kate.

# @option:check
source: Override Kate Indentation Mode
ar: تجاوز وضع مسافة بادئة Kate

# @info:tooltip
source: Add a Kate modeline according to the formatting style to formatted documents.
ar: أضِف علامة طراز Kate حسب أسلوب التنسيق إلى المستندات المنسَّقة.

# @option:check
source: Add Kate Modeline
ar: أضِف علامة طراز Kate

# @title:group
source: Formatting Styles
ar: أنماط التنسيق

source: Templates
ar: القوالب

source: Configure Templates
ar: اضبط القوالب

# @action:button
source: Get More Templates
ar: أحضر المزيد من القوالب

# @action:button
source: Load Template From File
ar: حمِّل قالباً من ملف

# @action:button
source: Clone Template
ar: انسخ القالب

source: User Interface
ar: واجهة المستخدم

# @title:group
source: Dock Window Behavior
ar: سلوك نافذة الرصيف

source: <p>Controls whether the bottom left corner is occupied by the dock at the left, or by the dock at the bottom.</p>
ar: <p>تحكَّم فيما إذا كانت الزاوية السفلية اليسرى مشغولة بالرصيف على اليسار، أو بالرصيف في الأسفل.</p>

# @label:listbox
source: Bottom left corner occupied by:
ar: الزاوية السفلية اليسرى مشغولة بواسطة:

source: <p>Controls whether the bottom right corner is occupied by the dock at the right, or by the dock at the bottom.</p>
ar: <p>تحكَّم فيما إذا كانت الزاوية السفلية اليمنى مشغولة بالرصيف على اليمين، أو بالرصيف في الأسفل.</p>

# @label:listbox
source: Bottom right corner occupied by:
ar: الزاوية السفلية اليمنى مشغولة بواسطة:

# @item:inlistbox
source: Left Dock
ar: الرصيف الأيسر

# @item:inlistbox
source: Bottom Dock
ar: الرصيف السفلي

# @item:inlistbox
source: Right Dock
ar: الرصيف الأيمن

# @title:group
source: Tabbed Browsing
ar: تصفح مبوّب

# @info:tooltip
source: Controls whether to open new tabs next to the active one.
ar: تحكَّم فيما إذا تفتح ألسنة جديدة بجوار النشطة.

# @option:check
source: Open new tab after current
ar: اِفتح لساناً جديداً بعد الحالي

# @info:tooltip
source: When enabled, plugins can group related files side by side. For example, a header file will be opened next to the implementation file.
ar: عند التمكين، الملحقات يمكنها تجميع الملفات المرتبطة جنباً إلى جنب. على سبيل المثال، ملف ترويسة سيفتح بجوار ملف التنفيذ.

# @option:check
source: Arrange related documents side by side
ar: رتب المستندات المرتبطة جنباً إلى جنب

# @info:tooltip
source: Enables or disables the display of the tab bar at the top of the editor window.
ar: مكِّن أو عطّل عرض شريط الألسنة في أعلى نافذة المحرر.

# @option:check
source: Show tabs
ar: أظهر الألسنة

# @info:tooltip
source: Enables or disables the display of a close button in each tab in the tab bar at the top of the editor window.
ar: مكِّن أو عطّل عرض زر إغلاق في كل لسان في شريط الألسنة في أعلى نافذة المحرر.

# @option:check
source: Show close buttons on tabs
ar: أظهر زر الإغلاق على الألسنة

# @title:group
source: Coloring
ar: تلوين

# @info:tooltip
source: When enabled, tabs and other widgets are colored based on the project affiliation
ar: عند التمكين، الألسنة والودجات الأخرى تلوّن بناء على الانتماء للمشروع

# @option:check
source: Color widgets based on the project affiliation
ar: لوِّن الودجات بناء على الانتماء للمشروع

source: Configure User Interface
ar: اضبط واجهة المستخدِم

# @action
source: &Reformat Source
ar: &أعِد تنسيق المصدر

# @action
source: Reformat Line
ar: أعِد تنسيق السطر

# @action
source: Reformat Files...
ar: أعِد تنسيق الملفات...

# @info:tooltip
source: Format file(s) using the configured source formatter(s)
ar: نسِّق الملف/الملفات باستِخدام منسِّق/منسِّقات المصدر المضبوط/المضبوطة

# @info:whatsthis
source: Formatting functionality using the configured source formatter(s).
ar: وظيفة التنسيق باستِخدام منسِّق/منسِّقات المصدر المضبوط/المضبوطة.

# @info:tooltip
source: Reformat selection or file using <i>%1</i> (<b>%2</b>)
ar: أعِد تنسيق التحديد أو الملف باستِخدام <i>%1</i> (<b>%2</b>)

# @info:whatsthis
source: Reformats selected text or the entire file if nothing is selected, using <i>%1</i> tool with <b>%2</b> style.
ar: يعيد تنسيق النص المحدَّد أو الملف بأكمله إن لم يحدد شيء، باستِخدام أداة <i>%1</i> وبأسلوب <b>%2</b>.

# @info:tooltip
source: Reformat current line using <i>%1</i> (<b>%2</b>)
ar: أعِد تنسيق السطر الحالي باستِخدام <i>%1</i> (<b>%2</b>)

# @info:whatsthis
source: Source reformatting of line under cursor using <i>%1</i> tool with <b>%2</b> style.
ar: إعادة تنسيق سطر المصدر تحت المؤشر باستِخدام أداة <i>%1</i> وبأسلوب <b>%2</b>.

# @info:tooltip
source: Reformat selection or file using the configured source formatter
ar: أعِد تنسيق التحديد أو الملف باستِخدام منسِّق المصدر المضبوط

# @info:whatsthis
source: Reformats selected text or the entire file if nothing is selected, using the configured source formatter.
ar: يعيد تنسيق النص المحدَّد أو الملف بأكمله إن لم يحدد شيء، باستِخدام منسِّق المصدر المضبوط.

# @info:tooltip
source: Reformat current line using the configured source formatter
ar: أعِد تنسيق السطر الحالي باستِخدام منسِّق المصدر المضبوط

# @info:whatsthis
source: Source reformatting of line under cursor using the configured source formatter.
ar: إعادة تنسيق سطر المصدر تحت المؤشر باستِخدام منسِّق المصدر المضبوط.

# @title:window
source: Reformat Files?
ar: إعادة تنسيق الملفات؟

source: Reformat all files in the selected folder?
ar: أعِد تنسيق كل الملفات في المجلد المحدَّد؟

# @action:button
source: Reformat
ar: أعِد التنسيق

source: Reformatting
ar: إعادة تنسيق

source: Reformat Files
ar: أعِد تنسيق الملفات

source: Reformatting one file
ar: إعادة تنسيق ملف واحد

source: The style %1 is also used for the following languages: %2. Are you sure you want to delete it?
ar: الأسلوب %1 مستخدَم أيضاً للغات التالية: %2. هل أنت متأكِّد أنك تُريد حذفه؟

# @title:window
source: Deleting Style
ar: حذف الأسلوب

source: New %1
ar: جديد %1

# @label:listbox
source: Language:
ar: اللغة:

source: How to configure formatting styles
ar: كيفية ضبط أساليب التنسيق

source: <p>Select languages you use one by one from the <i>Language</i> combobox below, pick the desired formatter and style for each. <i>Ctrl+Click</i> a selected style to unselect it.</p> <p>Configuring the right formatter and style for each used language is very important: not only explicit <i>Reformat Source</i>/<i>Line</i>/<i>Files...</i> actions are affected, but also the formatting of auto-generated, auto-refactored or auto-fixed code (for example, <i>Rename</i> context menu action).</p> <p>Note that KDevelop formats all <i>*.h</i> files with formatter and style configured for <i>C</i> language, even C++ headers that belong to a pure C++ project. This occurs because source formatter maps MIME types to languages.</p>
ar: <p>اِختر اللغات التي تستخدمها واحدة تلو الأخرى من مربع التحرير والسرد <i>اللغة</i> في الأسفل، واختر المنسِّق والأسلوب المرغوب لكل منها. <i>انقر مع Ctrl</i> على أسلوب محدَّد لإلغاء تحديده.</p> <p>ضبط المنسِّق والأسلوب الصحيح لكل لغة مستخدَمة مهم جداً: لا تتأثر إجراءات <i>أعِد تنسيق المصدر</i>/<i>السطر</i>/<i>الملفات...</i> الصريحة فقط، بل أيضاً تنسيق الشفرة المولَّدة آلياً أو المُنقَّحة آلياً أو المُصحَّحة آلياً (على سبيل المثال، إجراء قائمة السياق <i>إعادة تسمية</i>).</p> <p>لاحظ أن KDevelop ينسِّق كل ملفات <i>*.h</i> باستِخدام منسِّق وأسلوب مضبطين للغة <i>C</i>، حتى ترويسات C++ التي تنتمي إلى مشروع C++ بحت. يحدث هذا لأن منسِّق المصدر يربط أنواع MIME باللغات.</p>

# @label:listbox
source: Formatter:
ar: المنسِّق:

source: Description of a selected formatter
ar: وصف لمنسِّق محدَّد

# @label:listbox
source: Style:
ar: النمط:

# @action:button
source: New
ar: جديد

# @action:button
source: Edit...
ar: حرّر...

# @action:button
source: Delete
ar: احذف

source: The file "%1" is modified on disk. Are you sure you want to overwrite it? (External changes will be lost.)
ar: جرى تعديل الملف "%1" على القرص. هل أنت متأكِّد أنك تُريد الكتابة فوقه؟ (ستُفقد التغييرات الخارجية.)

# @title:window
source: Document Externally Modified
ar: مستند معدَّل خارجياً

source: Line: %1 Col: %2
ar: السّطر: %1 العمود: %2

# area
source: Code
ar: شفرة

# area
source: Debug
ar: التنقيح

# area
source: Review
ar: المراجعة

# @title:window
source: Select Tool View to Add
ar: اِختر عرض أداة للإضافة

source: <b>Active Working Set</b>
ar: <b>مجموعة العمل النشطة</b>

source: <b>Working Set</b>
ar: <b>مجموعة العمل</b>

# @info:tooltip
source: Remove this working set. The contained documents are not affected.
ar: أزِل مجموعة العمل هذه. المستندات التي تحتويها لا تتأثر.

# @label
source: Documents:
ar: الوثائق:

# @action:button
source: Add All
ar: أضف الكلّ

# @info:tooltip
source: Add all documents that are part of this working set to the currently active working set
ar: أضِف كل المستندات التي هي جزء من مجموعة العمل هذه إلى مجموعة العمل النشطة حالياً

# @action:button
source: Remove All
ar: أزل الكل

# @info:tooltip
source: Remove all documents that are part of this working set from the currently active working set
ar: أزِل كل المستندات التي هي جزء من مجموعة العمل هذه من مجموعة العمل النشطة حالياً

# @info:tooltip
source: Click to open and activate this document.
ar: اِنقر لفتح وتنشيط هذا المستند.

# @info:tooltip
source: Remove this file from the current working set
ar: أزِل هذا الملف من مجموعة العمل الحالية

# @info:tooltip
source: Add this file to the current working set
ar: أضِف هذا الملف إلى مجموعة العمل الحالية

# @action:button
source: Stash
ar: التخزين المؤقت

# @action:button
source: Load
ar: حمّل

source: Line: 00000 Col: 000
ar: السّطر: 00000 العمود: 000

# @info:tooltip
source: Show sorted list of opened documents
ar: اِعرض قائمة مرتَّبة للمستندات المفتوحة

# @info
source: (Press Ctrl+Tab to switch)
ar: (اِضغط Ctrl+Tab للتبديل)

# @action:inmenu
source: Copy Filename
ar: انسخ اسم الملفّ

# @action:inmenu
source: Close
ar: أغلق اللسان

# @action:inmenu
source: Close All Other
ar: أغلق كلّ الأخرى

# @action:inmenu
source: Close All
ar: أغلق الكل

# @info:tooltip
source: Toggle '%1' tool view
ar: بدِّل عرض أداة '%1'

# @info:tooltip
source: Right click to add new tool views.
ar: اِنقر بالزر الأيمن لإضافة عروض أدوات جديدة.

# @title:window
source: %1 Toolbar
ar: شريط الأدوات %1

source: Left Button Bar
ar: شريط الأزرار الأيسر

source: Right Button Bar
ar: شريط الأزرار الأيمن

source: Bottom Button Bar
ar: شريط الأزرار السفلي

# @title:menu
source: Tool View Position
ar: موضع عرض الأداة

# @option:radio tool view position
source: Left
ar: يسار

# @option:radio tool view position
source: Bottom
ar: الأسفل

# @option:radio tool view position
source: Right
ar: يمين

# @option:radio tool view position
source: Detached
ar: منفصل

# @action:inmenu
source: Assign Shortcut...
ar: اضبط اختصارًا...

# @info:tooltip
source: Use this shortcut to trigger visibility of the tool view.
ar: اِستخدِم هذا الاختصار لتشغيل رؤية عرض الأداة.

# @action:inmenu
source: Remove Tool View
ar: أزِل عرض الأداة

# @title:window
source: Assign Shortcut For '%1' Tool View
ar: اِسنِد اختصاراً لعرض أداة '%1'

# @option:check
source: Concentration Mode
ar: وضع التركيز
