Repository: KDE/kdevelop
Catalog: po/*/kdevqmakemanager.po
Languages: ar, fi, pl, zh_tw

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
fi: Tommi Nieminen
pl: Łukasz Wojniłowicz
zh_tw: Frank Weng (a.k.a. Franklin), Kisaragi Hiu

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
fi: translator@legisign.org
pl: lukasz.wojnilowicz@gmail.com
zh_tw: franklin@goodhorse.idv.tw, mail@kisaragi-hiu.com

source: Please specify path to QMake executable.
ar: حدد مسار ملف QMake التنفيذي.
fi: Anna QMake-ohjelmatiedoston sijainti.
pl: Proszę podać ścieżkę do pliku wykonywalnego QMake.
zh_tw: 請指定 QMake 執行檔的路徑。

source: QMake executable "%1" does not exist.
ar: ملف QMake التنفيذي ”%1“ غير موجود.
fi: QMake-ohjelmatiedostoa ”%1” ei ole olemassa.
pl: Plik wykonywalny QMake "%1" nie istnieje.
zh_tw: QMake 執行檔 "%1" 不存在。

source: QMake executable is not a file.
ar: ملف QMake التنفيذي ليس ملفًا.
fi: QMake-ohjelmatiedosto ei ole tiedosto.
pl: Plik wykonywalny QMake nie jest plikiem.
zh_tw: QMake 執行檔不是檔案。

source: QMake executable is not executable.
ar: ملف QMake التنفيذي ليس قابلاً للتنفيذ.
fi: QMake-ohjelmatiedosto ei ole suoritettava.
pl: Plik wykonywalny QMake nie jest wykonywalny.
zh_tw: QMake 執行檔沒有執行權限。

source: QMake executable cannot be queried for variables.
ar: لا يمكن الاستعلام عن متغيرات ملف QMake التنفيذي.
fi: QMake-ohjelmatiedostolta ei voi kysyä muuttujia.
pl: Plik wykonywalny QMake nie może być odpytany o zmienne.
zh_tw: QMake 執行檔無法用來詢問變數。

source: No basic MkSpec file could be found for the given QMake executable.
ar: لا يمكن العثور على ملف MkSpec أساسي لملف QMake التنفيذي المُعطى.
fi: Annetulle QMake-ohjelmatiedostolle ei löydy MkSpec-perustiedostoa.
pl: Nie znaleziono podstawowego pliku MkSpec dla danego pliku wykonywalnego QMake.
zh_tw: 找不到指定 QMake 執行檔的基礎 MkSpec 檔案。

source: Please specify a build folder.
ar: حدد مجلد البناء.
fi: Anna koostamiskansio.
pl: Proszę podać katalog budowania.
zh_tw: 請指定建構資料夾。

# @label:textbox
source: QMake &executable:
ar: ملف QMake &التنفيذي:
fi: &QMake-ohjelmatiedosto:
pl: Plik wykonywalny QMak&e:
zh_tw: QMake 執行檔(&E)：

# @label:textbox
source: &Build directory:
ar: دليل &البناء:
fi: &Koostamiskansio:
pl: Katalog &budowania:
zh_tw: 編譯目錄(&B)：

# @label:textbox
source: &Install to (target.path):
ar: &نصّب إلى (target.path):
fi: &Asenna kohteeseen (sijainti):
pl: Wgraj do (cel.śc&ieżka):
zh_tw: 安裝到 (target.path)(&I)：

# @labal:listbox
source: Build &type:
ar: ن&وع البناء:
fi: Koostamist&yyppi:
pl: &Rodzaj budowania:
zh_tw: 編譯型態(&T)：

# @item:inlistbox
source: (Use default from .pro file)
ar: (استخدم مبدئي من ملف ‎.pro)
fi: (käytä oletusta .pro-tiedostosta)
pl: (Użyj domyślnych z pliku .pro)
zh_tw: （使用來自 .pro 檔案的預設）

# @label:textbox
source: Extra arguments:
ar: وسائط إضافية:
fi: Lisäparametrit:
pl: Dołącz argumenty:
zh_tw: 額外的參數：

# @title:window
source: Configure a Build Directory
ar: اضبط دليل بناء
fi: Aseta koostamiskansio
pl: Ustawienia katalogu budowania
zh_tw: 設定編譯目錄

source: Run QMake in %1
ar: شغّل QMake في %1
fi: Suorita QMake kansiossa %1
pl: uruchom QMake w %1
zh_tw: 在 %1 裡執行 QMake

source: *** Exited with return code: %1 ***
ar: *** خرج برمز الإرجاع: %1 ***
fi: *** Päättyi paluuarvolla: %1 ***
pl: *** Wyszedł z kodem zwrotnym: %1 ***
zh_tw: *** 已結束，返回碼為：%1 ***

source: *** Process aborted ***
ar: *** أُجهِضت العملية ***
fi: *** Prosessi keskeytettiin ***
pl: *** Proces został przerwany ***
zh_tw: *** 行程已中止 ***

source: *** Crashed with return code: %1 ***
ar: *** اِنهار برمز الإرجاع: %1 ***
fi: *** Kaatui paluuarvolla: %1 ***
pl: *** Usterka z kodem zwrotnym: %1 ***
zh_tw: *** 已崩潰，返回碼為：%1 ***

# @action
source: Run QMake
ar: شغّل QMake
fi: Suorita QMake
pl: Uruchom QMake
zh_tw: 執行 QMake
