Repository: KDE/kdevelop
Catalog: po/*/kdevpatchreview.po
Languages: ar, he

source: Custom Patch
ar: رقعة مخصّصة
he: טלאי מותאם אישית

# @title:group
source: Patch
ar: رقعة
he: טלאי

# @label:textbox
source: Base directory:
ar: دليل القاعدة:
he: תיקיית בסיס:

# @info:placeholder
source: /path/to/patch/base
ar: /مسار/إلى/قاعدة/الرقعة

# @title:tab
source: From File
ar: من ملف
he: מקובץ

# @info:placeholder
source: /path/to/patch
ar: /مسار/إلى/رقعة

# @title:tab
source: From Command
ar: من أمر
he: מפקודה

# @info:placeholder
source: Enter command to take output from...
ar: أدخِل الأمر الذي يؤخذ منه الخرج...
he: נא למלא פקודה ממנה ללכוד את הפלט…

# @info:tooltip
source: Patch is already applied on local version
ar: الرقعة مطبّقة مسبقًا على الإصدار المحلي
he: הטלאי כבר חל על הגרסה המקומית

# @option:check
source: Already applied
ar: مطبّقة مسبقًا
he: כבר חל

source: <b><span style="color:red">Conflict</span></b><br/>
ar: <b><span style="color:red">تعارض</span></b><br/>
he: <b><span style="color:red">סתירה</span></b><br/>

source: Applied.<br/>
ar: طبّقت.<br/>
he: חל.<br/>

source: Insertion<br/>
ar: إدراج<br/>
he: הוספה<br/>

source: Removal<br/>
ar: إزالة<br/>
he: הסרה<br/>

source: Previous:<br/>
ar: سابق:<br/>
he: הקודם:<br/>

source: Reverted.<br/>
ar: رجعت.<br/>
he: הוחזר אחורה.<br/>

source: Alternative:<br/>
ar: بديل:<br/>
he: חלופה:<br/>

source: Could not apply the change: Text should be "%1", but is "%2".
ar: لا يمكن تطبيق التغيير: النص يجب أن يكون ”%1“، لكنه ”%2“.
he: לא ניתן להחיל את השינוי: הטקסט אמור להיות „%1”, אבל הוא „%2”.

# @item
source: Insertion
ar: إدراج
he: הוספה

# @item
source: Removal
ar: الإزالة
he: הסרה

# @item
source: Change
ar: تغيير
he: שינוי

# @title:window
source: Kompare Model Update
ar: تحديث نموذج Kompare
he: עדכון מודל של Kompare

# @title complete patch
source: Overview
ar: لمحة عامة
he: סקירה

# @title:window
source: Patch Review
ar: مراجعة الرقعة
he: סקירת טלאי

source: The base directory of the patch must be an absolute directory.
ar: دليل القاعدة للرقعة يجب أن يكون دليلًا مطلقًا.
he: תיקיית הבסיס של הטלאי חייבת להיות תיקייה מוחלטת.

# @action
source: Finish Review
ar: أنهِ المراجعة
he: סיום סקירה

# @action:inmenu
source: Review Patch
ar: راجع الرقعة
he: סקירת טלאי

# @info:tooltip
source: Previous file
ar: الملف السابق
he: הקובץ הקודם

# @info:tooltip
source: Previous difference
ar: الاختلاف السابق
he: ההבדל הקודם

# @info:tooltip
source: Next difference
ar: الاختلاف التالي
he: ההבדל הבא

# @info:tooltip
source: Next file
ar: الملف التالي
he: הקובץ הבא

# @action:button
source: Update
ar: حدّث
he: עדכון

# @action:button
source: Run Tests
ar: شغّل الاختبارات
he: הרצת בדיקות

# @action:button
source: Export Diff...
ar: صدّر التباين...
he: ייצוא הבדלים…

# @action:button
source: Cancel Review
ar: ألغِ المراجعة
he: ביטול סקירה

# @action:button
source: Finish Review
ar: أنهِ المراجعة
he: סיום סקירה

# @title:group
source: Changes
ar: التغييرات
he: שינויים

# %1: number of changed hunks, %2: file name
source: %2 (1 hunk)
ar: %2 (رقعة واحدة)
he: %2 (גוש אחד)

source: <qt>You can find the new request at:<br /><a href='%1'>%1</a> </qt>
ar: <qt>يمكنك إيجاد الطلب الجديد في:<br /><a href='%1'>%1</a> </qt>
he: <qt>אפשר למצוא את הבקשה החדשה תחת:<br /><a href='%1'>%1</a> </qt>

source: Couldn't export the patch. %1
ar: لا يمكن تصدير الرقعة. %1
he: לא ניתן לייצא את הטלאי. %1

# @action
source: Select All
ar: اختر الكل
he: בחירה בהכול

# @action
source: Deselect All
ar: ألغِ اختيار الكل
he: ביטול בחירה

source: Running tests: %p%
ar: شغّل الاختبارات: %p%
he: בדיקות רצות: %p%

source: Test passed
ar: الاختبار نجح
he: בדיקה עברה

source: Test results: %1 passed, %2 failed, %3 errors
ar: نتائج الاختبار: %1 ناجحة، %2 فاشلة، %3 أخطاء
he: תוצאות בדיקות: %1 עברו, %2 נכשלו, %3 עם שגיאה
