Repository: KDE/kdevelop
Catalog: po/*/kdevcontextbrowser.po
Languages: eu, he

# @info:tooltip
source: Go back in context history
eu: Joan testuinguru-historian atzera
he: חזרה אחורה בהיסטוריית ההקשר

# @info:tooltip
source: Go forward in context history
eu: Joan testuinguru-historian aurrera
he: התקדמות קדימה בהיסטוריית ההקשר

# item quick open item type
source: Outline
eu: Laburpena
he: מתאר

# @info:placeholder
source: Outline
eu: Laburpena
he: מתאר

# @info:tooltip
source: Navigate outline of active document, click to browse
eu: Nabigatu dokumentu aktiboaren laburpena, egin klik arakatzeko
he: מתאר ניווט של המסמך הפעיל, לחיצה לעיון

# @action
source: Source &Browse Mode
eu: Sorburua a&rakatzeko modua
he: מצב &סיור מקור

# @action
source: &Previous Visited Context
eu: Bisitatutako &aurreko testuingurua
he: ההקשר ה&קודם בו ביקרת

# @action
source: &Next Visited Context
eu: Bisitatutako &hurrengo testuingura
he: ההקשר ה&בא בו ביקרת

# @action
source: &Previous Use
eu: &Aurreko erabilera
he: השימוש ה&קודם

# @action
source: &Next Use
eu: &Hurrengo erabilera
he: השימוש ה&בא

# @action
source: Context Browser
eu: Testuinguru arakatzailea
he: סייר הקשרים

# @title:window
source: Code Browser
eu: Kode arakatzailea
he: דפדפן קוד

# @action
source: Find Uses
eu: Aurkitu erabilerak
he: איתור שימושים

source: (changed)
eu: (aldatuta)
he: (השתנה)

# @info:tooltip
source: Show declaration menu
eu: Erakutsi deklarazio-menua
he: הצגת תפריט הכרזות

# @action
source: Declaration Menu
eu: Deklarazio-menua
he: תפריט הכרזות

# @action
source: Lock Current View
eu: Giltzatu uneko ikuspegia
he: נעילת התצוגה הנוכחית

# @info:tooltip
source: Lock current view
eu: Giltzatu uneko ikuspegia
he: נעילת התצוגה הנוכחית

# @action
source: Unlock Current View
eu: Giltzatik askatu uneko ikuspegia
he: שחרור התצוגה הנוכחית

# @info:tooltip
source: Unlock current view
eu: Giltzatik askatu uneko ikuspegia
he: שחרור התצוגה הנוכחית

source: Code Browser Toolbar
eu: Kode arakatzailearen tresna-barra
he: סרגל כלי דפדפן קוד
