Repository: KDE/kdevelop
Catalog: po/*/kdevcppcheck.po
Languages: ar, el, zh_tw

# @title:tab
source: Configure Cppcheck Settings
ar: اضبط إعدادات Cppcheck
el: Διαμόρφωση ρυθμίσεων cppcheck
zh_tw: 調整 Cppcheck 設定

# @title:group
source: Paths
ar: المسارات
el: Διαδρομές
zh_tw: 路徑

# @label:chooser
source: Cppchec&k executable:
ar: ملف Cppchec&k التنفيذي:
el: Cppchec&k εκτελέσιμο:
zh_tw: Cppchec&k 執行檔：

# @title:group
source: Output
ar: المخرجات
el: Έξοδος
zh_tw: 輸出

# @option:check
source: Hide output view during check
ar: إخفاء عرض المخرجات أثناء الفحص
el: Απόκρυψη προβολής εξόδου στον έλεγχο
zh_tw: 檢查時隱藏輸出檢視

# @option:check
source: Show Cppcheck XML output in the output view
ar: عرض مخرجات Cppcheck بصيغة XML في عرض المخرجات
el: Εμφάνιση εξόδου Cppcheck XML στην προβολή εξόδου
zh_tw: 在輸出檢視中顯示 Cppcheck XML 輸出

# @title:tab
source: Checks
ar: ألسنة الفحوص
el: Έλεγχοι
zh_tw: 檢查

# @info:tooltip
source: Check for unused functions. It is recommend to only enable this when the whole program is scanned
ar: افحص عن الدوال غير المستخدَمة. يوصَى بتمكين هذا عند فحص البرنامج بالكامل فقط
el: έλεγχος για αχρησιμοποίητες συναρτήσεις. Συνιστάται να ενεργοποιείται αυτό όταν σαρώνεται όλο το πρόγραμμα
zh_tw: 檢查未使用的函式。建議只在掃描整個程式時才啟用此選項

# @option:check
source: Unused function
ar: دالة غير مستخدَمة
el: Αχρησιμοποίητη συνάρτηση
zh_tw: 未使用的函式

# @info:tooltip
source: Allow that Cppcheck reports even though the analysis is inconclusive. There are false positives with this option. Each result must be carefully investigated before you know if it is good or bad.
ar: يسمح لـ Cppcheck بالإبلاغ حتى لو كان التحليل غير حاسم. هناك نتائج إيجابية خاطئة مع هذا الخيار. يجب التحقيق بعناية في كل نتيجة قبل المعرفة إذا كانت جيدة أو سيئة.
el: Να επιτρέπονται οι αναφορές cppcheck ακόμη και αν η ανάλυση είναι ασαφής. Υπάρχουν ψευδοθετικά με αυτήν την επιλογή. Κάθε αποτέλεσμα πρέπει να διερευνείται προσεκτικά πριν αποφασίσετε αν είναι καλό ή κακό.

# @option:check
source: Inconclusive analysis
ar: تحليل غير حاسم
el: Ασαφής ανάλυση

# @info:tooltip
source: Enable information messages
ar: مكّن رسائل المعلومات
el: Ενεργοποίηση μηνυμάτων πληροφοριών
zh_tw: 啟用資訊訊息

# @option:check
source: Information
ar: معلومات
el: Πληροφορίες
zh_tw: 資訊

# @info:tooltip
source: Warn if there are missing includes. For detailed information use 'check-config'
ar: حذّر إذا كانت هناك ملفات تضمين (includes) مفقودة. للمعلومات المفصّلة استخدم 'check-config'
el: Να υπάρχει προειδοποίηση για includes που λείπουν. Για λεπτομερείς πληροφορίες χρησιμοποιήστε 'check-config'
zh_tw: 有缺乏引入時警告。詳細資訊請使用 'check-config'

# @option:check
source: Missing include
ar: تضمين مفقود
el: Include που λείπουν
zh_tw: 缺乏引入

# @info:tooltip
source: Enable performance messages
ar: مكّن رسائل الأداء
el: Ενεργοποίηση μηνυμάτων απόδοσης
zh_tw: 啟用效能訊息

# @option:check
source: Performance
ar: أداء
el: Απόδοση
zh_tw: 效能

# @info:tooltip
source: <p>Force checking of files that have a lot of configurations. Error is printed if such a file is found so there is no reason to use this by default. If used together with '--max-configs=', the last option is the one that is effective.<br/><br/>Be careful with using this option - it can dramatically slow checking.</p>
ar: <p>فرض فحص الملفات التي تحتوي على الكثير من التشكيلات. يطبع خطأ إذا وجد مثل هذا الملف، لذلك لا يوجد سبب لاستخدامه مبدئيًا. إذا استُخدم مع '--max-configs='، فالخيار الأخير هو الفعال.<br/><br/>كن حذرًا عند استخدام هذا الخيار - قد يبطئ الفحص بشكل كبير.</p>
el: <p>Εξαναγκασμός ελέγχου αρχείων με πολλές διαμορφώσεις. Το σφάλμα εμφανίζεται αν ένα τέτοιο αρχείο έχει βρεθεί έτσι δεν χρειάζεται να το χρησιμοποιήσετε αυτό εξ ορισμού. Αν χρησιμοποιείται μαζί με '--max-configs=', η τελευταία επιλογή είναι αυτή που έχει αποτέλεσμα.<br/><br/>Προσέξτε με αυτήν την επιλογή - ίσως να επιβραδύνει δραματικά τον έλεγχο.</p>

# @option:check
source: Force checking
ar: فرض الفحص
el: Εξαναγκασμός ελέγχου
zh_tw: 強制檢查

# @info:tooltip
source: Enable portability messages
ar: مكّن رسائل قابلية النقل
el: Ενεργοποίηση μηνυμάτων συμβατότητας
zh_tw: 啟用可移植性訊息

# @option:check
source: Portability
ar: قابلية النقل
el: Συμβατότητα
zh_tw: 可移植性

# @info:tooltip
source: Enable all coding style checks. All messages with the severities 'style', 'performance' and 'portability' are enabled.
ar: مكّن كل فحوص نمط الترميز. تُفعَّل جميع الرسائل ذات الخطورة 'style' و 'performance' و 'portability'.
el: Ενεργοποίηση όλων των ελέγχων στο στιλ κώδικα. Όλα τα μηνύματα με τις σπουδαιότητες 'στιλ', 'απόδοση', και 'συμβατότητα' ενεργοποιούνται.
zh_tw: 啟用所有程式碼風格檢查。會啟用所有嚴重程度為 'style'（風格）、'performance'（效能）或 'portability'（可移植性）的訊息。

# @option:check
source: Style
ar: نمط
el: Στιλ
zh_tw: 風格

# @info:tooltip
source: Check Cppcheck configuration. The normal code analysis is disabled by this flag.
ar: افحص إعداد Cppcheck. يُعطَّل تحليل الترميز العادي بهذا الوسم.
el: έλεγχος cppcheck διαμόρφωσης. Η κανονική ανάλυση κώδικα απενεργοποιείται με αυτήν τη σημαία.
zh_tw: 檢查 Cppcheck 的設定。普通的程式碼分析會被此旗標停用。

# @option:check
source: Check config
ar: افحص الإعداد
el: Έλεγχος διαμόρφωσης
zh_tw: 檢查設定

# @title:tab
source: Include Directories
ar: ألسنة التضمين
el: Κατάλογοι include
zh_tw: 引入目錄

# @info:tooltip
source: Add 'project' include directories to Cppcheck arguments. This option adds only paths related with project's root and build directories.
ar: أضف أدلة تضمين 'المشروع' إلى وسائط Cppcheck. يضيف هذا الخيار المسارات المتعلقة بالجذر وأدلة البناء للمشروع فقط.
el: Προσθήκη include καταλόγων 'έργου' σε Cppcheck ορίσματα. Αυτή η επιλογή προσθέτει μόνο διαδρομές σχετικές με τον root του έργου και τους καταλόγους κατασκευής.

# @option:check
source: Use 'project' include dirs
ar: استخدم أدلة تضمين 'المشروع'
el: Χρήση include καταλόγων 'έργου'
zh_tw: 使用「專案」引入目錄

# @info:tooltip
source: <p>Add other, 'system' include directories to Cppcheck arguments.<br/><br/>Be careful with using this option - it can dramatically slow checking.</p>
ar: <p>أضف أدلة تضمين 'النظام' الأخرى إلى وسائط Cppcheck.<br/><br/>كن حذرًا عند استخدام هذا الخيار - فقد يبطئ الفحص بشكل كبير.</p>
el: <p>Προσθήκη άλλων, include καταλόγων 'συστήματος' σε Cppcheck ορίσματα.<br/><br/>Να είστε προσεκτικοί με αυτήν την επιλογή - ίσως να επιβραδύνει δραματικά τον έλεγχο</p>

# @option:check
source: Use 'system' include dirs
ar: استخدم أدلة تضمين 'النظام'
el: Χρήση include καταλόγων 'συστήματος'
zh_tw: 使用「系統」引入目錄

# @label:textbox
source: &Ignored includes:
ar: التضمينات الم&تجاهلة:
el: &Αγνοημένα includes:
zh_tw: 忽略的引入(&I)

# @info:tooltip
source: <html> <p>Defines semicolon-separated list of ignored include directories.</p> <p>You can use the following placeholders:</p> <p><b><tt>%p</tt></b> - Gets replaced by the URL of the project's root directory.</p> <p><b><tt>%b</tt></b> - Gets replaced by the URL of the project's build directory.</p> </html>
ar: <html> <p>يُعرِّف قائمة مفصولة بفاصلة منقوطة لأدلة التضمين المتجاهلة.</p> <p>يمكنك استخدام العلامات النائبة التالية:</p> <p><b><tt>%p</tt></b> - تستبدل بعنوان URL لدليل جذر المشروع.</p> <p><b><tt>%b</tt></b> - تستبدل بعنوان URL لدليل بناء المشروع.</p> </html>
el: <html> <p>Ορίζει λίστα διαχωρισμένη με άνω-κάτω τελεία με τους αγνοημένους include καταλόγους.</p> <p>Μπορείτε να χρησιμοποιείτε τους ακόλουθους αντικαταστάτες:</p> <p><b><tt>%p</tt></b> - Αντικαθίσταται με το URL του καταλόγου root του έργου.</p> <p><b><tt>%b</tt></b> - Αντικαθίσταται με το URL του καταλόγου κατασκευής του έργου.</p> </html>

# @title:tab
source: Extra Parameters
ar: ألسنة المعاملات الإضافية
el: Επιπλέον παράμετροι
zh_tw: 額外參數

# @label:textbox
source: Ex&tra parameters:
ar: المعاملات الإضا&فية:
el: Ε&πιπλέον παράμετροι:
zh_tw: 額外參數(&T)：

# @info:tooltip
source: <html> <p>Defines additional parameters for cppcheck (see documentation).</p> <p>You can use the following placeholders:</p> <p><b><tt>%p</tt></b> - Gets replaced by the URL of the project's root directory.</p> <p><b><tt>%b</tt></b> - Gets replaced by the URL of the project's build directory.</p> </html>
ar: <html> <p>يُعرِّف معاملات إضافية لـ cppcheck (راجع التوثيق).</p> <p>يمكنك استخدام العلامات النائبة التالية:</p> <p><b><tt>%p</tt></b> - تستبدل بعنوان URL لدليل جذر المشروع.</p> <p><b><tt>%b</tt></b> - تستبدل بعنوان URL لدليل بناء المشروع.</p> </html>
el: <html> <p>Ορίζει πρόσθετες παραμέτρους για το cppcheck (δείτε την τεκμηρίωση).</p> <p>Μπορείτε να χρησιμοποιήσετε τους ακόλουθους αντικαταστάτες:</p> <p><b><tt>%p</tt></b> - Αντικαθίσταται με το URL του καταλόγου root του έργου.</p> <p><b><tt>%b</tt></b> - Αντικαθίσταται με το URL του καταλόγου κατασκευής του έργου.</p> </html>

# @title:group
source: Command Line
ar: سطر الأوامر
el: Γραμμή εντολών
zh_tw: 命令列

# @info:placeholder
source: Search...
ar: ابحث...
el: Αναζήτηση...
zh_tw: 搜尋…

# @option:check
source: Break lines
ar: اكسر الأسطر
el: Αλλαγή γραμμών
zh_tw: 斷開行數

source: Cppcheck Analysis (%1)
ar: تحليل Cppcheck (%1)
el: Cppcheck ανάλυση (%1)
zh_tw: Cppcheck 分析 (%1)

source: Failed to start Cppcheck from "%1".
ar: فشل بدء Cppcheck من "%1".
el: Αποτυχία έναρξης cppcheck από το «%1».
zh_tw: 從「%1」啟動 Cppcheck 失敗。

source: Cppcheck crashed.
ar: تعطل Cppcheck.
el: Το cppcheck κατέρρευσε.
zh_tw: Cppcheck 已崩潰。

source: Cppcheck process timed out.
ar: انقضى وقت عملية Cppcheck.
el: Ο χρόνος της διεργασίας cppcheck εξέπνευσε.
zh_tw: Cppcheck 行程逾時。

source: Write to Cppcheck process failed.
ar: فشل الكتابة إلى عملية Cppcheck.
el: Αποτυχία εγγραφής στη διεργασία cppcheck.
zh_tw: 寫入 Cppcheck 行程失敗。

source: Read from Cppcheck process failed.
ar: فشل القراءة من عملية Cppcheck.
el: Αποτυχία ανάγνωσης από τη διεργασία cppcheck.
zh_tw: 從 Cppcheck 讀取失敗。

source: It seems that this project uses Qt library. For correctly work of cppcheck the value for define Q_MOC_OUTPUT_REVISION must be set. Unfortunately, the plugin is unable to find this value automatically - you should set it manually by adding '-DQ_MOC_OUTPUT_REVISION=XX' to extra parameters. The 'XX' value can be found in any project's moc-generated file or in the <QtCore/qobjectdefs.h> header file.
ar: يبدو أن هذا المشروع يستخدم مكتبة Qt. لعمل cppcheck بشكل صحيح، يجب تحديد قيمة تعريف Q_MOC_OUTPUT_REVISION. للأسف، البرنامج المساعد غير قادر على إيجاد هذه القيمة آليًا - يجب عليك تحديدها يدويًا بإضافة '-DQ_MOC_OUTPUT_REVISION=XX' إلى المعاملات الإضافية. يمكن العثور على قيمة 'XX' في أي ملف ناتج عن moc الخاص بالمشروع أو في ملف الترويسة <QtCore/qobjectdefs.h>.
el: Φαίνεται ότι αυτό το έργο χρησιμοποιεί τη βιβλιοθήκη Qt. Για τη σωστή λειτουργία του cppcheck η τιμή για το ορισμό του Q_MOC_OUTPUT_REVISION πρέπει να ρυθμιστεί. Δυστυχώς, το πρόσθετο δε βρίσκει αυτήν την τιμή αυτόματα - πρέπει να τη ρυθμίσετε χειροκίνητα προσθέτοντας '-DQ_MOC_OUTPUT_REVISION=XX' στις επιπλέον παραμέτρους. Η τιμή 'XX' μπορεί να βρεθεί σε κάθε αρχείο του έργου παραγόμενο από moc ή στο <QtCore/qobjectdefs.h> header αρχείο.

source: Cppcheck XML Parsing: error at line %1, column %2: %3
ar: تحليل Cppcheck لـ XML: خطأ في السطر %1، العمود %2: %3
el: Ανάλυση cppcheck XML: σφάλμα στη γραμμή %1, στήλη %2: %3
zh_tw: Cppcheck XML 剖析：行數 %1 第 %2 欄有錯誤：%3

# @action
source: Analyze Current File with Cppcheck
ar: حلل الملف الحالي بواسطة Cppcheck
el: Ανάλυση τρέχοντος αρχείου με το cppcheck
zh_tw: 使用 Cppcheck 分析目前檔案

# @action
source: Analyze Current Project with Cppcheck
ar: حلل المشروع الحالي بواسطة Cppcheck
el: Ανάλυση τρέχοντος έργου με το cppcheck
zh_tw: 使用 Cppcheck 分析目前專案

# @title:window
source: Test
el: Δοκιμή
zh_tw: 測試

source: Analysis completed, no problems detected.
ar: اكتمل التحليل، لم تُكتشف أي مشاكل.
el: Η ανάλυση ολοκληρώθηκε, δεν ανιχνεύθηκαν προβλήματα.
zh_tw: 分析完成，未偵測到問題。

source: Analysis started...
ar: بدأ التحليل...
el: Η ανάλυση ξεκίνησε...
zh_tw: 開始分析…

# @info:tooltip %1 is the path of the file
source: Re-run last Cppcheck analysis (%1)
ar: أعد تشغيل آخر تحليل Cppcheck (%1)
el: Επανεκτέλεση τελευταίας ανάλυσης cppcheck (%1)
zh_tw: 重新執行上次的 Cppcheck 分析 (%1)

# @info:tooltip
source: Re-run last Cppcheck analysis
ar: أعد تشغيل آخر تحليل Cppcheck
el: Επανεκτέλεση τελευταίας ανάλυσης cppcheck
zh_tw: 重新執行上次的 Cppcheck 分析
