Repository: KDE/kdevelop
Catalog: po/*/kdevsubversion.po
Languages: ar, eu

# @action:inmenu
source: Copy...
ar: انسخ...
eu: Kopiatu...

# @action:inmenu
source: Move...
ar: انقل...
eu: Mugitu...

source: Please select only one item for this operation
ar: الرجاء اختيار عنصر واحد فقط لهذه العملية
eu: Mesedez, eragiketa honetarako elementu bakarra hautatu

# @label
source: Destination file/directory
ar: ملف/دليل الوجهة
eu: Jomuga fitxategia/direktorioa

source: Copying only works on local files
ar: النسخ يعمل فقط على الملفات المحلية

source: Destination file/directory
ar: ملف/دليل الوجهة
eu: Jomuga fitxategia/direktorioa

source: Moving only works on local files/dirs
ar: النقل يعمل فقط على الملفات/الأدلة المحلية

source: Subversion Add
ar: إضافة Subversion
eu: Subversion Gehitu

source: Not enough information to add file
ar: لا تتوفر معلومات كافية لإضافة الملف
eu: Ez dago fitxategia gehitzeko informazio nahikoa

source: Subversion Annotate
ar: إضافة ملاحظات Subversion

source: Not enough information to blame location
ar: لا تتوفر معلومات كافية لتحديد المسؤول عن الموقع

source: Subversion Checkout
ar: سحب Subversion

source: Not enough information to checkout
ar: لا تتوفر معلومات كافية للسحب

source: Subversion Commit
ar: تثبيت Subversion
eu: Subversion Baliozkotzea

source: Not enough information to execute commit
ar: لا تتوفر معلومات كافية لتنفيذ التثبيت
eu: Ez dago baliozkotzea exekutatzeko informazio nahikoa

source: Committing...
ar: جاري التثبيت...
eu: Baliozkotzen...

source: Subversion Copy
ar: نسخ Subversion
eu: Subversion Kopiatu

source: Not enough information to copy file
ar: لا تتوفر معلومات كافية لنسخ الملف
eu: Ez dago fitxategia kopiatzeko informazio nahikoa

source: Subversion Diff
ar: مقارنة Subversion

source: Not enough information given to execute diff
ar: لا تتوفر معلومات كافية لتنفيذ المقارنة

source: Subversion Import
ar: استيراد Subversion
eu: Subversion Inportatu

source: Not enough information to import
ar: لا تتوفر معلومات كافية للاستيراد
eu: Ez dago inportatzeko informazio nahikoa

source: Subversion Info
ar: معلومات Subversion

source: Not enough information to execute info job
ar: لا تتوفر معلومات كافية لتنفيذ مهمة المعلومات
eu: Ez dago info lanak exekutatzeko informazio nahikoa

# A file was marked to be added to svn
source: Added %1
ar: أضِف %1
eu: %1 gehitu da

# A file was marked for deletion from svn
source: Deleted %1
ar: احذِف %1
eu: %1 ezabatu da

# A file was deleted during an svn update operation
source: Deleted %1
ar: احذِف %1
eu: %1 ezabatu da

# A file was added during an svn update operation
source: Added %1
ar: أضِف %1
eu: %1 gehitu da

source: Revision %1
ar: المراجعة %1
eu: %1 berrikuspena

source: Updating externals: %1
ar: جاري تحديث الخارجية: %1

source: Sending %1
ar: جاري إرسال %1
eu: %1 bidaltzen

source: Adding %1 using mimetype %2.
ar: جاري إضافة %1 باستخدام نوع الوسائط المتعددة %2.

source: Adding %1.
ar: جاري إضافة %1.
eu: %1 gehitzen.

source: Deleting %1.
ar: جاري حذف %1.
eu: %1 ezabatzen.

source: Replacing %1.
ar: جاري استبدال %1.
eu: %1 ordezten.

source: Transmitting file data
ar: جاري إرسال بيانات الملف
eu: Fitxategi-datuak transmititzen

source: Blame finished for revision %1, path %2
ar: انتهاء تحديد المسؤولية للمراجعة %1، المسار %2

source: Reverted working copy %1
ar: أُعِدَ نسخة العمل %1

source: Reverting failed on working copy %1
ar: فشل الإعادة على نسخة العمل %1

source: Copied %1
ar: انسخ %1
eu: %1 kopiatu da

source: Certificate is not yet valid.
ar: الشهادة ليست صالحة بعد.
eu: Ziurtagiria ez da oraindik balio.

source: Certificate has expired.
ar: انتهت صلاحية الشهادة.
eu: Ziurtagiria iraungi egin da.

source: Certificate's CN (hostname) doesn't match the remote hostname.
ar: الاسم الشائع للشهادة (اسم المضيف) لا يطابق اسم المضيف البعيد.

source: Certificate authority is unknown.
ar: سلطة الشهادة غير معروفة.
eu: Ziurtagiri-agintaritza ezezaguna da.

source: Other unknown error.
ar: خطأ آخر غير معروف.
eu: Beste errore ezezagun bat.

source: Enter Login for: %1
ar: أدخِل اسم المستخدم من أجل: %1

source: Completed
ar: اكتمال
eu: Osatuta

source: Error executing Job: %1
ar: خطأ أثناء تنفيذ المهمة: %1
eu: Errorea lana exekutatzean: %1

source: Subversion Log
ar: سجل Subversion
eu: Subversion Egunkaria

source: Not enough information to log location
ar: لا تتوفر معلومات كافية لتسجيل الموقع

source: Subversion Move
ar: نقل Subversion
eu: Subversion Mugitu

source: Not enough information to move file
ar: لا تتوفر معلومات كافية لنقل الملف
eu: Ez dago fitxategia mugitzeko informazio nahikoa

source: Subversion Remove
ar: إزالة Subversion
eu: Subversion Kendu

source: Not enough information to execute remove job
ar: لا تتوفر معلومات كافية لتنفيذ مهمة الإزالة
eu: Ez dago kentzeko lana exekutatzeko informazio nahikoa

source: Subversion Revert
ar: إعادة Subversion
eu: Subversion Lehengoratu

source: Not enough information to execute revert
ar: لا تتوفر معلومات كافية لتنفيذ الإعادة
eu: Ez dago lehengoratzea exekutatzeko informazio nahikoa

# @title:window
source: SSL Server Certificate
ar: شهادة ملقم SSL
eu: SSL zerbitzari ziurtagira

# @action:button
source: Trust Permanently
ar: ثق بصفة دائمة

# @action:button
source: Trust Temporarily
ar: ثق بصفة مؤقتة

# @title:window
source: SSL Server Certificate: %1
ar: شهادة ملقم SSL: %1
eu: SSL zerbitzari ziurtagira: %1

source: Subversion Status
ar: حالة Subversion
eu: Subversion Egoera

source: Not enough information to execute status job
ar: لا تتوفر معلومات كافية لتنفيذ مهمة الحالة
eu: Ez dago egoera lanik exekutatzeko informazio nahikoa

source: Subversion Update
ar: تحديث Subversion
eu: Subversion Eguneratu

source: Not enough Information to execute update
ar: لا تتوفر معلومات كافية لتنفيذ التحديث
eu: Ez dago eguneratzea exekutatzeko informazio nahikoa

# @label:textbox
source: Source directory:
ar: دليل المصدر:
eu: Sorburu-karpeta:

# @label:textbox
source: Repository:
ar: المستودع:
eu: Gordetegia:

# @info:tooltip
source: Repository location
ar: موقع المستودع
eu: Gordetegiaren kokalekua

# @info:whatsthis
source: Choose the repository into which the source directory is imported
ar: اختر المستودع الذي يستورد دليل المصدر إليه
eu: Hautatu sorburu-direktorioa inportatzeko gordetegia

# @label:textbox
source: Commit message:
ar: رسالة التثبيت:
eu: Baliozkotze-mezua:

source: There were errors validating the server certificate. Do you want to trust this certificate?
ar: حدثت أخطاء أثناء التحقق من صحة شهادة الملقم. هل تريد الثقة بهذه الشهادة؟
eu: Zerbitzariaren ziurtagiria baliozkotzeko erroreak egon dira. Ziurtagiri honetan konfiantza jarri nahi duzu?

source: Reasons why the validation failed
ar: أسباب فشل التحقق
eu: Baliozkotzeak zergatik huts egin duen arrazoia

# @title:group
source: Certificate Information
ar: معلومات الشهادة
eu: Ziurtagiriaren informazioa

# @label:textbox
source: Hostname:
ar: اسم المضيف:
eu: Ostalari-izena:

source: someserver
ar: ملقم ما

# @label:textbox
source: Issuer:
ar: المُصدِر:
eu: Jaulkitzailea:

source: someissuer
ar: مُصدِر ما

# @label:textbox
source: Valid from:
ar: صالح من:
eu: Noiztik balio du:

source: validfrom
ar: صالح من

# @label:textbox
source: Valid until:
ar: صالح حتى:
eu: Noiz arte balio du:

source: validuntil
ar: صالح حتى

# @label:textbox
source: Fingerprint:
ar: البصمة:
eu: Hatz-marka:

source: fingerprint
ar: البصمة
eu: hatz-marka
