Repository: KDE/kdevelop
Catalog: po/*/kdevplatform.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: صفا الفليج

# EMAIL OF TRANSLATORS
source: Your emails
ar: safa1996alfulaij@gmail.com

# @info:tooltip
source: Error
ar: خطأ

# @info:tooltip
source: Dirty
ar: متسخ

# @info:tooltip
source: Pending
ar: ينتظر

# @info:tooltip
source: Clean
ar: نظّف

source: Not hit yet
ar: لم تضرب بعد

source: Ignore
ar: تجاهل

source: next hits
ar: الضربات التالية

source: Breakpoint is <a href="pending">pending</a>
ar: نقطة التّوقّف التّالي <a href="pending">مرجأة</a>

source: Breakpoint is <a href="dirty">dirty</a>
ar: نقطة التّوقّف التّالية <a href="dirty">متّسخة</a>

source: Breakpoint is active
ar: نقطة التّوقّف نشطة

source: Hit %1 time
ar: ضربة %1

source: Breakpoint has errors
ar: لنقطة التّوقّف أخطاء

source: <b>Breakpoint is pending</b><p>Pending breakpoints are those that have been passed to GDB, but which are not yet installed in the target, because GDB cannot find the function or file to which the breakpoint refers. The most common case is a breakpoint in a shared library: GDB will insert this breakpoint only when the library is loaded.</p>
ar: <b>نقطة التوقف قيد الانتظار</b><p>نقاط التوقف قيد الانتظار هي تلك التي أُرسلت إلى GDB، ولكنها لم تُثبَّت بعد في الهدف، لأن GDB لا يستطيع العثور على الدالة أو الملف الذي تشير إليه نقطة التوقف. الحالة الأكثر شيوعًا هي نقطة توقف في مكتبة مشتركة: GDB سيدرج نقطة التوقف هذه فقط عند تحميل المكتبة.</p>

source: <b>Breakpoint is dirty</b><p>The breakpoint has not yet been passed to the debugger.</p>
ar: <b>نقطة التّوقّف متّسخة</b><p>لم تُمرّر النقطة بعد إلى المنقّح.</p>

source: Breakpoint
ar: نقطة التّوقّف

source: Breakpoint not found
ar: لم يُعثر على نقطة التّوقّف

source: Couldn't find breakpoint at %1:%2
ar: تعذّر العثور على نقطة توقّف عند %1:%2

source: &Breakpoint
ar: &نقطة التّوقّف

source: &Disable Breakpoint
ar: ع&طّل نقطة التّوقّف

source: &Enable Breakpoint
ar: &مكّن نقطة التّوقّف

source: &Bookmark
ar: علام&ة

source: Type
ar: النّوع

source: Location
ar: المكان

source: Condition
ar: الشّرط

source: Active status
ar: حالة النّشاط

source: State
ar: الحالة

source: A breakpoint cannot be added to an untitled document. Please save the document first.
ar: لا يمكن إضافة نقطة توقف إلى مستند بلا عنوان. رجاءً احفظ المستند أولًا.

# @title:window
source: Debugger Breakpoints
ar: نقاط توقّف المنقّح

# @info:whatsthis
source: Displays a list of breakpoints with their current status. Clicking on a breakpoint item allows you to change the breakpoint and will take you to the source in the editor window.
ar: يعرض قائمة بنقاط التوقف مع حالتها الحالية. النقر على عنصر نقطة توقف يمكنك من تغيير نقطة التوقف وسينقلك إلى المصدر في نافذة المحرر.

source: Breakpoint Details
ar: تفاصيل نقطة التّوقّف

source: New code breakpoint ...
ar: نقطة توقّف جديدة في الكود...

source: Enter condition ...
ar: أدخل الشّرط...

# New breakpoint
source: &New
ar: &جديد

# Code breakpoint
source: &Code
ar: &كود

# Data breakpoint
source: Data &Write
ar: كتابة ال&بيانات

# Data read breakpoint
source: Data &Read
ar: قراءة ال&بيانات

# Data access breakpoint
source: Data &Access
ar: و&صول البيانات

source: &Delete
ar: ا&حذف

source: Disable &All
ar: عطّل ال&كلّ

source: &Enable All
ar: &مكّن الكل

source: &Remove All
ar: أ&زل الكلّ

# #thread-id at function-name or address
source: #%1 at %2 (crashed)
ar: #%1 عند %2 (تعطّل)

# #thread-id at function-name or address
source: #%1 at %2
ar: #%1 عند %2

source: Depth
ar: العمق

source: Function
ar: الدالة

source: Source
ar: المصدر

source: <b>Frame stack</b>Often referred to as the "call stack", this is a list showing which function is currently active, and what called each function to get to this point in your program. By clicking on an item you can see the values in any of the previous calling functions.
ar: <b>مكدس الإطارات</b> غالبًا ما يشار إليه باسم "مكدس الاستدعاءات"، هذه قائمة تعرض الدالة النشطة حاليًا، وما الذي استدعى كل دالة للوصول إلى هذه النقطة في برنامجك. بالنقر على عنصر يمكنك رؤية القيم في أي من الدوال المستدعِية السابقة.

source: Threads:
ar: الخطوط:

# #frame function() at file
source: #%1 %2() at %3
ar: #%1 %2() عند %3

# #frame function() at file:line
source: #%1 %2() at %3:%4
ar: #%1 %2() عند %3:%4

source: Breakpoint hit: %1
ar: تصادم بنقطة توقّف: %1

source: Watchpoint hit: %1
ar: تصادم بنقطة مشاهدة: %1

source: Remote Path
ar: مسار بعيد

source: Local Path
ar: مسار محلي

source: Delete
ar: احذف

source: Error
ar: خطأ

source: Auto
ar: آليّ

source: Locals
ar: المحليات

source: Name
ar: الاسم

source: Value
ar: القيمة

source: Watch This
ar: راقب هذا

source: Stop on Change
ar: توقف عند التغيير

source: Debugger Variables
ar: متغيرات مصحح الأخطاء

# @option:check
source: Auto-resize columns on click
ar: آليًّا: أعد تغيير حجم الأعمدة عند النقر

source: <b>Variable tree</b>The variable tree allows you to see the values of local variables and arbitrary expressions.<br />Local variables are displayed automatically and are updated as you step through your program. For each expression you enter, you can either evaluate it once, or "watch" it (make it auto-updated). Expressions that are not auto-updated can be updated manually from the context menu. Expressions can be renamed to more descriptive names by clicking on the name column.<br />To change the value of a variable or an expression, click on the value.<br />
ar: <b>شجرة المتغيرات</b> تسمح لك شجرة المتغيرات برؤية قيم المتغيرات المحلية والتعبيرات العشوائية.<br /> تعرض المتغيرات المحلية آليًّا وتُحدَّث بينما تتخطى برنامجك. لكل تعبير تدخله، يمكنك إما تقييمه مرة واحدة، أو "مراقبته" (جعل تحديثه آليًّا). التعبيرات التي لا تُحدَّث آليًّا يمكن تحديثها يدويًا من قائمة السياق. يمكن إعادة تسمية التعبيرات إلى أسماء أكثر وصفية بالنقر على عمود الاسم.<br /> لتغيير قيمة متغير أو تعبير، انقر على القيمة.<br />

source: <b>Expression entry</b>Type in expression to watch.
ar: <b>إدخال التعبير</b> اكتب التعبير للمراقبة.

source: &Format
ar: &هيء

source: &Natural
ar: طبيعي

source: &Binary
ar: ثنا&ئي

source: &Octal
ar: ثم&اتي

source: &Decimal
ar: عش&ري

source: &Hexadecimal
ar: ست عشري

source: Remove Watch Variable
ar: أزل المتغير المراقب

source: &Copy Value
ar: انسخ ال&قيمة

source: &Stop on Change
ar: &توقف عند التغيير

# @label:textbox
source: Find:
ar: اعثر على:

# @info:tooltip
source: Jump to next match
ar: انتقل إلى المطابقة التّالية

# @info:tooltip
source: Jump to previous match
ar: انتقل إلى المطابقة السّابقة

# @info:tooltip
source: Match case sensitive
ar: حسّاس لحالة الأحرف

source: Documentation
ar: التّوثيق

# @action go back
source: Back
ar: عُد

# @action go forward
source: Forward
ar: تقدّم

# @action go to start page
source: Home
ar: المنزل

# @info:placeholder
source: Search...
ar: ابحث...

# @action
source: Find in Text...
ar: ابحث في النص...

# @info:tooltip
source: Find in text of current documentation page
ar: ابحث في نص صفحة التوثيق الحالية

# @title:menu
source: Debug
ar: التنقيح

# @title:menu
source: Refactor
ar: أعد الهيكلة

# @title:menu
source: Analyze Current File With
ar: حلّل الملفّ الحاليّ بِ‍

# @title:menu
source: Analyze Current Project With
ar: حلّل المشروع الحاليّ بِ‍

source: The executable %1 cannot be found. Please make sure it is installed and can be executed. <br />The plugin will not work until you fix this problem.
ar: لا يمكن العثور على الملف القابل للتنفيذ %1. رجاءً تأكد من تثبيته وإمكانية تنفيذه. <br /> لن يعمل الملحق حتى تصلح هذه المشكلة.

source: Rename "%1" to "%2"
ar: أعد تسمية "%1 إلى "%2"

source: Failed to apply changes: %1
ar: فشل تطبيق التغييرات: %1

source: Rename
ar: غيّر الاسم

source: Rename file from "%1" to "%2".
ar: أعد تسمية الملف من ”%1“ إلى ”%2“.

source: Parsing: %1
ar: تحليل: %1

source: Background Parser
ar: المُحلِّل في الخلفية

# %1: filename
source: Skipped file that is too large: '%1'
ar: تخطي الملف الكبير جدًا: ”%1“

# %1: file size, %2: limit file size
source: The file is %1 and exceeds the limit of %2.
ar: حجم الملف هو %1 وتجاوز الحد الأقصى %2.

source: Could not open file '%1'
ar: تعذّر فتح الملف ”%1“

source: File could not be read from disk.
ar: لم يمكن قراءة الملف من القرص.

source: File could not be opened.
ar: لم يمكن فتح الملف.

source: File could not be read from disk due to permissions.
ar: لم يمكن قراءة الملف من القرص بسبب الأذونات.

source: Process 1 file in %2
ar: عالِج ملفًا واحدًا في %2

source: All projects classes
ar: كل أصناف المشاريع

source: Base classes
ar: أصناف القاعدة

source: Derived classes
ar: الأصناف المشتقة

source: Classes in project %1
ar: أصناف في المشروع %1

source: not implemented
ar: لم تُنجز

# @action
source: Rename "%1"...
ar: غيّر الاسم "%1"...

source: No declaration under cursor
ar: لا يوجد تصريح تحت المؤشر

source: Declaration is located in non-writable file %1.
ar: يقع التصريح في ملف غير قابل للكتابة %1.

# @title:window Renaming some declaration
source: Rename "%1"
ar: غيّر الاسم "%1"

# @title:tab
source: Uses
ar: الاستخدامات

# @title:tab
source: Declaration Info
ar: معلومات التصريح

source: Renaming "%1" to "%2"
ar: إعادة تسمية ”%1“ إلى ”%2“

# @title:window
source: Rename
ar: غيّر الاسم

# @label:textbox
source: &New name:
ar: الا&سم الجديد:

source: <html><head/><body><p>&quot;Note: All overloaded functions, overloads, forward-declarations, etc. will be renamed too&quot;</p></body></html>
ar: <html><head/><body><p>&quot;ملاحظة: كل الدوال المثقلة، والأثقال، والتصريحات المبكرة، وما إلى ذلك ستُعاد تسميتها أيضًا&quot;</p></body></html>

# @action:button
source: &Rename
ar: &غيّر الاسم

# @action:button
source: &Cancel
ar: أل&غِ

source: Could not rename '%1' to '%2'
ar: لم يمكن إعادة تسمية ”%1“ إلى ”%2“

source: Inconsistent change in %1 between %2, found %3 (encountered "%4") -> "%5"
ar: تغيير غير متّسق في %1 بين %2، وُجِد %3 (صُودِف ”%4“) -> ”%5“

source: Could not replace text in the document: %1
ar: لم يمكن استبدال النص في المستند: %1

source: Inconsistent change in %1 at %2 = "%3"(encountered "%4") -> "%5"
ar: تغيير غير متّسق في %1 عند %2 = ”%3“ (صُودِف ”%4“) -> ”%5“

source: Inconsistent change-request at %1; intersecting changes: "%2"->"%3"@%4 & "%5"->"%6"@%7
ar: طلب تغيير غير متّسق عند %1؛ تغييرات متقاطعة: ”%2“->”%3“ عند %4 و ”%5“->”%6“ عند %7

# @title:window
source: Refactoring
ar: إعادة الهيكلة

# @action:button
source: &Abort
ar: أ&جهض

source: Alias %1 as %2
ar: الاسم المستعار %1 مثل %2

source: Lost alias %1
ar: الاسم المستعار %1 ضائع

source: invalid member-function %1 type %2
ar: دالة-عضو غير صالحة %1 نوع %2

source: (unknown direct declaration)
ar: (تصريح مباشر مجهول)

source: (missing)
ar: (مفقود)

source: context-free forward-declaration %1
ar: تصريح مبكر %1 بلا سياق

source: Import %1 as %2
ar: استورد %1 مثل %2

source: Import %1
ar: استورد %1

source: lost declaration
ar: تصريح ضائع

source: Back to %1<br />
ar: العودة إلى %1<br />

source: enumerator
ar: المُعدِّد

source: :[value-dependent]
ar: :[يعتمد على القيمة]

source: namespace %1
ar: نطاق الأسماء %1

source: enumeration %1
ar: عناصر مجموعة %1

source: (resolved forward-declaration:
ar: (تصريح مبكر محلول:

source: (unresolved forward-declaration)
ar: (تصريح مبكر غير محلول)

source: possible resolution from
ar: حل محتمل من

source: Returns:
ar: الإرجاع:

source: Type:
ar: النّوع:

source: Enum:
ar: عناصر مجموعة:

source: Container:
ar: الحاوية:

source: Scope: %1
ar: النطاق: %1

source: Access: %1
ar: الوصول: %1

source: Kind: %1 %2
ar: النّوع: %1 %2

source: Kind: %1
ar: النّوع: %1

source: Deprecated
ar: مهمل

source: Status: %1
ar: الحالة: %1

source: Decl.:
ar: تصريح:

source: Decl.:
ar: تصريح:

source: Show uses
ar: أظهر الاستخدامات

source: Show documentation for
ar: أظهر وثائق لـ

# An anonymous declaration (class, function, etc.)
source: <anonymous>
ar: <مجهول>

source: Overrides a
ar: يلغي

source: from
ar: من

source: Hides a
ar: يخفي

source: Overridden in
ar: مُلغَى في

source: Overriders possible, show all
ar: من المحتمل وجود عمليات إلغاء، أظهر الجميع

source: More overriders possible, show all
ar: المزيد من عمليات الإلغاء المحتملة، أظهر الجميع

source: Inherited by
ar: موروث بواسطة

source: Inheriters possible, show all
ar: من المحتمل وجود عمليات توريث، أظهر الجميع

source: More inheriters possible, show all
ar: المزيد من عمليات التوريث المحتملة، أظهر الجميع

# A declaration that is unknown
source: Unknown
ar: مجهول

# tells if a declaration is defining the variable's value
source: definition
ar: تعريف

# as in c++ forward declaration
source: forward
ar: تقدّم

# a variable that won't change, const
source: constant
ar: ثابت

source: 1 Byte
ar: بايت

source: 1 Bit
ar: 1 بت

source: offset in parent: %1
ar: إزاحة في الوالد: %1

source: size: %1 Bytes
ar: حجم: %1 بايت

source: aligned to: %1 Bytes
ar: محاذاة إلى: %1 بايت

source: Declarations:
ar: التصريحات:

source: not parsed yet
ar: لم يُحلّل بعد

# Files included into this file
source: Includes
ar: يشمل

# Count of files this file was included into
source: Included by
ar: أُدرِج بواسطة

source: Class
ar: الفئة

source: Variable
ar: متغير

source: Namespace
ar: نطاق الأسماء

source: Namespace import
ar: استيراد فضاء أسماء

source: Namespace alias
ar: الاسم المستعار لفضاء الأسماء

source: Forward Declaration
ar: تصريح مبكر

source: (Hold <em>Alt</em> to show. Navigate via arrow keys, activate by pressing <em>Enter</em>)
ar: (اضغط على <em>Alt</em> للعرض. تنقل بواسطة مفاتيح الأسهم، فعِّل بالضغط على <em>Enter</em>)

source: (Hold <em>Alt</em> to show this tooltip)
ar: (اضغط على <em>Alt</em> لعرض تلميح الأداة هذا)

source: Problem
ar: المشكلة

source: Problem in <i>%1</i>
ar: مشكلة في <i>%1</i>

source: Location:
ar: المكان:

source: <br>See:
ar: <br>انظر:

source: in
ar: في

source: Solution (%1)
ar: الحل (%1)

source: %1 still needs an update!
ar: %1 لا يزال يحتاج إلى تحديث!

source: Uses of
ar: استخدامات

source: Uses of %1
ar: استخدامات %1

# refers to a line in source code
source: Line <b>%1</b>:
ar: السّطر <b>%1</b>:

# Refers to a line in source code
source: Line <b>%1</b>:
ar: السّطر <b>%1</b>:

source: Unknown context
ar: سياق مجهول

source: Global
ar: عام

# %1: source file
source: In %1
ar: في %1

source: Definition
ar: تعريف

source: Declaration
ar: الإعلان

# %1: number of uses, %2: filename with uses
source: %2: 1 use
ar: %2: 0 استخدم

# Refers to closing a UI element
source: Collapse
ar: اطوِ

# Refers to opening a UI element
source: Expand
ar: وسع

source: 1 use found
ar: وُجِد استخدام واحد

source: Expand all
ar: وسّع الكلّ

source: Collapse all
ar: اطوِ الكلّ

source: Warning
ar: تحذير

source: Hint
ar: تلميح

source: Disk
ar: القرص

source: Preprocessor
ar: معالج مسبق

source: Lexer
ar: المُحلّل اللغوي

source: Parser
ar: المحلّل

source: Definition-Use Chain
ar: سلسلة التعريف-الاستخدام

source: Semantic analysis
ar: تحليل دلالي

source: To-do
ar: مهمّة

source: Unknown
ar: مجهول

# <severity>: <description> in <url>:[<range>]: <explanation> (found by <source>)
source: %1: %2 in %3:[(%4,%5),(%6,%7)]: %8 (found by %9)
ar: %1: %2 في %3:[(%4،%5)،(%6،%7)]: %8 (وُجِد بواسطة %9)

source: <no explanation>
ar: <لا يوجد شرح>

source: %1 of %2
ar: %1 من أصل %2

source: unknown
ar: مجهول

source: %1 of %2 : %3
ar: %1 من أصل %2 : %3

source: files or - to read from STDIN, the latter is the default if nothing is provided
ar: ملفات أو - للقراءة من STDIN، هذا الأخير هو الافتراضي إذا لم يُوفَّر شيء

source: print generated AST tree
ar: اطبع شجرة AST المولدة

source: print generated token stream
ar: اطبع تدفق الرمز المولَّد

source: code to parse
ar: شفرة للتحليل

source: No build directory specified for a builder job.
ar: لم يُحدَّد دليل بناء لوظيفة بناء.

source: No working directory specified for a process.
ar: لم يُحدَّد دليل عمل لعملية.

source: Invalid build directory '%1'
ar: دليل بناء غير صالح ”%1“

source: Invalid working directory '%1'
ar: دليل عمل غير صالح ”%1“

source: Build directory '%1' is not a local path
ar: دليل البناء ”%1“ ليس مسارًا محليًا

source: Working directory '%1' is not a local path
ar: دليل العمل ”%1“ ليس مسارًا محليًا

source: Build directory '%1' does not exist or is not a directory
ar: دليل البناء ”%1“ غير موجود أو ليس دليلًا

source: Working directory '%1' does not exist or is not a directory
ar: دليل العمل ”%1“ غير موجود أو ليس دليلًا

source: Failed to specify program to start: %1
ar: فشل تحديد البرنامج المراد تشغيله: %1

source: *** Killed process ***
ar: *** قُتِلت العملية ***

source: *** Warning: could not kill the process ***
ar: *** تحذير: لم يمكن قتل العملية ***

source: %1 has failed to start
ar: فشل %1 في البدء

source: %1 has crashed
ar: تعطّل %1

source: Read error
ar: خطأ قراءة

source: Write error
ar: خطأ كتابة

source: Waiting for the process has timed out
ar: انتهت مهلة انتظار العملية

source: Exit code %1
ar: رمز الخروج: %1

source: *** Failure: %1 ***
ar: *** فشل: %1 ***

source: *** Finished ***
ar: *** انتهت ***

source: The base folder of project <b>%1</b> got deleted or moved outside of KDevelop. The project has to be closed.
ar: حُذِف المجلد الأساسي للمشروع <b>%1</b> أو نُقِل خارج KDevelop مطورك. يجب إغلاق المشروع.

# @title:window
source: Project Folder Deleted
ar: حُذِف مجلد المشروع

source: You tried to rename '%1' to '%2', but the latter is filtered and will be hidden. Do you want to continue?
ar: حاولت إعادة تسمية ”%1“ إلى ”%2“، لكن الأخير مُرشَّح وسيُخفَى. هل تريد المتابعة؟

# @info:status
source: build
ar: البناء

# @info:status
source: clean
ar: المسح

# @info:status
source: configure
ar: اضبط

# @info:status
source: install
ar: ثبّت

# @info:status
source: prune
ar: قلِّم

# Unspecified set of build items (e. g. projects, targets)
source: Various items
ar: عناصر متنوعة

source: Cannot remove folder <i>%1</i>.
ar: لا يمكن إزالة المجلد <i>%1</i>.

source: Cannot remove file <i>%1</i>.
ar: لا يمكن إزالة الملف <i>%1</i>.

source: The file <i>%1</i> already exists.
ar: الملف <i>%1</i> موجود فعلًا.

source: Cannot create file <i>%1</i>.
ar: تعذّر إنشاء الملف<i>%1</i>.

source: Cannot create folder <i>%1</i>.
ar: تعذّر إنشاء المجلّد <i>%1</i>.

source: Project Import: %1
ar: استيراد المشروع: %1

source: Project import canceled.
ar: أُلغي استيراد المشروع.

# @title:column buildset item name
source: Name
ar: الاسم

# @title:column buildset item path
source: Path
ar: المسار

# @item:intext
source: no branch
ar: لا فرع

# @info:placeholder
source: Enter the path to an item from the projects tree...
ar: أدخل المسار إلى عنصر من شجرة المشاريع...

# @action
source: Select...
ar: اختر...

# @title:window
source: Select an Item
ar: اختر عنصرًا

source: Select the item you want to get the path from.
ar: حدد العنصر الذي تريد الحصول على المسار منه.

# @info:tooltip
source: Enter a dependency to add to the list
ar: أدخل اعتمادًا للإضافة إلى القائمة

# @info:placedholder
source: Enter a dependency to add to the list...
ar: أدخل اعتمادًا للإضافة إلى القائمة...

# @info:tooltip
source: Add the listed target to the dependency list
ar: أضف الهدف المدرج إلى قائمة الاعتماديات

# @info:tooltip
source: List of indirect dependent targets.
ar: قائمة الأهداف المعتمدة غير المباشرة.

# @info:whatsthis
source: This list should contain targets that the application does not directly depend on, but for which an action needs to be taken before running the application.
ar: يجب أن تحتوي هذه القائمة على الأهداف التي لا يعتمد عليها التطبيق مباشرة، ولكن يلزم اتخاذ إجراء بشأنها قبل تشغيل التطبيق.

# @info:tooltip
source: Remove the selected dependencies from the list
ar: أزل الاعتماديات المحددة من القائمة

# @info:tooltip
source: Move the selected dependency up in the list
ar: حرّك الاعتماد المحدد للأعلى في القائمة

# @info:tooltip
source: Move the selected dependency down in the list
ar: حرّك الاعتماد المحدد للأسفل في القائمة

source: Failed writing to %1, probably the disk is full
ar: فشل الكتابة إلى %1، من المحتمل أن القرص ممتلئ

source: The previous session crashed.
ar: تعطّلت الجلسة السابقة.

# tty action
source: Clear cache
ar: امحُ الخبيئة

# @title
source: Session Crashed
ar: تعطّلت الجلسة

source: The crash may be caused by a corruption of cached data. Press Clear if you want KDevelop to clear the cache, otherwise press Continue if you are sure the crash has another origin.
ar: قد يكون التعطّل ناتجًا عن تلف في البيانات المخزّنة في خبيئة. اضغط على مسح إذا كنت تريد من KDevelop مطورك أن يمسح الخبيئة، وإلا اضغط على متابعة إذا كنت متأكدًا أن للتعطّل مصدرًا آخر.

# @action:button
source: Clear Cache
ar: امحُ الخبيئة

# @action:button
source: Continue
ar: تابع

source: Execute actions to change the area.<br />An area is a tool view configuration for a specific use case. From here you can also navigate back to the default code area.
ar: نفّذ الإجراءات لتغيير المنطقة.<br />المنطقة هي تشكيلة عرض أداة لحالة استخدام معينة. من هنا يمكنك أيضًا التنقل للعودة إلى منطقة الشفرة مبدئية.

# @action:inmenu
source: Back to Code
ar: عودة إلى الشفرة

# @title:window
source: Configure
ar: اضبط

source: The settings of the current module have changed. Do you want to apply the changes or discard them?
ar: تغيّرت إعدادات الوحدة الحالية. أتريد تطبيقها أو إهمالها؟

# @title:window
source: Apply Settings
ar: طبّق الإعدادات

source: <p>Could not find any plugins during startup.<br/>Please make sure QT_PLUGIN_PATH is set correctly.</p>Refer to <a href="https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source#Set_up_the_runtime_environment">this article</a> for more information.
ar: <p>لم يمكن العثور على أي ملحقات أثناء التشغيل.<br/>رجاءً تأكد من ضبط QT_PLUGIN_PATH بشكل صحيح.</p>ارجع إلى <a href="https://community.kde.org/Guidelines_and_HOWTOs/Build_from_source#Set_up_the_runtime_environment">هذه المقالة</a> لمزيد من المعلومات.

# @title:window
source: No Plugins Found
ar: لا يوجد ملحقات

# @title:window
source: Variables
ar: المتغيّرات

source: Debugger
ar: المنقّح

# @title:window
source: Frame Stack
ar: مكدس الإطارات

# @title:window
source: Breakpoints
ar: نقاط التّوقّف

source: &Restart
ar: أ&عد التشغيل

source: Restart program
ar: أعد تشغيل البرنامج

source: Restarts applications from the beginning.
ar: يعيد تشغيل التطبيقات من البداية.

# @action
source: Interrupt
ar: مقاطعة

# @info:tooltip
source: Interrupt application
ar: قاطع التطبيق

# @info:whatsthis
source: Interrupts the debugged process or current debugger command.
ar: يقاطع العملية التي يتم تصحيح أخطائها أو أمر مصحح الأخطاء الحالي.

# @action
source: Run to &Cursor
ar: شغّل حتّى المؤشّر

# @info:tooltip
source: Run to cursor
ar: شغّل حتّى المؤشّر

# @info:whatsthis
source: Continues execution until the cursor position is reached.
ar: يتابع التنفيذ حتى الوصول إلى موضع المؤشر.

# @action
source: Set E&xecution Position to Cursor
ar: اضبط موضع التنفيذ إلى المؤ&شر

# @info:tooltip
source: Jump to cursor
ar: اقفز إلى المؤشر

# @info:whatsthis
source: Continue execution from the current cursor position.
ar: تابع التنفيذ من موضع المؤشر الحالي.

# @action
source: Step &Over
ar: &تخطّ

# @info:tooltip
source: Step over the next line
ar: تخطّ السطر التالي

# @info:whatsthis
source: Executes one line of source in the current source file. If the source line is a call to a function the whole function is executed and the app will stop at the line following the function call.
ar: ينفّذ سطرًا واحدًا من المصدر في ملف المصدر الحالي. إذا كان سطر المصدر استدعاء لدالة، تُنفَّذ الدالة بأكملها وسيتوقف التطبيق عند السطر الذي يلي استدعاء الدالة.

# @action
source: Step over Ins&truction
ar: تخطّ الت&عليم

# @info:tooltip
source: Step over instruction
ar: تخطّ التعليم

# @info:whatsthis
source: Steps over the next assembly instruction.
ar: يتخطى تعليمة التجميع التالية.

# @action
source: Step &Into
ar: أُ&دخل في

# @info:tooltip
source: Step into the next statement
ar: ادخل إلى العبارة التالية

# @info:whatsthis
source: Executes exactly one line of source. If the source line is a call to a function then execution will stop after the function has been entered.
ar: ينفّذ سطرًا واحدًا بالضبط من المصدر. إذا كان سطر المصدر استدعاء لدالة، فسيتوقف التنفيذ بعد دخول الدالة.

# @action
source: Step into I&nstruction
ar: ادخل إلى الت&عليم

# @info:tooltip
source: Step into instruction
ar: ادخل إلى التعليم
