Repository: KDE/kdevelop
Catalog: po/*/kdevcustomdefinesandincludes.po
Languages: ar, zh_tw

# @item no compiler
source: None
ar: لا شيء
zh_tw: 無

# @title:column
source: Name
ar: الاسم
zh_tw: 名稱

# @title:column
source: Type
ar: النوع
zh_tw: 類型

# @item
source: Auto-detected
ar: اكتشاف آلي
zh_tw: 自動偵測

# @item
source: Manual
ar: يدوي
zh_tw: 手動

# @action
source: Delete Compiler
ar: احذف المصرّف
zh_tw: 刪除編譯器

# @title:tab
source: C/C++ Compilers
ar: مصرّفات C/C++
zh_tw: C/C++ 編譯器

# @title:tab
source: Configure C/C++ Compilers
ar: اضبط مصرّفات C/C++
zh_tw: 設定 C/C++ 編譯器

# @action:button
source: &Add
ar: أ&ضف
zh_tw: 新增(&A)

# @action:button
source: &Remove
ar: أ&زل
zh_tw: 移除(&R)

# @label:textbox
source: Name:
ar: الاسم:
zh_tw: 名稱：

# @label:chooser
source: Compiler executable:
ar: الملف التنفيذي للمصرّف:
zh_tw: 編譯器執行檔：

# @title:tab
source: Language Support
ar: دعم اللغة
zh_tw: 語言支援

# @title:tab
source: Configure Language Support
ar: اضبط دعم اللغة
zh_tw: 設定語言支援

source: Double-click here to insert a new define to be used for the path
ar: انقر نقرًا مزدوجًا هنا لإدراج تعريف جديد لاستخدامه في المسار
zh_tw: 在此雙擊來插入路徑要使用的新定義

# @title:column
source: Define
ar: تعريف
zh_tw: 定義

# @title:column
source: Value
ar: القيمة
zh_tw: 值

# @action
source: Delete Define
ar: احذف التعريف
zh_tw: 刪除定義

# @action
source: Delete Include Path
ar: احذف مسار التضمين
zh_tw: 刪除引入路徑

# %1 is an include path
source: %1 does not exist
ar: %1 لا يوجد
zh_tw: %1 不存在

# @info:tooltip
source: Add the currently displayed URL to the list of includes if it is not in the list yet.
ar: أضف المسار المعروض حاليًا إلى قائمة التضمينات إذا لَـم يكُن في القائمة بعد.
zh_tw: 將目前顯示的 URL 加入引入列表（如果它還不在裡面的話）。

# @info:placeholder
source: A new include path/file to use for parsing files under given directory
ar: مسار/ملف تضمين جديد لاستخدامه في تحليل الملفات ضمن مجلد معيّن
zh_tw: 剖析指定目錄中的檔案所使用的新引入路徑/檔案

# @info:tooltip
source: Create a new include path entry from this URL
ar: أنشئ مدخل مسار تضمين جديد من هذا المسار
zh_tw: 從此 URL 建立新的引入路徑項目

# @info:tooltip
source: Delete current include path entry
ar: احذف مدخل مسار التضمين الحالي
zh_tw: 刪除目前的引入路徑項目

# @info:tooltip
source: <html><head/><body><p>Check this if you want <code>*.h</code> headers to be parsed in plain C mode. By default they are parsed as C++ headers.</p></body></html>
ar: <html><head/><body><p>حدد هذا الخيار إذا كنت تريد تحليل ترويسات <code>*.h</code> في وضع C العادي. افتراضيًا، تحلل كترويسات C++.</p></body></html>
zh_tw: <html><head/><body><p>如果您希望 <code>*.h</code> 檔案以純 C 模式剖析，請勾選此選項。預設它們是剖析成 C++ 標頭檔。</p></body></html>

# @option:check
source: Parse *.h headers in plain C
ar: حلل ترويسات *.h في C العادي
zh_tw: 用純 C 剖析 *.h 標頭檔

# @label:listbox
source: C++ profi&le:
ar: تشكيلة C++:
zh_tw: C++ 設定檔(&L)：

# @info:tooltip
source: <html><head/><body><p>Choose language profile. </p><p>Use &quot;Custom&quot; profile to modify parser command-line arguments</p></body></html>
ar: <html><head/><body><p>اختر تشكيلة اللغة. </p><p>استخدم تشكيلة &quot;Custom&quot; لتعديل وسائط سطر الأوامر للمحلل</p></body></html>
zh_tw: <html><head/><body><p>選擇語言設定檔。</p><p>使用「自訂」設定檔來修改剖析器的命令列參數</p></body></html>

# @item:inlistbox language standard
source: Custom
ar: مخصص
zh_tw: 自訂

# @label:textbox
source: C++ co&mmand-line arguments:
ar: وسائط سطر أوامر C++:
zh_tw: C++ 命令列參數(&M)：

# @label:listbox
source: C profi&le:
ar: تشكيلة C:
zh_tw: C 設定檔(&L)：

# @label:textbox
source: C co&mmand-line arguments:
ar: وسائط سطر أوامر C:
zh_tw: C 命令列參數(&M)：

# @label:listbox
source: OpenCL C &profile:
ar: تشكيلة OpenCL C:
zh_tw: OpenCL C 設定檔(&P):

# @label:textbox
source: OpenCL C comma&nd-line arguments:
ar: وسائط سطر أوامر OpenCL C:
zh_tw: OpenCL C 命令列參數(&N)：

# @label:listbox
source: CUDA C P&rofile:
ar: تشكيلة CUDA C:
zh_tw: CUDA C 設定檔(&R)：

# @label:textbox
source: CUDA C comman&d-line arguments:
ar: وسائط سطر أوامر CUDA C:
zh_tw: CUDA C 命令列參數(&D)：

# @title:window
source: Select Project Path
ar: اختر مسار المشروع
zh_tw: 選擇專案路徑

source: Are you sure you want to delete the configuration for the path '%1'?
ar: أمتأكد من رغبتك في حذف إعدادات المسار '%1'؟
zh_tw: 您確定要刪除路徑「%1」的設定嗎？

# @title:window
source: Delete Path Configuration
ar: احذف إعدادات المسار
zh_tw: 刪除路徑設定

# @title:window
source: Edit Include Directories/Files
ar: حرر مجلدات/ملفات التضمين
zh_tw: 編輯引入目錄/檔案

# @title:window
source: Edit Defined Macros
ar: حرر وحدات الماكرو المعرّفة
zh_tw: 編輯已定義的巨集

source: Configure C/C++ parser
ar: اضبط محلل C/C++
zh_tw: 設定 C/C++ 剖析器

source: Configure which macros and include directories/files will be added to the parser during project parsing:
ar: اضبط وحدات الماكرو ومجلدات/ملفات التضمين التي ستضاف إلى المحلل أثناء تحليل المشروع:
zh_tw: 設定專案剖析時哪些巨集和包含目錄/檔案要加到剖析器中：

# @info:tooltip
source: Check this if you want the project to be reparsed to apply the changes.
ar: حدد هذا الخيار إذا كنت تريد إعادة تحليل المشروع لتطبيق التغييرات.
zh_tw: 如果您希望專案重新剖析來套用變更的話，請勾選此選項。

# @option:check
source: Reparse the project
ar: أعد تحليل المشروع
zh_tw: 重新剖析專案

# @info:tooltip
source: <html><head/><body><p>Select compiler that will be used to retrieve standard include directories and defined macros.</p></body></html>
ar: <html><head/><body><p>اختر المصرّف الذي سيستخدم لجلب مجلدات التضمين القياسية ووحدات الماكرو المعرّفة.</p></body></html>
zh_tw: <html><head/><body><p>選擇用來取得標準引入目錄和已定義巨集的編譯器。</p></body></html>

# @label:listbox
source: Compiler for path:
ar: المصرّف للمسار:
zh_tw: 路徑的編譯器：

# @info:tooltip
source: Edit multiple includes/defines at the same time.
ar: حرر تضمينات/تعريفات متعددة في نفس الوقت.
zh_tw: 同時編輯多個引入/定義

# @action:button
source: &Batch Edit...
ar: تحرير &دفعي...
zh_tw: 批次編輯(&B)...

# @info:tooltip
source: Add a new sub-project path entry.
ar: أضف مدخل مسار مشروع فرعي جديد.
zh_tw: 新增子專案路徑項目。

# @info:tooltip
source: Delete current sub-project path entry.
ar: احذف مدخل مسار المشروع الفرعي الحالي.
zh_tw: 刪除目前的子專案路徑項目。

# @title:tab
source: Includes/Imports
ar: التضمينات/الاستيرادات
zh_tw: 引入/匯入

# @title:tab
source: Defines
ar: التعريفات
zh_tw: 定義

# @title:tab
source: C/C++ Parser
ar: محلل C/C++
zh_tw: C/C++ 剖析器

# @title:window
source: Setup Custom Include Paths
ar: أعدّ مسارات التضمين المخصصة
zh_tw: 設定自訂引入路徑

# @title:window
source: Select Directory to Include
ar: اختر مجلدًا للتضمين
zh_tw: 選擇要引入的目錄。

# @title:group
source: Storage Directory:
ar: مجلد التخزين:
zh_tw: 儲存目錄：

# @info:tooltip
source: The custom include-path will be stored in a special file called ".kdev_include_paths" stored within a source directory.
ar: سيخزن مسار التضمين المخصص في ملف خاص يسمى ".kdev_include_paths" مخزن ضمن مجلد مصدر.
zh_tw: 自訂引入路徑會儲存在原始碼目錄中叫做 ".kdev_include_paths" 的特殊檔案裡。

# @title:group
source: Custom include paths or #define's
ar: مسارات تضمين مخصصة أو تعريفات #
zh_tw: 自訂引入路徑或 #define 定義

# @info:tooltip
source: The plain list of include paths. You may also define custom macros here by adding "#define NAME VALUE" lines.
ar: القائمة العادية لمسارات التضمين. يمكنك أيضًا تعريف وحدات ماكرو مخصصة هنا بإضافة أسطر "#define NAME VALUE".
zh_tw: 引入路徑的純列表。您也可以加入 "#define 名稱 數值" 的行數來在這裡定義自訂的巨集。

# @info:tooltip
source: Select a directory to include.
ar: اختر مجلدًا للتضمين.
zh_tw: 選擇要引入的目錄。

source: Failed to save custom include paths in directory: %1
ar: أخفق حفظ مسارات التضمين المخصصة في المجلد: %1
zh_tw: 儲存自訂引入路徑到此目錄時失敗：%1
