Repository: KDE/kdevelop
Catalog: po/*/kdevperforce.po
Languages: ar, zh_tw

source: The variable P4CONFIG is not set. Is perforce installed on the system?
ar: لم تضبط متغيّر P4CONFIG. هل بـر فورس مُثبّت على النّظام؟
zh_tw: P4CONFIG 變數未設定。系統上有安裝 Perforce 嗎？

source: Perforce
ar: بـر فورس

source: Please select only one item for this operation
ar: الرجاء حدّد عنصر واحد فقط لهذه العمليّة
zh_tw: 此操作只能選擇一個項目

source: No files or message specified
ar: لم يُحدَّد ملفّات أو رسالة
zh_tw: 沒有指定檔案或訊息

source: Please select a file for this operation
ar: الرجاء حدّد ملفّاً لهذه العمليّة
zh_tw: 請選擇此操作的檔案

source: Directory not supported for this operation
ar: الدّليل غير مدعوم لهذه العمليّة
zh_tw: 此操作不能用於目錄

# @action::inmenu
source: Edit
ar: حرّر
zh_tw: 編輯

source: Unable to find perforce executable. Is it installed on the system? Is it in your PATH?
ar: لا أستطيع إيجاد مُنفَّذ بـر فورس. هل مُثبَّت على النّظام؟ هل هو في مسارك؟
zh_tw: 找不到 perforce 執行檔。您確定有安裝它嗎？它有在 PATH 裡嗎？

source: P4 Client failed with exit code: %1
ar: فشل عميل P4 برمز الخروج: %1
zh_tw: P4 用戶端已失敗，結束碼：%1

source: P4 Client failed with error code: %1
ar: فشل عميل P4 برمز الخطأ: %1
zh_tw: P4 用戶端已失敗，錯誤代碼：%1

# @label:textbox
source: Source directory:
ar: دليل المصدر:
zh_tw: 原始碼資料夾：

# @label:textbox
source: P4 executable:
ar: منفَّذ P4:
zh_tw: P4 執行檔：

source: P4 Port
ar: منفذ P4
zh_tw: P4 連結埠

# @info:tooltip
source: The format of P4PORT for Perforce applications is protocol:host:port, or port by itself if both the Perforce application and versioning service are running on the same host. Port numbers must be in the range 1024 through 32767
ar: صيغة P4PORT لتطبيقات بـر فورس هي بروتوكول:مضيف:منفذ، أو منفذ بـ ذاته إذا شغل كل من تطبيق بـر فورس وخدمة النّسخ على المضيف نفسه. يجب أن تكون أرقام المنفذ في المدى 1024 حتّى 32767
zh_tw: Perforce 應用程式用的 P4PORT 格式是 protocol:host:port（協定:主機:連結埠）；如果 Perforce 應用程式和版控服務在同一個主機下運行，也可以只使用連結埠。連結埠數字必須在 1024 到 32767 之間

source: P4 User
ar: مستخدم P4
zh_tw: P4 使用者

# @info:tooltip
source: Current Perforce user name. By default, the Perforce username is the same as the OS username
ar: اسم مستخدم بـر فورس الحالي. بـشكل **مبدئي**، اسم مستخدم بـر فورس هو نفس اسم مستخدم نظام التّشغيل
zh_tw: 目前的 Perforce 使用者名稱。Perforce 使用者名稱預設與作業系統使用者名稱相同

source: P4 Client
ar: عميل P4
zh_tw: P4 用戶端

# @info:tooltip
source: Name of current client workspace on the Perforce server
ar: اسم مساحة عمل العميل الحالية على خادم بـر فورس
zh_tw: Perforce 伺服器上目前的用戶端工作空間名稱

source: P4 Config
ar: ضبط P4
zh_tw: P4 設定檔案

# @info:tooltip
source: Contains a file name without a path. The specified file is used to store other Perforce environment variables
ar: يحتوي على اسم ملف بدون مسار. الملف المحدّد يُستخدَم لـ تخزين متغيّرات بيئة بـر فورس الأخرى
zh_tw: 包含沒有路徑的檔案名稱。指定的檔案用來儲存其他的 Perforce 環境變數

# @action:button
source: Test
ar: اختبر
zh_tw: 測試

# @option:radio
source: Config File
ar: ملف الضّبط
zh_tw: 設定檔案

# @option:radio
source: User/Port Config
ar: ضبط المستخدم/المنفذ
zh_tw: 使用者/連結埠設定

source: error: %1
zh_tw: 錯誤：%1
