Repository: KDE/kdevelop
Catalog: po/*/kdevprojectfilter.po
Languages: eu

# @title:column
source: Pattern
eu: Eredua

# @title:column
source: Targets
eu: Jomugak

# @title:column
source: Action
eu: Ekintza

source: The wildcard pattern defines whether a file or folder is included in a project or not.<br />The pattern is matched case-sensitively against the items relative path to the project root. The relative path starts with a forward slash, trailing slashes of folders are removed.<br />Patterns ending on <code>"/"</code> are implicitly considered to match against folders only.<br />Patterns which do not explicitly start with either <code>"/"</code> or <code>"*"</code> implicitly get <code>"*/"</code> prepended and thus match any item with a relative path ending on the given pattern.
eu: Zernahitarako karaktere ereduak fitxategi edo karpeta bat proiektuan barneratzen den edo ez definitzen du.<br />Eredua, maius./minus. bereizita, elementuaren proiektuarekiko bide-izen erlatiboarekin parekatzen da. Bide erlatiboa aurreranzko barra zeihar batekin hasten da, karpeten amaierako barra zeiharrak kentzen dira.<br /><code>"/"</code> bukaera duten ereduek, inplizituki, karpetekin bakarrik parekatzen direla jotzen da.<br />Esplizituki <code>"/"</code> edo <code>"*"</code> bidez hasten ez diren ereduei, inplizituki, aurretik <code>"* /"</code> ipintzen zaie, eta honela, adierazitako ereduarekin bukatzen den edozein bide-izen erlatiboren elementua bat etorriko da.

source: The target defines what type of item the filter is matched against.<br />Filters either apply only to files, only to folders or to both.
eu: Jomugak definitzen du iragazkia zein elementu motarekin parekatzen den.<br />Iragazkiak fitxategiei bakarrik, karpetei bakarrik edo biei aplikatzen zaizkie.

# @item
source: Files and Folders
eu: Fitxategiak eta karpetak

# @item
source: Folders
eu: Karpetak

# @item
source: Files
eu: Fitxategiak

source: Filters by default exclude items from the project. Inclusive patterns can be used to include items which where matched by previous exclusive patterns.<br />E.g. to only include files ending on <code>".cpp"</code> in your project, you could exclude all files via <code>"*"</code> and then apply an inclusive <code>"*.cpp"</code> pattern.
eu: Iragazkiek, era lehenetsian, proiektuko elementuak kanporatzen dituzte. Eredu barneratzaileak erabil daitezke, aurreko eredu kanporatzaileekin bat etorritako elementuak barneratzeko.<br />Adib. zure proiektuetan <code>".cpp"</code> amaitzen diren fitxategiak barneratzeko, fitxategi guztiak kanporatu zenitzake <code>"*"</code> erabiliz eta ondoren <code>"*.cpp"</code> eredu barneratzaile bat aplikatu.

# @item
source: Include
eu: Barneratu

# @item
source: Exclude
eu: Kanporatu

source: A filter with an empty pattern will match all items. Use <code>"*"</code> to make this explicit.
eu: Eredu hutsa duen iragazki bat elementu guztiekin bat etorriko da. erabili <code>"*"</code> hori esplizitu egiteko.

source: A filter ending on <code>"/"</code> can never match a file.
eu: <code>"/"</code> bukaera duen iragazki batek ezin du inoiz fitxategi batekin bat etorri.

# @title:tab
source: Configure Project Filter
eu: Konfiguratu proiektu-iragazkia

# @title:tab
source: Project Filter
eu: Proiektu iragazkia

# @action:inmenu
source: Exclude Item from Project
eu: Kanporatu elementua proiektutik

source: A filter for the item was added. To undo, use the project filter settings.
eu: Elementurako iragazki bat gehitu da. Desegiteko, erabili proiektu-iragazki ezarpenak.

# @title:window
source: Project Filter Added
eu: Proiektu iragazkia gehitu da

source: Configure which files and folders inside the project folder should be included or excluded:
eu: Konfiguratu proiektu-karpetaren barneko zein fitxategi eta karpeta barneratu edo kanporatu beharko liratekeen:

# @action:button
source: Add
eu: Gehitu

# @action:button
source: Remove
eu: Kendu

# @action:button
source: Move Up
eu: Eraman gora

# @action:button
source: Move Down
eu: Eraman behera
