Repository: KDE/kdevelop
Catalog: po/*/kdevfiletemplates.po
Languages: ar

# @info:placeholder
source: Class name, including any namespaces
ar: اسم الصنف، بما في ذلك أي فضاءات اسمية

# @info:placeholder
source: Inheritance type and base class name
ar: نوع الوراثة واسم الصنف الأساسي

# @info:placeholder
source: Variable type and identifier
ar: نوع المتغير والمحدد

# @action
source: New from Template...
ar: جديد من القالب...

# @info:whatsthis
source: Allows you to create new source code files, such as classes or unit tests, using templates.
ar: اسمح بإنشاء ملفات شيفرة مصدر جديدة، كالأصناف أو اختبارات الوحدات، باستخدام القوالب.

# @info:tooltip
source: Create new files from a template
ar: أنشئ ملفات جديدة من قالب

# @title:window
source: Template Preview
ar: معاينة القالب

# @action:inmenu
source: Create from Template...
ar: أنشئ من القالب...

# @action:inmenu
source: Show Template Preview
ar: أظهِر معاينة القالب

source: File Templates
ar: قوالب الملفات

# @item:inlistbox other license
source: Other
ar: أخرى

source: Could not load previous license
ar: لا أستطيع تحميل الترخيص السابق

source: The specified license already exists. Please provide a different name.
ar: الترخيص المحدد موجود بالفعل. قدّم اسمًا مختلفًا من فضلك.

source: Failed to write custom license template to file %1.
ar: فشلت كتابة قالب الترخيص المخصص إلى الملف %1.

source: Invalid output file: %2
ar: ملف الإخراج غير صالح: %2

# @title:group
source: Output File
ar: ملف الإخراج

# @title:group
source: Location within Existing File
ar: الموقع ضمن ملف موجود

source: Line:
ar: السطر:

source: Column:
ar: العمود:

# @item access policy
source: Public
ar: عام

# @item access policy
source: Protected
ar: محمي

# @item access policy
source: Private
ar: خاص

# @item function property
source: Constructor
ar: منشئ

# @item function property
source: Destructor
ar: هادم

# @item function property
source: Signal
ar: إشارة

# @item function property
source: Slot
ar: فتحة

# @item function property
source: Abstract function
ar: وظيفة مجردة

source: Choose one target to add the file or cancel if you do not want to do so.
ar: اختر هدفًا واحدًا لإضافة الملف أو ألغِ إذا كنت لا تريد القيام بذلك.

# @title:window
source: Create Files from Template in <filename>%1</filename>
ar: أنشئ ملفات من القالب في <filename>%1</filename>

# @title:window
source: Create Files from Template
ar: أنشئ ملفات من القالب

# @title:tab
source: Language and Template
ar: اللغة والقالب

# @title:window
source: Create Files from Template <filename>%1</filename> in <filename>%2</filename>
ar: أنشئ ملفات من القالب <filename>%1</filename> في <filename>%2</filename>

# @title:window
source: Create Files from Template <filename>%1</filename>
ar: أنشئ ملفات من القالب <filename>%1</filename>

# @title:tab
source: Class Basics
ar: أساسيات الصنف

# @title:tab
source: Override Methods
ar: أساليب التجاوز

# @title:tab
source: Class Members
ar: أعضاء الصنف

# @title:tab
source: Test Cases
ar: حالات الاختبار

# @title:tab
source: License
ar: الترخيص

# @title:tab
source: Output
ar: الإخراج

# @title:tab
source: Template Options
ar: خيارات القالب

# @item default declarations
source: Default
ar: مبدئي

source: The active text document is not a <application>KDevelop</application> template
ar: مستند النص النشط ليس قالب <application>مطورك KDevelop</application>

source: No active text document.
ar: لا مستند نص نشط.

# @title:group
source: Template Type
ar: نوع القالب

# @option:radio
source: Project template
ar: قالب مشروع

# @option:radio
source: Class template
ar: قالب صنف

# @label:listbox
source: &Empty lines policy:
ar: سياسة الأسطر &الفارغة:

# @item:inlistbox empty line policy
source: Keep Empty Lines
ar: أبقِ الأسطر الفارغة

# @item:inlistbox empty line policy
source: Remove Repeated Empty Lines
ar: أزِل الأسطر الفارغة المكررة

# @item:inlistbox empty line policy
source: Remove All Empty Lines
ar: أزِل جميع الأسطر الفارغة

# %1: template comment
source: <b>Preview:</b> %1
ar: <b>معاينة:</b> %1

# @title:column
source: Language
ar: اللغة

# @title:column
source: Framework
ar: الإطار

# @title:column
source: Template
ar: القالب

# @action:button
source: Get More Templates...
ar: احصل على المزيد من القوالب...

# @action:button
source: Load Template from File
ar: حمِّل القالب من ملف

source: Choose the license under which to place the generated content.
ar: اختر الترخيص الذي تضع بموجبه المحتوى المولّد.

# @label:listbox
source: License type:
ar: نوع الترخيص:

# @info:tooltip
source: Enable if you want to save this license for future use
ar: مكِّن إذا كنت تريد حفظ هذا الترخيص لاستخدامه لاحقًا

# @option:check
source: Save license
ar: احفظ الترخيص

source: <p>You can use <code>&lt;year&gt;</code>, <code>&lt;month&gt;</code>, <code>&lt;day&gt;</code> and <code>&lt;copyright holder&gt;</code> as placeholders.</p>
ar: <p>يمكنك استخدام <code>&lt;year&gt;</code> و <code>&lt;month&gt;</code> و <code>&lt;day&gt;</code> و <code>&lt;copyright holder&gt;</code> كعناصر نائبة.</p>

source: Identify the class and any classes from which it is to inherit.
ar: حدّد الصنف وأي أصناف يرث منها.

# @label:textbox
source: &Identifier:
ar: &المحدّد:

# @label:listbox
source: In&heritance:
ar: ال&وراثة:

source: Choose where to save the generated content.
ar: اختر أين تحفظ المحتوى المولّد.

# @option:check
source: Lower case file names
ar: أسماء ملفات بأحرف صغيرة

source: Select any methods you would like to override in the new class.
ar: اختر أي أساليب ترغب في تجاوزها في الصنف الجديد.

# @title:column
source: Superclass -> Function
ar: الصنف الأعلى -> الوظيفة

# @title:column
source: Access
ar: الوصول

# @title:column
source: Properties
ar: الخصائص

# @action:button
source: Select &All
ar: اختر ال&كل

# @action:button
source: &Deselect All
ar: أل&غِ تحديد الكل

source: Set the test name and its test cases.
ar: اضبط اسم الاختبار وحالات اختباره.

# @label:listbox
source: &Test cases:
ar: &حالات الاختبار:
