Repository: KDE/kdevelop
Catalog: po/*/kdevcmake.po
Languages: ar

# @title:window
source: Configure a Build Directory - %1
ar: اضبط دليل بناء - %1

# @title:window
source: Configure a Build Directory for %1
ar: اضبط دليل بناء لـ %1

source: You need to specify a build directory.
ar: تحتاج أن تحدّد دليل بناء.

source: Using an already created build directory.
ar: استخدم دليل بناء منشأ مسبقًا.

source: Creating a new build directory.
ar: أنشئ دليل بناء جديد.

source: Build directory already configured.
ar: دليل البناء مضبوط مسبقًا.

source: This build directory is for %1, but the project directory is %2.
ar: دليل البناء هذا هو لـ %1، لكن دليل المشروع هو %2.

source: You may not select a relative build directory.
ar: لا يجوز أن تختار دليل بناء نسبي.

source: The selected build directory is not empty.
ar: دليل البناء المختار ليس فارغًا.

# @label:listbox
source: Available build directories:
ar: أدلّة البناء المتاحة:

# @item:inlistbox
source: New build directory
ar: دليل بناء جديد

# @label:chooser
source: Build &directory:
ar: &دليل البناء:

# @label:chooser
source: &Installation prefix:
ar: &بادئة التثبيت:

# @info:tooltip
source: The prefix under which the project will be installed. Leaving this empty will let CMake use its default install prefix.
ar: البادئة التي سيُثبَّت المشروع تحتها. اترك هذا فارغًا لدع سي ميك يستخدم بادئة التثبيت المبدئية خاصته.

# @info:placeholder
source: CMake's default install prefix
ar: بادئة التثبيت المبدئية لـ سي ميك

# @label:listbox
source: Build &type:
ar: &نوع البناء:

# @label:listbox
source: Extra arguments:
ar: وسائط إضافية:

# @label:chooser
source: CMake &executable:
ar: تنفيذيّ &سي ميك:

source: INVALID
ar: غير صالح

# @item
source: Command
ar: الأمر

# @item
source: Variable
ar: متغير

# @item
source: Macro
ar: ماكرو

# @item
source: Path
ar: المسار

# @item
source: Target
ar: الهدف

source: wrong
ar: خاطئة

# @item cmake
source: Commands
ar: الأوامر

# @item cmake
source: Variables
ar: المتغيّرات

# @item cmake
source: Modules
ar: الوحدات

# @item cmake
source: Properties
ar: الخصائص

# @item cmake
source: Policies
ar: السّياسات

source: <p>For better CMake documentation rendering, install rst2html.</p>
ar: <p>لتقديم أفضل لتوثيق سي ميك، ثبّت rst2html.</p>

source: Unable to find a CMake executable. Is one installed on the system?
ar: تعذّر إيجاد تنفيذيّ لـ سي ميك. هل واحد مثبَّت على الحاسوب؟

source: <br /><em>Cache Value:</em> %1
ar: <br /><em>قيمة الخبيئة:</em> %1

source: <br /><em>Cache Documentation:</em> %1
ar: <br /><em>توثيق الخبيئة:</em> %1

# error message
source: invalid CMake file API project data
ar: بيانات مشروع واجهة برمجة ملفات سي ميك غير صالحة

source: CMake Content Page
ar: صفحة محتوى سي ميك

source: Configured project '%1' with outdated CMake data. As a result, KDevelop's code understanding may be wrong. To fix this issue, please right-click the project item in the projects tool view and click 'Reload'.
ar: اضبط المشروع '%1' ببيانات سي ميك متقادمة. نتيجة لذلك، قد يكون فهم مطوّرك للشيفرة خاطئًا. لتصحيح هذه المشكلة، انقر زر الفأرة الأيمن على عنصر المشروع في عرض أدوات المشاريع وانقر 'أعد التحميل'.

source: Failed to configure project '%1' (error message: %2). As a result, KDevelop's code understanding will likely be broken. To fix this issue, please ensure that the project's CMakeLists.txt files are correct, and KDevelop is configured to use the correct CMake version and settings. Then right-click the project item in the projects tool view and click 'Reload'.
ar: أخفق في ضبط المشروع '%1' (رسالة الخطأ: %2). نتيجة لذلك، سيُكسَر فهم مطوّرك للشيفرة على الأرجح. لتصحيح هذه المشكلة، تأكّد أن ملفّات CMakeLists.txt الخاصّة بالمشروع صحيحة، وأن مطوّرك مضبوط لاستخدام إصدار وإعدادات سي ميك الصحيحة. ثمّ انقر زر الفأرة الأيمن على عنصر المشروع في عرض أدوات المشاريع وانقر 'أعد التحميل'.

# @title:group
source: Cache Values
ar: قيم الخبيئة

# @label
source: Comment:
ar: التعليق:

# @action:button
source: Show Advanced
ar: أظهر المتقدم

# @title:group
source: Advanced
ar: متقدّم

# @label:chooser
source: Installation prefix:
ar: بادئة التثبيت:

# @label:listbox
source: Build type:
ar: نوع البناء:

# @label:chooser
source: Configure environment:
ar: اضبط البيئة:

# @info:tooltip
source: Select an environment to be used
ar: اختر بيئة للاستخدام

# @option:check
source: Show advanced values
ar: أظهر القيم المتقدّمة

# @label:chooser
source: CMake executable:
ar: تنفيذيّ سي ميك:

# @title:column
source: Name
ar: الاسم

# @title:column
source: Type
ar: النوع

# @title:column
source: Value
ar: القيمة

# @title:column
source: Comment
ar: تعليق

# @title:column
source: Advanced
ar: متقدّم

# @title:column
source: Strings
ar: السّلاسل

source: The %1 directory is about to be removed in KDevelop's list. Do you want KDevelop to delete it in the file system as well?
ar: سيُزال دليل %1 من قائمة مطوّرك. هل تريد من مطوّرك أن يحذفه من نظام الملفّات أيضًا؟

# @action:button
source: Do Not Delete
ar: لا تحذف

source: Could not remove: %1
ar: تعذّر إزالة: %1

# @title:tab
source: CMake
ar: سي ميك

# @title:tab
source: Configure CMake Settings
ar: اضبط إعدادات سي ميك

source: Parse test suite %1
ar: حلّل حزمة الاختبار %1

source: CTest
ar: سي تست

# running test %1, %2 test case
source: CTest %1: %2
ar: سي تست %1: %2

# running test %1, %2 number of test cases
source: CTest %2 (%1)
ar: سي تست %2 (%1)
