Repository: KDE/kdevelop
Catalog: po/*/kdevcompileanalyzercommon.po
Languages: ar

source: Analysis completed, no problems detected.
ar: اكتمل التحليل، لم تُكتشف أي مشاكل.

source: Analysis started...
ar: بدأ التحليل...

# @info:tooltip %2 is the path of the file
source: Re-run last %1 analysis (%2)
ar: أعد تشغيل آخر تحليل %1 (%2)

# @info:tooltip
source: Re-run last %1 analysis
ar: أعد تشغيل آخر تحليل %1

# @action
source: Analyze Current File with %1
ar: حلل الملف الحالي بـ %1

# @action
source: Analyze Current Project with %1
ar: حلل المشروع الحالي بـ %1

source: No suitable active file, unable to deduce project.
ar: لا يوجد ملف نشط ملائم، تعذّر استنتاج المشروع.

source: Active file isn't in a project.
ar: الملف النشط ليس في مشروع.

source: Unable to start check for '%1': %2
ar: تعذّر بدء فحص '%1': %2

source: Compilation database file not found: '%1'
ar: ملف قاعدة بيانات التجميع غير موجود: '%1'

source: Nothing to check: compilation database file '%1' contains no matching items.
ar: لا شيء للفحص: ملف قاعدة بيانات التجميع '%1' لا يحتوي على أي عناصر مطابقة.

source: Could not open compilation database file for reading: '%1'
ar: تعذّر فتح ملف قاعدة بيانات التجميع للقراءة: '%1'

source: JSON error during parsing compilation database file '%1': %2
ar: خطأ JSON أثناء تحليل ملف قاعدة بيانات التجميع '%1': %2

source: JSON error during parsing compilation database file '%1': document is not an array.
ar: خطأ JSON أثناء تحليل ملف قاعدة بيانات التجميع '%1': المستند ليس مصفوفة.
