Repository: KDE/kdevelop
Catalog: po/*/kdevmakebuilder.po
Languages: ar, zh_tw

# @title:tab
source: Make
ar: اصنع

# @title:tab
source: Configure Make Settings
ar: اضبط إعدادات الصنع
zh_tw: 設定 Make 選項

# @option:check
source: &Abort on first error:
ar: &أجهض عند الخطأ الأول:
zh_tw: 遇到錯誤就中止(&A)：

# @option:check
source: &Display commands but do not execute them:
ar: &اعرض الأوامر لكن لا تنفذها:
zh_tw: 顯示指令但不實際執行它們(&D)：

# @option:check
source: Insta&ll as root:
ar: &ثبّت بصلاحيات الجذر:
zh_tw: 以 root 安裝(&L)：

# @label:listbox
source: Root installation &command:
ar: أمر &تثبيت الجذر:
zh_tw: Root 安裝指令(&C)：

# @label:spinbox
source: &Number of simultaneous jobs:
ar: &عدد المهام المتزامنة:
zh_tw: 同時進行的工作數量(&N)：

# @label:chooser
source: &Make executable:
ar: &ملف التشغيل للصنع:
zh_tw: Make 執行檔(&M)：

# @label:textbox
source: Default make &target:
ar: &هدف الصنع مبدئيًا:
zh_tw: 預設的 Make 目標(&T)：

# @label:textbox
source: Additional ma&ke options:
ar: &خيارات صنع إضافية:
zh_tw: Make 的額外選項(&K)：

# @label:chooser
source: Active environment &profile:
ar: &تشكيلة البيئة النشطة:
zh_tw: 作用中的環境設定檔(&P)：

# @option:check
source: Override number of &jobs:
ar: &تجاوز عدد المهام:
zh_tw: 覆寫工作數量(&J)：

source: Make (%1): %2
ar: اصنع (%1): %2

source: Make (%1)
ar: اصنع (%1)

source: Make
ar: اصنع

source: Build item no longer available
ar: عنصر البناء لم يعد متوفراً
zh_tw: 編譯項目已不再可用

source: Internal error: cannot build a file item
ar: خطأ داخلي: لا أستطيع بناء عنصر ملف
zh_tw: 內部錯誤：無法編譯檔案項目
