Repository: KDE/kdevelop
Catalog: po/*/kdevplatform.po
Languages: ar

# @info:tooltip
source: Remove most of the controls so you can focus on what matters
ar: أزِل معظم أدوات التحكم حتى يمكنك التركيز على ما يهم

# @option:check
source: Show Left Dock
ar: اِعرض الرصيف الأيسر

# @option:check
source: Show Right Dock
ar: اِعرض الرصيف الأيمن

# @option:check
source: Show Bottom Dock
ar: اِعرض الرصيف السفلي

# @action
source: Focus Editor
ar: ركِّز المحرر

# @action
source: Hide/Restore Docks
ar: أخفِ/اِستعِد أرصفة

# @action
source: Next Tool View
ar: عرض الأداة التالي

# @action
source: Previous Tool View
ar: عرض الأداة السابق

# @title:menu
source: Tool Views
ar: مناظير الأدوات

# @action
source: Close
ar: أغلق

# @info:tooltip
source: Close message
ar: أغلق الرّسالة

source: DUChain builder application
ar: تطبيق بناء سلسلة التعريف-الاستخدام (DUChain)

source: file or directory
ar: ملف أو دليل

source: Show warnings
ar: اِعرض التحذيرات

source: Show warnings and debug output
ar: اِعرض التحذيرات وخرج التصحيح

source: Enforce an update of the top-contexts corresponding to the given files
ar: اِفرض تحديث السياقات العليا المقابلة للملفات المعطاة

source: Enforce an update of the top-contexts corresponding to the given files and all included files
ar: اِفرض تحديث السياقات العليا المقابلة للملفات المعطاة وكل الملفات المضمَّنة

source: Number of threads to use
ar: عدد الخيوط للاستخدام

source: Features to build. Options: empty, simplified-visible-declarations, visible-declarations (default), all-declarations, all-declarations-and-uses, all-declarations-and-uses-and-AST
ar: الميزات للبناء. الخيارات: فارغ، تعريفات مرئية مبسطة، تعريفات مرئية (مبدئي)، كل التعريفات، كل التعريفات والاستخدامات، كل التعريفات والاستخدامات و AST

source: Print complete Definition-Use Chain on successful parse
ar: اِطبع سلسلة التعريف-الاستخدام الكاملة عند تحليل ناجح

source: Print parent contexts when dumping contexts
ar: اِطبع سياقات الأصل عند تفريغ السياقات

source: Print complete DUChain Definitions repository on successful parse
ar: اِطبع مستودع تعريفات سلسلة التعريف-الاستخدام (DUChain) الكامل عند تحليل ناجح

source: Print complete DUChain PersistentSymbolTable repository on successful parse
ar: اِطبع مستودع جدول الرموز الدائم لسلسلة التعريف-الاستخدام (DUChain) الكامل عند تحليل ناجح

source: Number defining the maximum depth where declaration details are printed
ar: عدد يحدد العمق الأقصى حيث تفاصيل التعريف تطبع

source: Dump DUChain graph (in .dot format)
ar: فرِّغ رسم سلسلة التعريف-الاستخدام (DUChain) (بتنسيق .dot)

source: Print problems encountered during parsing
ar: اِطبع المشاكل التي صادفت أثناء التحليل

source: Recursively dump errors from imported contexts.
ar: فرِّغ الأخطاء تكرارياً من السياقات المستوردة.

# @title:column
source: Profile
ar: التشكيلة

# @item:inlistbox
source: Use default profile (currently: %1)
ar: اِستخدِم التشكيلة المبدئية (الحالية: %1)

# @item:inlistbox
source: %1 (does not exist)
ar: %1 (غير موجود)

source: Task aborted
ar: المهمة أُجهِضت

source: Run all tests in %1
ar: شغِّل كل الاختبارات في %1

source: You don't have write permissions for the following files; add write permissions for owner before saving?
ar: ليس لديك صلاحيات كتابة للملفات التالية؛ هل تُريد إضافة صلاحيات كتابة للمالك قبل الحفظ؟

# @title:window
source: Some Files are Write-Protected
ar: بعض الملفات محمية ضد الكتابة

# @action:button
source: Set Write Permissions
ar: اِضبط صلاحيات الكتابة

# @action:button
source: Ignore
ar: تجاهل

source: Failed adding write permissions for some files.
ar: فشِل إضافة صلاحيات كتابة لبعض الملفات.

# @title:window
source: Failed Setting Permissions
ar: فشِل ضبط الصلاحيات

source: There is a quoting error in the %1 for the launch configuration '%2'. Aborting start.
ar: هناك خطأ في الاقتباس في %1 لضبط التشغيل '%2'. إجهاض البدء.

source: A shell meta character was included in the %1 for the launch configuration '%2', this is not supported currently. Aborting start.
ar: جُمع حرف ميتا للصدفة في %1 لضبط التشغيل '%2'، هذا غير مدعوم حالياً. إجهاض البدء.

source: KShell::splitArgs(<the %1>) reported an unknown error code %2 for the launch configuration '%3'. Aborting start.
ar: KShell::splitArgs(<الـ %1>) أبلغ عن رمز خطأ غير معروف %2 لضبط التشغيل '%3'. إجهاض البدء.

source: Splitting the %1 for the launch configuration '%2' yields an empty list. Aborting start.
ar: تقسيم %1 لضبط التشغيل '%2' ينتج قائمة فارغة. إجهاض البدء.

source: Empty %1 specified for the launch configuration '%2'. Aborting start.
ar: حُدد %1 فارغ لضبط التشغيل '%2'. إجهاض البدء.

source: No valid %1 specified for the launch configuration '%2'. Aborting start.
ar: لا يوجد %1 صالح حُدد لضبط التشغيل '%2'. إجهاض البدء.

source: Working Directory does not exist: %1
ar: دليل العمل غير موجود: %1

source: Working Directory is not absolute: %1
ar: دليل العمل ليس مطلقاً: %1

source: Process '%1' exited with status %2 %3
ar: العملية '%1' انتهت بالحالة %2 %3

source: Command finished with error %1.
ar: الأمر انتهى بالخطأ %1.

source: Command exited with value %1.
ar: الأمر انتهى بالقيمة %1.

source: error: %1
ar: خطأ: %1

# @action:inmenu
source: Branches...
ar: الفروع...

# @title:window
source: Branch Manager
ar: مدير الفروع

source: You must select a base branch from the list before creating a new branch.
ar: اِختر فرعاً أساسياً من القائمة قبل إنشاء فرع جديد.

# @title:window
source: New Branch
ar: فرع جديد

# @label:textbox
source: Name of the new branch:
ar: اسم الفرع الجديد:

source: Branch "%1" already exists. Please, choose another name.
ar: الفرع "%1" موجود سلفاً. اِختر اسماً آخر.

source: Currently at the branch "%1". To delete it, please change to another branch.
ar: حالياً على الفرع "%1". لحذفه، اِنتقل إلى فرع آخر.

source: Are you sure you want to irreversibly delete the branch '%1'?
ar: هل أنت متأكِّد أنك تُريد حذف الفرع '%1' على نحو لا رجعة فيه؟

source: Already on branch "%1"
ar: بالفعل على الفرع "%1"

source: Branch "%1" doesn't exists. Please, choose another name.
ar: الفرع "%1" غير موجود. اِختر اسماً آخر.

source: You must select a branch to merge into current one from the list.
ar: اِختر فرعاً للدمج في الفرع الحالي من القائمة.

source: Could not create a patch for the current version.
ar: لا أستطيع إنشاء رقعة للنسخة الحالية.

# @titlew:indow
source: Unable to Retrieve Diff
ar: غير قادر على استرداد الفرق

source: There are no committed differences.
ar: لا توجد اختلافات ملتزمة.

# @title:window
source: VCS Support
ar: دعم نظام تحكم في النسخ (VCS)

# @info:tooltip
source: Creates new branch based on the selected branch
ar: يُنشئ فرعاً جديداً بناء على الفرع المحدَّد

# @action:button new branch
source: New
ar: جديد

# @info:tooltip
source: The same as git branch -D
ar: نفس git branch -D

# @action:button
source: Rename
ar: غيّر الاسم

# @info:tooltip
source: <p>Show changes between the current branch (or staging area, if not empty) and the last commit on the selected branch.</p>
ar: <p>اِعرض التغييرات بين الفرع الحالي (أو منطقة التدريج، إذا لم تكن فارغة) وآخر التزام على الفرع المحدَّد.</p>

# @action:button
source: Compare to Branch
ar: قارِن بالفرع

# @info:tooltip
source: Checkout to the selected branch
ar: اِجلب الفرع المحدَّد

# @action:button checkout a version
source: Checkout
ar: اسحب

# @action:button merge a branch
source: Merge
ar: ادمج

# @label:textbox
source: Source directory:
ar: الدليل المصدر:

# @label:textbox
source: Commit message:
ar: رسالة الالتزام:

source: Branch "%1" already exists.
ar: الفرع "%1" موجود سلفاً.

source: Are you sure you want to rename "%1" to "%2"?
ar: هل أنت متأكِّد أنك تُريد إعادة تسمية "%1" إلى "%2"؟

source: Author:
ar: المؤلّف:

source: Date:
ar: التّاريخ:

source: Commit message:
ar: رسالة الالتزام:

# @title:column
source: Revision
ar: المراجعة

# @title:column
source: Message
ar: الرّسالة

# @title:column
source: Author
ar: المؤلف

# @title:column
source: Date
ar: التاريخ

# @item file was added to versioncontrolsystem
source: Added
ar: أضيف في

# @item file was deleted from versioncontrolsystem
source: Deleted
ar: حُذف

# @item file is conflicting (versioncontrolsystem)
source: Has Conflicts
ar: لديه تعارضات

# @item version controlled file was modified
source: Modified
ar: معدّل

# @item file is up to date in versioncontrolsystem
source: Up To Date
ar: م&حدث

# @item file is not known to versioncontrolsystem
source: Unknown
ar: مجهول

# @title:column
source: Filename
ar: اسم الملفّ

# @title:column
source: Status
ar: الحالة

# @item
source: Added
ar: أضيف في

# @item
source: Deleted
ar: حُذف

# @item
source: Modified
ar: معدّل

# @item
source: Copied
ar: نُسخ

# @item
source: Replaced
ar: اِستُبدِل

# @title:column
source: Location
ar: المكان

# @title:column
source: Actions
ar: الإجراءات

# @title:column
source: Source Location
ar: موقع المصدر

# @title:column
source: Source Revision
ar: مراجعة المصدر

# @action:inmenu
source: Commit...
ar: أوْدِعْ...

# @action:inmenu
source: Update
ar: حدّث

# @action:inmenu
source: Add
ar: أضف

# @action:inmenu
source: Show Differences...
ar: اِعرض الاختلافات...

# @action:inmenu
source: Revert
ar: اعكس

# @action:inmenu revision history
source: History...
ar: التّأريخ

# @action:inmenu
source: Annotation...
ar: الشرح...

# @action:inmenu
source: Show Diff...
ar: أظهر الفرق...

# @action:inmenu
source: Show Diff (All Files)...
ar: اِعرض الفرق (كل الملفات)...

# @action:inmenu
source: Push
ar: ادفع

# @action:inmenu
source: Pull
ar: اسحب

source: There are no differences.
ar: لا توجد اختلافات.

# @title:window
source: Unable to Get Differences
ar: غير قادر على الحصول على اختلافات

# @title:window %1: path or URL, %2: name of a version control system
source: %2 History (%1)
ar: %2 التاريخ (%1)

source: Cannot display annotations, missing interface KTextEditor::AnnotationInterface for the editor.
ar: لا أستطيع عرض التعليقات التوضيحية، واجهة KTextEditor::AnnotationInterface للمحرر مفقودة.

source: Cannot execute annotate action because the document was not found, or was not a text document: %1
ar: لا أستطيع تنفيذ إجراء التعليق التوضيحي لأن المستند لم يعثر عليه، أو لم يكن مستنداً نصياً: %1

# @action:inmenu
source: Copy Revision Id
ar: اِنسخ معرِّف المراجعة

# @info:placeholder
source: Enter the repository URL...
ar: أدخِل مسار مخزن الإيداع URL...

# @item age
source: %1 year
ar: %1 سنة

# @item age
source: %1 month
ar: شهر واحِد

# @item age
source: %1 day
ar: %1 يوم

# @item age
source: Today
ar: اليوم

# By: commit author
source: By: %1
ar: بواسطة: %1

# @title:window
source: Select Files to Commit
ar: اِختر الملفات للالتزام

# @label:listbox
source: Commit files:
ar: ملفات الالتزام:

source: Old Messages
ar: رسائل قديمة

source: For more detailed information please see the Version Control tool view.
ar: للمزيد من المعلومات المفصَّلة اِطَّلع على عرض أداة نظام تحكم في النسخ.

source: Unable to commit
ar: غير قادر على الالتزام

# @title:window
source: Commit Unsuccessful
ar: الالتزام غير ناجح

# @action:button To make a commit
source: Commit
ar: أوْدِعْ

source: <qt>Files will be committed: <ul>%1</ul> With message: <pre>%2</pre></qt>
ar: <qt>الملفات تلتزم: <ul>%1</ul> بالرسالة: <pre>%2</pre></qt>

# @title:window
source: About to Commit to Repository
ar: على وشك الالتزام في مخزن الإيداع

# @label
source: Difference between revision %1 and %2:
ar: الفرق بين المراجعة %1 و %2:

# @label
source: Difference between revisions:
ar: الفرق بين المراجعات:

# @action:inmenu
source: Diff to Previous Revision
ar: فرق إلى المراجعة السابقة

# @action:inmenu
source: Diff between Revisions
ar: فرق بين المراجعات

# @title:window
source: Difference To Previous
ar: فرق إلى السابق

# @title:window
source: Difference between Revisions
ar: فرق بين المراجعات
