{
    "KPlugin": {
        "Category": "Core",
        "Description": "Provides a text output tool view for other plugins to use, to show things like compiler messages.",
        "Description[ar]": "توفّر عرض أداة خرج نصيّ لملحقات أخرى لاستخدامه، لإظهار أشياء مثل رسائل المصرّف.",
        "Description[az]": "Tərtibçi ismarıclarına bənzər şeylərin göstərilməsi üçün istifadə ediləcək digər qoşmalar üçün mətn çıxışını göstərən vasitəni təqdim edir.",
        "Description[ca@valencia]": "Proporciona una vista d'eina d'eixida de text per a utilitzar en altres connectors, per a visualitzar missatges del compilador, per exemple.",
        "Description[ca]": "Proporciona una vista d'eina de sortida de text per a usar en altres connectors, per a visualitzar missatges del compilador, per exemple.",
        "Description[cs]": "Umožňuje používat jiným zásuvným modulům nástrojový pohled textového výstupu, aby ukázal různé věci, jako třeba zprávy kompilátoru.",
        "Description[de]": "Stellt eine Textausgabe für andere Module zur Verfügung, um Informationen wie Compiler-Nachrichten anzuzeigen.",
        "Description[el]": "Παρέχει ένα εργαλείο προβολής κειμένου στην έξοδο για χρήση από άλλα πρόσθετα, για την εμφάνιση μηνυμάτων όπως τα μηνύματα του μεταγλωττιστή.",
        "Description[en_GB]": "Provides a text output tool view for other plugins to use, to show things like compiler messages.",
        "Description[eo]": "Provizas tekstan eligvidon por aliaj kromprogramoj por uzi, por montri aferojn kiel kompililmesaĝojn.",
        "Description[es]": "Proporciona un visor de salida de texto para que otros complementos muestren cosas como mensajes del compilador, por ejemplo.",
        "Description[et]": "Teistele pluginatele kättesaadav tekstiväljundi tööriistavaade, mis näitab kompilaatori teateid ja muud.",
        "Description[eu]": "Beste pluginek erabiltzeko testu-irteerako tresna ikuspegi bat hornitzen du, konpilatzailearen mezuen gisako gauzak erakusteko.",
        "Description[fi]": "Tarjoaa muille liitännäisille tekstitulostenäkymän kääntäjäviestien tapaisten asioiden näyttämiseksi.",
        "Description[fr]": "Fournit un outil d'affichage de la sortie texte pour utilisation par d'autres modules, pour afficher des choses comme des messages de compilateur.",
        "Description[gl]": "Fornece unha ferramenta de saída de texto a outros complementos, para amosar cousas como mensaxes do compilador.",
        "Description[it]": "Fornisce una vista degli strumenti testuale che può essere usata dalla estensioni per mostrare cose come i messaggi del compilatore.",
        "Description[ka]": "მოგაწვდით ტექტის გამოტანის ხელსაწყოს ხედს სხვა დამატებებისთვის, რომ მათ გაჩვენონ ისეთი ელემენტები, როგორიცაა, ვთქვათ, კომპილატორის შეტყობინებები.",
        "Description[ko]": "컴파일러 메시지와 같은 것을 표시할 수 있도록 다른 플러그인에 텍스트 출력 보기를 제공합니다.",
        "Description[nl]": "Levert tekstuitvoer van hulpmiddelen voor andere te gebruiken plugins, om zaken te tonen zoals berichten van compilers.",
        "Description[pl]": "Udostępnia widok wyniku dla innych wtyczek, aby pokazywały np. dane z kompilatora.",
        "Description[pt]": "Oferece uma área de texto para os outros 'plugins' usarem, para apresentar algumas coisas, como as mensagens do compilador.",
        "Description[pt_BR]": "Oferece uma área de resultados de texto para os outros plugins usarem, de modo a mostrar coisas como as mensagens do compilador.",
        "Description[ru]": "Предоставляет другим расширениям средство вывода текста для показа, например сообщений компилятора",
        "Description[sa]": "अन्येषां प्लगिन्स् कृते उपयोगाय, संकलकसन्देशाः इत्यादीनि वस्तूनि दर्शयितुं पाठनिर्गमसाधनदृश्यं प्रदाति ।",
        "Description[sk]": "Poskytuje nástroj textového výstupu na použitie pre iné doplnky, napríklad na zobrazenie správ prekladača.",
        "Description[sl]": "Drugim vstavkom ponuja okno za prikaz besedilnega izhoda, na primer za sporočila izgrajevalnika.",
        "Description[sv]": "Tillhandahåller en verktygsvy för textutmatning som andra insticksprogram kan använda för att visa saker som kompilatormeddelanden.",
        "Description[tr]": "Derleyici iletileri gibi şeyleri göstermek için diğer eklentilere bir metin çıktısı görünümü sağlar.",
        "Description[uk]": "Забезпечує роботу панелі показу текстових даних інших додатків, зокрема попереджень компілятора.",
        "Description[zh_CN]": "提供让其他插件使用的文本输出工具视图，以便显示诸如编译器消息的信息。",
        "Description[zh_TW]": "提供文字輸出工具檢視給其它外掛程式使用，顯示一些像是編譯器的訊息等等。",
        "Icon": "kdevelop",
        "Name": "Output View",
        "Name[ar]": "عرض الخَرْج",
        "Name[az]": "Çıxarış icmalı",
        "Name[bg]": "Преглед на резултата",
        "Name[bs]": "Pregled izlaza",
        "Name[ca@valencia]": "Vista de l'eixida",
        "Name[ca]": "Vista de la sortida",
        "Name[cs]": "Pohled na výstup",
        "Name[da]": "Visning af output",
        "Name[de]": "Ansicht für Ausgaben",
        "Name[el]": "Προβολή αποτελεσμάτων",
        "Name[en_GB]": "Output View",
        "Name[eo]": "Eligo Vido",
        "Name[es]": "Vista de la salida",
        "Name[et]": "Väljundivaade",
        "Name[eu]": "Irteerako ikuspegia",
        "Name[fi]": "Tulosnäkymä",
        "Name[fr]": "Vue de la sortie",
        "Name[ga]": "Amharc Aschurtha",
        "Name[gl]": "Vista da saída",
        "Name[he]": "תצוגת פלט",
        "Name[hu]": "Kimenet nézet",
        "Name[it]": "Vista output",
        "Name[ka]": "გამოტანის ხედი",
        "Name[kk]": "Шығыс көрінісі",
        "Name[ko]": "출력 보기",
        "Name[nb]": "Utdata-visning",
        "Name[nds]": "Utgaavansicht",
        "Name[nl]": "Uitvoerweergave",
        "Name[pl]": "Widok wyjścia",
        "Name[pt]": "Área de Resultados",
        "Name[pt_BR]": "Área de resultados",
        "Name[ru]": "Панель вывода",
        "Name[sa]": "आउटपुट् दृश्यम्",
        "Name[sk]": "Pohľad na výstup",
        "Name[sl]": "Prikaz izhoda",
        "Name[sv]": "Utmatningsvisning",
        "Name[tr]": "Çıktı Görünümü",
        "Name[ug]": "چىقىرىش كۆرۈنۈشى",
        "Name[uk]": "Перегляд виводу",
        "Name[zh_CN]": "输出视图",
        "Name[zh_TW]": "輸出檢視"
    },
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IOutputView"
    ],
    "X-KDevelop-Mode": "GUI"
}
