{
    "KPlugin": {
        "Category": "Core",
        "Description": "Provides a text output toolview for other plugins to use, to show things like compiler messages.",
        "Description[ca@valencia]": "Proporciona una vista d'eina d'eixida de text per a utilitzar en altres connectors, per a visualitzar missatges del compilador, per exemple.",
        "Description[ca]": "Proporciona una vista d'eina de sortida de text per a utilitzar en altres connectors, per a visualitzar missatges del compilador, per exemple.",
        "Description[cs]": "Umožňuje používat jiným zásuvným modulům nástrojový pohled textového výstupu, aby ukázal různé věci, jako třeba zprávy kompilátoru.",
        "Description[de]": "Stellt eine Textausgabe für andere Module zur Verfügung, um Dinge wie Compiler-Nachrichten anzuzeigen.",
        "Description[es]": "Proporciona un visor de salida de texto para que otros complementos muestren cosas como mensajes del compilador, por ejemplo.",
        "Description[et]": "Teistele pluginatele kättesaadav tekstiväljundi tööriistavaade, mis näitab kompilaatori teateid ja muud.",
        "Description[fr]": "Fournit un outil d'affichage de la sortie texte pour utilisation par d'autres modules, pour afficher des choses comme des messages de compilateur.",
        "Description[gl]": "Fornece unha ferramenta de saída de texto a outros complementos, para mostrar cousas como mensaxes do compilador.",
        "Description[it]": "Fornisce una vista strumenti testuale che può essere usata dalla estensioni per mostrare cose come i messaggi del compilatore.",
        "Description[nl]": "Levert tekstuitvoer van hulpmiddelen voor andere te gebruiken plugins, om zaken te tonen zoals berichten van compilers.",
        "Description[pl]": "Zapewnia widok narzędzia wyjścia tekstu dla wykorzystania w innych wtyczkach, aby pokazać rzeczy takie jak komunikaty kompilatora.",
        "Description[pt]": "Oferece uma área de texto para os outros 'plugins' usarem, para apresentar algumas coisas, como as mensagens do compilador.",
        "Description[pt_BR]": "Oferece uma área de resultados de texto para os outros plugins usarem, de modo a mostrar coisas como as mensagens do compilador.",
        "Description[sk]": "Poskytuje textový výstup pohľadu nástrojov pre iné pluginy na použitie, na zobrazenie napríklad správy prekladača.",
        "Description[sl]": "Drugim vstavkom ponuja okno za prikaz besedilnega izhoda, na primer za sporočila izgrajevalnika.",
        "Description[sv]": "Tillhandahåller en verktygsvy för textutmatning som andra insticksprogram kan använda för att visa saker som kompilatormeddelanden.",
        "Description[tr]": "Diğer eklentilerin derleyici iletileri gibi şeyleri göstermesi için metin çıktı araç görünümü sağlar.",
        "Description[uk]": "Забезпечує роботу панелі показу текстових даних інших додатків, зокрема попереджень компілятора.",
        "Description[x-test]": "xxProvides a text output toolview for other plugins to use, to show things like compiler messages.xx",
        "Description[zh_CN]": "提供让其它插件使用的文本输出工具视图，以便显示诸如编译器消息的信息。",
        "Icon": "kdevelop",
        "Id": "KDevStandardOutputView",
        "Name": "Output View",
        "Name[ca@valencia]": "Vista de l'eixida",
        "Name[ca]": "Vista de la sortida",
        "Name[cs]": "Pohled na výstup",
        "Name[de]": "Ansicht für Ausgaben",
        "Name[es]": "Vista de la salida",
        "Name[et]": "Väljundivaade",
        "Name[fr]": "Vue de la sortie",
        "Name[gl]": "Vista da saída",
        "Name[it]": "Vista output",
        "Name[nb]": "Utdata-visning",
        "Name[nl]": "Uitvoerweergave",
        "Name[pl]": "Widok wyjścia",
        "Name[pt]": "Área de Resultados",
        "Name[pt_BR]": "Área de resultados",
        "Name[ru]": "Панель вывода",
        "Name[sk]": "Pohľad na výstup",
        "Name[sl]": "Prikaz izhoda",
        "Name[sv]": "Utmatningsvisning",
        "Name[tr]": "Çıktı Görünümü",
        "Name[uk]": "Перегляд виводу",
        "Name[x-test]": "xxOutput Viewxx",
        "Name[zh_CN]": "输出视图",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IOutputView"
    ],
    "X-KDevelop-Mode": "GUI"
}
