{
    "KPlugin": {
        "Description": "Scratchpad lets you quickly run and experiment with code without a full project, and even store todos.",
        "Description[ar]": "المفكّرة تسمح لك بتشغيل الشِّفرة وتجربتها سريعًا دون مشروع كامل، وحتّى تخزين ما يجب فعله.",
        "Description[az]": "Scratchpad, tam bir layihə olmadan, kodu sürətlə işə salmanıza və təcrübə etmənizə və hətta tapşırıqları saxlamanıza imkan yaradır.",
        "Description[ca@valencia]": "Scratchpad permet executar i experimentar ràpidament amb el codi sense un projecte complet, i inclús emmagatzemar tasques pendents.",
        "Description[ca]": "L'Scratchpad permet executar i experimentar ràpidament amb el codi sense un projecte complet, i inclús emmagatzemar tasques pendents.",
        "Description[de]": "Mit Notizblock können Sie Code schnell ausführen und mit ihm experimentieren, ohne ein vollständiges Projekt zu erstellen oder Todos zu speichern.",
        "Description[el]": "Το scratchpad σας επιτρέπει τη γρήγορη εκτέλεση και πειραματισμό με κώδικα χωρίς πλήρες έργο και αποθηκεύει ακόμη και todos.",
        "Description[en_GB]": "Scratchpad lets you quickly run and experiment with code without a full project, and even store to-dos.",
        "Description[eo]": "Scratchpad ebligas vin rapide kuri kaj eksperimenti kun kodo sen plena projekto, kaj eĉ stoki ĉiujn.",
        "Description[es]": "Scratchpad le permite ejecutar y experimentar con código rápidamente con código sin un proyecto completo, e incluso guardar listas de cosas por hacer.",
        "Description[et]": "Märkmik võimaldab kiiresti käitada koodi ja sellega eksperimenteerida ilma täielikku projekti loomata ning isegi ülesandeid salvestada.",
        "Description[eu]": "«Scratchpad»ek, proiektu oso bat izan gabe, kodea azkar exekutatu eta harekin esperimentatzen, baita zereginak gordetzen ere, uzten dizu.",
        "Description[fr]": "Le brouillon vous permet de lancer et d'essayer rapidement du code sans créer un projet complet, vous pouvez même vous en servir pour stocker des listes de tâches.",
        "Description[gl]": "O caderno de notas permítelle executar e experimentar con código rapidamente sen un proxecto completo, e mesmo pode gardar listas de tarefas.",
        "Description[he]": "פנקס השרבוטים מאפשר לך להריץ ניסוי עם קוד ללא תלות במיזם השלם ואפילו לאחסן מטלות.",
        "Description[it]": "Il blocco appunti ti permette di sperimentare ed eseguire rapidamente il codice senza un progetto completo, ed anche memorizzare un elenco di cose da fare.",
        "Description[ka]": "Scratchpad საშუალებას გაძლევთ, სწრაფად გაუშვათ და იქსპერიმენტოთ კოდთან პროექტის შექმნის გარეშე და გეგმების შენახვაც კი.",
        "Description[ko]": "스크래치패드를 사용하여 프로젝트를 만들지 않고도 코드를 빠르게 실행하고 실험해 볼 수 있으며, 할 일 목록을 저장할 수도 있습니다.",
        "Description[nl]": "Kladblol laat u snel code uitvoeren en mee experimenteren zonder een volledig project en zelfs to-do's opslaan.",
        "Description[pl]": "Daje bazgroszyt do szybkiego wykonywania i próbowania kodu poza projektem.",
        "Description[pt]": "A Área de Rascunhos permite-lhe executar e experimentar rapidamente código sem ter um projecto completo ou mesmo guardar listas de tarefas.",
        "Description[pt_BR]": "A área de rascunhos permite-lhe executar e experimentar rapidamente o código sem ter um projeto completo ou mesmo guardar listas de tarefas.",
        "Description[ru]": "С помощью блокнота можно быстро создать фрагмент кода и поэкспериментировать с ним без создания полноценного проекта. Также возможно сохранять задачи.",
        "Description[sa]": "Scratchpad भवन्तं पूर्णप्रकल्पं विना शीघ्रं चालयितुं प्रयोगं च कर्तुं शक्नोति, अपि च todos संग्रहीतुं शक्नोति ।",
        "Description[sk]": "Scratchpad vám umožní rýchlo spustiť a experimentovať s kódom bez plného projektu a dokonca ukladať úlohy.",
        "Description[sl]": "Čečkalnik vam omogoča hitri zagon in eksperimentiranje s kodo brez celotnega projekta in celo shranjevanje seznama nalog.",
        "Description[sv]": "Kladdblock låter dig snabbt köra och experimentera med kod utan ett fullständigt projekt, och till och med lagra uppgifter.",
        "Description[tr]": "Karalama Defteri, kod ile bir proje açmaya gerek kalmadan çalışma ve deneyler yapmanıza ve yapılacakları depolamanıza izin verir.",
        "Description[uk]": "За допомогою нотатника ви можете швидко створити фрагмент коду та поекспериментувати з ним без створення повноцінного проєкту. Можливе навіть створення завдань на майбутнє.",
        "Description[zh_CN]": "通过刮板，您可以在没有完整项目的情况下快速运行和试验代码，甚至可以存储待办事项。",
        "Description[zh_TW]": "試寫區讓您快速執行程式碼進行快速實驗，不需要建立完整專案，還讓您可以儲存待辦事項。",
        "Icon": "note",
        "Name": "Scratchpad",
        "Name[ar]": "المفكّرة",
        "Name[az]": "İş dəftəri",
        "Name[ca@valencia]": "Scratchpad",
        "Name[ca]": "Scratchpad",
        "Name[de]": "Notizblock",
        "Name[el]": "Scratchpad",
        "Name[en_GB]": "Scratchpad",
        "Name[eo]": "Scratchpad",
        "Name[es]": "Scratchpad",
        "Name[et]": "Märkmik",
        "Name[eu]": "«Scratchpad»",
        "Name[fr]": "Brouillon",
        "Name[gl]": "Caderno de notas",
        "Name[he]": "פנקס שרבוטים",
        "Name[it]": "Blocco appunti",
        "Name[ka]": "საჩხაპნი",
        "Name[ko]": "스크래치패드",
        "Name[nl]": "Kladblok",
        "Name[pl]": "Bazgroszyt",
        "Name[pt]": "Área de Rascunhos",
        "Name[pt_BR]": "Scratchpad",
        "Name[ru]": "Блокнот",
        "Name[sa]": "स्क्रैचपैड",
        "Name[sk]": "Scratchpad",
        "Name[sl]": "Čečkalnik",
        "Name[sv]": "Kladdblock",
        "Name[tr]": "Karalama Defteri",
        "Name[uk]": "Нотатник для чернеток",
        "Name[zh_CN]": "刮板",
        "Name[zh_TW]": "試寫區"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
