{
    "KPlugin": {
        "Description": "Scratchpad lets you quickly run and experiment with code without a full project, and even store todos.",
        "Description[ca@valencia]": "L'Scratchpad permet executar i experimentar ràpidament amb el codi sense un projecte complet, i inclús emmagatzemar tasques pendents.",
        "Description[ca]": "L'Scratchpad permet executar i experimentar ràpidament amb el codi sense un projecte complet, i inclús emmagatzemar tasques pendents.",
        "Description[en_GB]": "Scratchpad lets you quickly run and experiment with code without a full project, and even store to-dos.",
        "Description[es]": "Scratchpad le permite ejecutar y experimentar con código rápidamente con código sin un proyecto completo, e incluso guardar listas de cosas por hacer.",
        "Description[fr]": "Le brouillon vous permet de lancer et d'essayer rapidement du code sans créer un projet complet, vous pouvez même vous en servir pour stocker des listes de tâches.",
        "Description[gl]": "O caderno de notas permítelle executar e experimentar con código rapidamente sen un proxecto completo, e mesmo pode gardar listas de tarefas.",
        "Description[it]": "Il blocco note ti permette di sperimentare ed eseguire rapidamente il codice senza un progetto completo, ed anche memorizzare un elenco di cose da fare.",
        "Description[nl]": "Kladblol laat u snel code uitvoeren en mee experimenteren zonder een volledig project en zelfs to-do's opslaan.",
        "Description[pl]": "Bazgroszyt umożliwia szybkie wykonanie kodu, a także wykonywanie na nim prób bez pełnego projektu. Umożliwia także zapisywanie sobie zadań do zrobienia.",
        "Description[pt]": "A Área de Rascunhos permite-lhe executar e experimentar rapidamente código sem ter um projecto completo ou mesmo guardar listas de tarefas.",
        "Description[pt_BR]": "A área de rascunhos permite-lhe executar e experimentar rapidamente o código sem ter um projeto completo ou mesmo guardar listas de tarefas.",
        "Description[sv]": "Kladdblock låter dig snabbt köra och experimentera med kod utan ett fullständigt projekt, och till och med lagra uppgifter.",
        "Description[uk]": "За допомогою нотатника ви можете швидко створити фрагмент коду та поекспериментувати з ним без створення повноцінного проєкту. Можливе навіть створення завдань на майбутнє.",
        "Description[x-test]": "xxScratchpad lets you quickly run and experiment with code without a full project, and even store todos.xx",
        "Description[zh_CN]": "通过刮板，您可以在没有完整项目的情况下快速运行和试验代码，甚至可以存储待办事项。",
        "Id": "scratchpad",
        "Name": "Scratchpad",
        "Name[ca@valencia]": "Scratchpad",
        "Name[ca]": "Scratchpad",
        "Name[en_GB]": "Scratchpad",
        "Name[es]": "Scratchpad",
        "Name[fr]": "Brouillon",
        "Name[gl]": "Caderno de notas",
        "Name[it]": "Blocco note",
        "Name[nl]": "Kladblok",
        "Name[pl]": "Bazgroszyt",
        "Name[pt]": "Área de Rascunhos",
        "Name[pt_BR]": "Scratchpad",
        "Name[sv]": "Kladdblock",
        "Name[uk]": "Нотатник для чернеток",
        "Name[x-test]": "xxScratchpadxx",
        "Name[zh_CN]": "刮板",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
