{
    "KPlugin": {
        "Description": "Scratchpad lets you quickly run and experiment with code without a full project, and even store todos.",
        "Description[ca]": "L'Scratchpad permet executar i experimentar ràpidament amb el codi sense un projecte complet, i inclús emmagatzemar tasques pendents.",
        "Description[es]": "Scratchpad le permite ejecutar y experimentar con código rápidamente con código sin un proyecto completo, e incluso guardar listas de cosas por hacer.",
        "Description[fr]": "Le brouillon vous permet de lancer et d'essayer rapidement du code sans créer un projet complet, vous pouvez même vous en servir pour stocker des listes de tâches.",
        "Description[it]": "Il blocco appunti ti permette di sperimentare ed eseguire rapidamente il codice senza un progetto completo, ed anche memorizzare un elenco di cose da fare.",
        "Description[nl]": "Scratchpad lets you quickly run and experiment with code without a full project, and even store todos.",
        "Description[pl]": "Bazgroszyt umożliwia szybkie wykonanie kodu, a także wykonywanie na nim prób bez pełnego projektu. Umożliwia także zapisywanie sobie zadań do zrobienia.",
        "Description[pt]": "O Quadro permite-lhe executar e experimentar rapidamente o código sem ter um projecto completo, ou ainda registar tarefas.",
        "Description[pt_BR]": "A área de rascunhos permite-lhe executar e experimentar rapidamente o código sem ter um projeto completo ou mesmo guardar listas de tarefas.",
        "Description[uk]": "За допомогою нотатника ви можете швидко створити фрагмент коду та поекспериментувати з ним без створення повноцінного проєкту. Можливе навіть створення завдань на майбутнє.",
        "Description[x-test]": "xxScratchpad lets you quickly run and experiment with code without a full project, and even store todos.xx",
        "Id": "scratchpad",
        "Name": "Scratchpad",
        "Name[ca]": "Scratchpad",
        "Name[es]": "Scratchpad",
        "Name[fr]": "Brouillon",
        "Name[it]": "Blocco appunti",
        "Name[nl]": "Scratchpad",
        "Name[pl]": "Bazgroszyt",
        "Name[pt]": "Quadro",
        "Name[pt_BR]": "Scratchpad",
        "Name[uk]": "Нотатник для чернеток",
        "Name[x-test]": "xxScratchpadxx",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
