{
    "KPlugin": {
        "Category": "Utilities",
        "Description": "This plugin provides KDevelop with an embedded konsole for quick and easy command line access.",
        "Description[ar]": "توفّر هذه الملحقة لمطوّرك كونسول مضمّن لوصول سريع وسهل لسطر الأوامر",
        "Description[az]": "Bu qoşma, əmr sətrinə tez və rahat giriş üçün KDevelop'u daxili konsol ilə təmin edir.",
        "Description[ca@valencia]": "Este connector proporciona a KDevelop un Konsole incrustat per a accedir de manera ràpida i fàcil a la línia d'ordres.",
        "Description[ca]": "Aquest connector proporciona al KDevelop un Konsole incrustat per a accedir de manera ràpida i fàcil a la línia d'ordres.",
        "Description[cs]": "Tento zásuvný modul poskytuje vestavěnou konzoli KDevelopu pro rychlý a jednoduchý přístup do příkazové řádky.",
        "Description[de]": "Dieses Modul stattet KDevelop mit einer eingebetteten Konsole zum einfachen Zugriff auf die Befehlszeile aus.",
        "Description[el]": "Αυτό το πρόσθετο προσφέρει στο KDevelop μια ενσωματωμένη konsole για γρήγορη και εύκολη πρόσβαση σε γραμμή εντολών.",
        "Description[eo]": "Ĉi tiu kromaĵo provizas KDevelop per enigita konzolo por rapida kaj facila komandlinia aliro.",
        "Description[es]": "Este complemento proporciona una consola integrada a KDevelop para acceder a la línea de órdenes de forma rápida y fácil.",
        "Description[et]": "See plugin pakub KDevelopile põimitud konsooli käsurea kiireks ja lihtsaks kasutamiseks.",
        "Description[eu]": "Plugin honek konsole kapsulatu bat txertatzen du KDevelopen komando-lerrora sarbide erraz eta arina emateko.",
        "Description[fr]": "Ce module apporte à KDevelop une konsole intégrée pour un accès à la ligne de commande rapide et facile.",
        "Description[gl]": "Este complemento fornécelle a KDevelop un konsole integrado para dispor de acceso rápido e sinxelo á liña de ordes.",
        "Description[it]": "Questa estensione dota KDevelop di una console integrata per un rapido e semplice accesso alla riga di comando.",
        "Description[ko]": "이 플러그인은 KDevelop에 Konsole을 통합하여 명령행을 쉽고 편하게 사용할 수 있습니다.",
        "Description[nl]": "Deze plugin biedt KDevelop een ingebed konsole voor snelle en gemakkelijke toegang tot commandoregels.",
        "Description[pl]": "Dodaje osadzoną konsolę do szybkiego i łatwego dostępu do wiersza poleceń w KDevelop.",
        "Description[pt]": "Este 'plugin' oferece ao KDevelop um Konsole incorporado para aceder rápida e facilmente à linha de comandos.",
        "Description[pt_BR]": "Este plugin fornece ao KDevelop um terminal embutido para acesso rápido e fácil à linha de comando.",
        "Description[ru]": "Это расширение добавляет в KDevelop встроенный терминал для быстрого и лёгкого доступа к командной строке",
        "Description[sk]": "Tento plugin poskytuje KDevelop so zabudovanou konzolou na rýchly a ľahký prístup k príkazovému riadku.",
        "Description[sl]": "Vstavek v KDevelop vgradi program Konsole za hiter in preprost dostop do ukazne vrstice.",
        "Description[sv]": "Insticksprogrammet ger KDevelop en inbyggd terminal för snabb och enkel åtkomst av kommandoraden.",
        "Description[tr]": "Bu eklenti, tez ve kolay komut satırı erişimi için K Geliştir'e gömülü bir uçbirim sağlar.",
        "Description[uk]": "За допомогою цього додатка у KDevelop можна буде скористатися вбудованою konsole, яка пришвидшить і полегшить доступ до командного рядка.",
        "Description[x-test]": "xxThis plugin provides KDevelop with an embedded konsole for quick and easy command line access.xx",
        "Description[zh_CN]": "此插件为 KDevelop 提供了一个快速方便地访问命令行的嵌入式控制台。",
        "Description[zh_TW]": "此外掛程式提供 KDevelop 一個嵌入式的 konsole，能快速地使用命令列。",
        "Icon": "utilities-terminal",
        "Name": "Konsole Integration",
        "Name[ar]": "تكامل كونسول",
        "Name[az]": "Konsole inteqrasiyası",
        "Name[bg]": "Интегриране на конзола",
        "Name[bs]": "Integracija konzole",
        "Name[ca@valencia]": "Integració de Konsole",
        "Name[ca]": "Integració del Konsole",
        "Name[cs]": "Integrace Konsole",
        "Name[da]": "Integration af Konsole",
        "Name[de]": "Konsole-Integration",
        "Name[el]": "Ενσωμάτωση Konsole",
        "Name[eo]": "Konsole-Integriĝo",
        "Name[es]": "Integración de Konsole",
        "Name[et]": "Lõimimine Konsooliga",
        "Name[eu]": "Konsole bateratzea",
        "Name[fi]": "Konsole-integrointi",
        "Name[fr]": "Intégration de Konsole",
        "Name[gl]": "Integración con Konsole",
        "Name[hu]": "Konsole integráció",
        "Name[it]": "Integrazione di Konsole",
        "Name[ka]": "Konsole-ში ინტეგრაცია",
        "Name[kk]": "Konsole біріктіруі",
        "Name[ko]": "Konsole 통합",
        "Name[nb]": "Konsole-integrering",
        "Name[nds]": "Konsool-Inbinnen",
        "Name[nl]": "Console-integratie",
        "Name[pl]": "Dodanie Konsoli",
        "Name[pt]": "Integração com o Konsole",
        "Name[pt_BR]": "Integração com o Konsole",
        "Name[ru]": "Интеграция Konsole",
        "Name[sk]": "Integrácia Konsole",
        "Name[sl]": "Vgradnja Konsole",
        "Name[sv]": "Integrering av Konsole",
        "Name[tr]": "Konsole Tümleştirmesi",
        "Name[ug]": "Konsole يۈرۈشلەشتۈرۈلۈشى",
        "Name[uk]": "Інтеграція з Konsole",
        "Name[x-test]": "xxKonsole Integrationxx",
        "Name[zh_CN]": "Konsole 整合",
        "Name[zh_TW]": "Konsole 整合"
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Mode": "GUI"
}
