{
    "KPlugin": {
        "Authors": [
            {
                "Name": "David Nolden",
                "Name[x-test]": "xxDavid Noldenxx"
            }
        ],
        "Category": "Core",
        "Description": "This plugin allows quick access to project files and language-items like classes/functions.",
        "Description[ca@valencia]": "Este connector permet un ràpid accés als fitxers del projecte i a elements del llenguatge com classes/funcions.",
        "Description[ca]": "Aquest connector permet un ràpid accés als fitxers del projecte i a elements del llenguatge com classes/funcions.",
        "Description[cs]": "Tento zásuvný modul umožňuje rychlý přístup k souborům projektu a položkám jazyka jako jsou třídy a funkce.",
        "Description[de]": "Dieses Modul bietet schnellen Zugriff auf Projektdateien und Sprachelemente wie Klassen und Funktionen.",
        "Description[es]": "Este complemento permite acceder rápidamente a los archivos del proyecto y a elementos del lenguaje, como clases y funciones.",
        "Description[et]": "See plugin pakub kiiret ligipääsu projekti failidele ja keele elementidele, näiteks klassidele ja funktsioonidele.",
        "Description[fr]": "Ce module permet un accès rapide aux fichiers du projet et aux éléments de langage comme les classes / fonctions.",
        "Description[gl]": "Este complemento permite acceder rapidamente a ficheiros de proxecto e elementos da linguaxe como clases e funcións.",
        "Description[it]": "Questa estensione permette di accedere rapidamente ai file di progetto e agli elementi del linguaggio come le classi/funzioni.",
        "Description[nl]": "Deze plugin biedt snel toegamg tot projectbestanden en taal-items zoals classes/functies.",
        "Description[pl]": "Ta wtyczka pozwala na szybki dostęp do plików projektu i elementów języka takich jak klasy i funkcje.",
        "Description[pt]": "Este 'plugin' permite o acesso rápido aos ficheiros dos projectos e aos itens das linguagens, como as classes ou funções.",
        "Description[pt_BR]": "Este plugin permite o rápido acesso a arquivos de projeto e itens da linguagem como classes/funções.",
        "Description[sk]": "Tento plugin umožňuje rýchly prístup k súborom projektu a položiek jazyka ako triedy/funkcie.",
        "Description[sl]": "Vstavek omogoča hiter dostop do projektnih datotek in predmetov kot so razredi in funkcije.",
        "Description[sv]": "Insticksprogrammet ger snabb åtkomst av projektfiler och språkobjekt som klasser och funktioner.",
        "Description[tr]": "Bu eklenti proje dosyalarına ve sınıflar/fonksiyonlar gibi dil öğelerine hızlı erişim sağlar.",
        "Description[uk]": "За допомогою цього додатка можна пришвидшити доступ до файлів проектів і елементів мови на зразок класів або функцій.",
        "Description[x-test]": "xxThis plugin allows quick access to project files and language-items like classes/functions.xx",
        "Description[zh_CN]": "此插件允许快速访问工程文件和诸如类/函数的语言项目。",
        "Icon": "quickopen",
        "Id": "kdevquickopen",
        "License": "GPL",
        "Name": "Quick Open",
        "Name[ca@valencia]": "Obertura ràpida",
        "Name[ca]": "Obertura ràpida",
        "Name[cs]": "Rychle otevřít",
        "Name[de]": "Schnellöffner",
        "Name[es]": "Apertura rápida",
        "Name[et]": "Kiiravamine",
        "Name[fr]": "Ouverture rapide",
        "Name[gl]": "Apertura rápida",
        "Name[it]": "Apertura veloce",
        "Name[nb]": "Hurtigåpne",
        "Name[nl]": "Snel openen",
        "Name[pl]": "Szybkie otwarcie",
        "Name[pt]": "Abertura Rápida",
        "Name[pt_BR]": "Abertura rápida",
        "Name[ru]": "Быстрый переход",
        "Name[sk]": "Rýchlo otvoriť",
        "Name[sl]": "Hitro odpiranje",
        "Name[sv]": "Snabböppna",
        "Name[tr]": "Hızlı Aç",
        "Name[uk]": "Швидке відкриття",
        "Name[x-test]": "xxQuick Openxx",
        "ServiceTypes": [
            "KDevelop/Plugin"
        ]
    },
    "X-KDevelop-Category": "Global",
    "X-KDevelop-Interfaces": [
        "org.kdevelop.IQuickOpen"
    ],
    "X-KDevelop-Mode": "GUI"
}
